Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __SS1Rbits_t SS1Rbits __asm__ ("SS1R") __attribute__((section("sfrs"), address(0xBF80149C)));
#define SDI2R SDI2R
extern volatile uint32_t   SDI2R __attribute__((section("sfrs"), address(0xBF8014A4)));
typedef struct {
  uint32_t SDI2R:4;
} __SDI2Rbits_t;
extern volatile __SDI2Rbits_t SDI2Rbits __asm__ ("SDI2R") __attribute__((section("sfrs"), address(0xBF8014A4)));
#define SS2R SS2R
extern volatile uint32_t   SS2R __attribute__((section("sfrs"), address(0xBF8014A8)));
typedef struct {
  uint32_t SS2R:4;
} __SS2Rbits_t;
extern volatile __SS2Rbits_t SS2Rbits __asm__ ("SS2R") __attribute__((section("sfrs"), address(0xBF8014A8)));
#define SCK3R SCK3R
extern volatile uint32_t   SCK3R __attribute__((section("sfrs"), address(0xBF8014AC)));
typedef struct {
  uint32_t SCK3R:4;
} __SCK3Rbits_t;
extern volatile __SCK3Rbits_t SCK3Rbits __asm__ ("SCK3R") __attribute__((section("sfrs"), address(0xBF8014AC)));
#define SDI3R SDI3R
extern volatile uint32_t   SDI3R __attribute__((section("sfrs"), address(0xBF8014B0)));
typedef struct {
  uint32_t SDI3R:4;
} __SDI3Rbits_t;
extern volatile __SDI3Rbits_t SDI3Rbits __asm__ ("SDI3R") __attribute__((section("sfrs"), address(0xBF8014B0)));
#define SS3R SS3R
extern volatile uint32_t   SS3R __attribute__((section("sfrs"), address(0xBF8014B4)));
typedef struct {
  uint32_t SS3R:4;
} __SS3Rbits_t;
extern volatile __SS3Rbits_t SS3Rbits __asm__ ("SS3R") __attribute__((section("sfrs"), address(0xBF8014B4)));
#define SCK4R SCK4R
extern volatile uint32_t   SCK4R __attribute__((section("sfrs"), address(0xBF8014B8)));
typedef struct {
  uint32_t SCK4R:4;
} __SCK4Rbits_t;
extern volatile __SCK4Rbits_t SCK4Rbits __asm__ ("SCK4R") __attribute__((section("sfrs"), address(0xBF8014B8)));
#define SDI4R SDI4R
extern volatile uint32_t   SDI4R __attribute__((section("sfrs"), address(0xBF8014BC)));
typedef struct {
  uint32_t SDI4R:4;
} __SDI4Rbits_t;
extern volatile __SDI4Rbits_t SDI4Rbits __asm__ ("SDI4R") __attribute__((section("sfrs"), address(0xBF8014BC)));
#define SS4R SS4R
extern volatile uint32_t   SS4R __attribute__((section("sfrs"), address(0xBF8014C0)));
typedef struct {
  uint32_t SS4R:4;
} __SS4Rbits_t;
extern volatile __SS4Rbits_t SS4Rbits __asm__ ("SS4R") __attribute__((section("sfrs"), address(0xBF8014C0)));
#define C1RXR C1RXR
extern volatile uint32_t   C1RXR __attribute__((section("sfrs"), address(0xBF8014C4)));
typedef struct {
  uint32_t C1RXR:4;
} __C1RXRbits_t;
extern volatile __C1RXRbits_t C1RXRbits __asm__ ("C1RXR") __attribute__((section("sfrs"), address(0xBF8014C4)));
#define C2RXR C2RXR
extern volatile uint32_t   C2RXR __attribute__((section("sfrs"), address(0xBF8014C8)));
typedef struct {
  uint32_t C2RXR:4;
} __C2RXRbits_t;
extern volatile __C2RXRbits_t C2RXRbits __asm__ ("C2RXR") __attribute__((section("sfrs"), address(0xBF8014C8)));
#define REFIR REFIR
extern volatile uint32_t   REFIR __attribute__((section("sfrs"), address(0xBF8014CC)));
typedef struct {
  uint32_t REFIR:4;
} __REFIRbits_t;
extern volatile __REFIRbits_t REFIRbits __asm__ ("REFIR") __attribute__((section("sfrs"), address(0xBF8014CC)));
#define QEA1R QEA1R
extern volatile uint32_t   QEA1R __attribute__((section("sfrs"), address(0xBF8014D0)));
typedef struct {
  uint32_t QEA1R:4;
} __QEA1Rbits_t;
extern volatile __QEA1Rbits_t QEA1Rbits __asm__ ("QEA1R") __attribute__((section("sfrs"), address(0xBF8014D0)));
#define QEB1R QEB1R
extern volatile uint32_t   QEB1R __attribute__((section("sfrs"), address(0xBF8014D4)));
typedef struct {
  uint32_t QEB1R:4;
} __QEB1Rbits_t;
extern volatile __QEB1Rbits_t QEB1Rbits __asm__ ("QEB1R") __attribute__((section("sfrs"), address(0xBF8014D4)));
#define INDX1R INDX1R
extern volatile uint32_t   INDX1R __attribute__((section("sfrs"), address(0xBF8014D8)));
typedef struct {
  uint32_t INDX1R:4;
} __INDX1Rbits_t;
extern volatile __INDX1Rbits_t INDX1Rbits __asm__ ("INDX1R") __attribute__((section("sfrs"), address(0xBF8014D8)));
#define HOME1R HOME1R
extern volatile uint32_t   HOME1R __attribute__((section("sfrs"), address(0xBF8014DC)));
typedef struct {
  uint32_t HOME1R:4;
} __HOME1Rbits_t;
extern volatile __HOME1Rbits_t HOME1Rbits __asm__ ("HOME1R") __attribute__((section("sfrs"), address(0xBF8014DC)));
#define QEA2R QEA2R
extern volatile uint32_t   QEA2R __attribute__((section("sfrs"), address(0xBF8014E0)));
typedef struct {
  uint32_t QEA2R:4;
} __QEA2Rbits_t;
extern volatile __QEA2Rbits_t QEA2Rbits __asm__ ("QEA2R") __attribute__((section("sfrs"), address(0xBF8014E0)));
#define QEB2R QEB2R
extern volatile uint32_t   QEB2R __attribute__((section("sfrs"), address(0xBF8014E4)));
typedef struct {
  uint32_t QEB2R:4;
} __QEB2Rbits_t;
extern volatile __QEB2Rbits_t QEB2Rbits __asm__ ("QEB2R") __attribute__((section("sfrs"), address(0xBF8014E4)));
#define INDX2R INDX2R
extern volatile uint32_t   INDX2R __attribute__((section("sfrs"), address(0xBF8014E8)));
typedef struct {
  uint32_t INDX2R:4;
} __INDX2Rbits_t;
extern volatile __INDX2Rbits_t INDX2Rbits __asm__ ("INDX2R") __attribute__((section("sfrs"), address(0xBF8014E8)));
#define HOME2R HOME2R
extern volatile uint32_t   HOME2R __attribute__((section("sfrs"), address(0xBF8014EC)));
typedef struct {
  uint32_t HOME2R:4;
} __HOME2Rbits_t;
extern volatile __HOME2Rbits_t HOME2Rbits __asm__ ("HOME2R") __attribute__((section("sfrs"), address(0xBF8014EC)));
#define FLT1R FLT1R
extern volatile uint32_t   FLT1R __attribute__((section("sfrs"), address(0xBF8014F0)));
typedef struct {
  uint32_t FLT1R:4;
} __FLT1Rbits_t;
extern volatile __FLT1Rbits_t FLT1Rbits __asm__ ("FLT1R") __attribute__((section("sfrs"), address(0xBF8014F0)));
#define FLT2R FLT2R
extern volatile uint32_t   FLT2R __attribute__((section("sfrs"), address(0xBF8014F4)));
typedef struct {
  uint32_t FLT2R:4;
} __FLT2Rbits_t;
extern volatile __FLT2Rbits_t FLT2Rbits __asm__ ("FLT2R") __attribute__((section("sfrs"), address(0xBF8014F4)));
#define IC10R IC10R
extern volatile uint32_t   IC10R __attribute__((section("sfrs"), address(0xBF8014F8)));
typedef struct {
  uint32_t IC10R:4;
} __IC10Rbits_t;
extern volatile __IC10Rbits_t IC10Rbits __asm__ ("IC10R") __attribute__((section("sfrs"), address(0xBF8014F8)));
#define IC11R IC11R
extern volatile uint32_t   IC11R __attribute__((section("sfrs"), address(0xBF8014FC)));
typedef struct {
  uint32_t IC11R:4;
} __IC11Rbits_t;
extern volatile __IC11Rbits_t IC11Rbits __asm__ ("IC11R") __attribute__((section("sfrs"), address(0xBF8014FC)));
#define IC12R IC12R
extern volatile uint32_t   IC12R __attribute__((section("sfrs"), address(0xBF801500)));
typedef struct {
  uint32_t IC12R:4;
} __IC12Rbits_t;
extern volatile __IC12Rbits_t IC12Rbits __asm__ ("IC12R") __attribute__((section("sfrs"), address(0xBF801500)));
#define IC13R IC13R
extern volatile uint32_t   IC13R __attribute__((section("sfrs"), address(0xBF801504)));
typedef struct {
  uint32_t IC13R:4;
} __IC13Rbits_t;
extern volatile __IC13Rbits_t IC13Rbits __asm__ ("IC13R") __attribute__((section("sfrs"), address(0xBF801504)));
#define IC14R IC14R
extern volatile uint32_t   IC14R __attribute__((section("sfrs"), address(0xBF801508)));
typedef struct {
  uint32_t IC14R:4;
} __IC14Rbits_t;
extern volatile __IC14Rbits_t IC14Rbits __asm__ ("IC14R") __attribute__((section("sfrs"), address(0xBF801508)));
#define IC15R IC15R
extern volatile uint32_t   IC15R __attribute__((section("sfrs"), address(0xBF80150C)));
typedef struct {
  uint32_t IC15R:4;
} __IC15Rbits_t;
extern volatile __IC15Rbits_t IC15Rbits __asm__ ("IC15R") __attribute__((section("sfrs"), address(0xBF80150C)));
#define IC16R IC16R
extern volatile uint32_t   IC16R __attribute__((section("sfrs"), address(0xBF801510)));
typedef struct {
  uint32_t IC16R:4;
} __IC16Rbits_t;
