Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __OFF120bits_t OFF120bits __asm__ ("OFF120") __attribute__((section("sfrs"), address(0xBF810720)));
#define OFF121 OFF121
extern volatile uint32_t   OFF121 __attribute__((section("sfrs"), address(0xBF810724)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF121bits_t;
extern volatile __OFF121bits_t OFF121bits __asm__ ("OFF121") __attribute__((section("sfrs"), address(0xBF810724)));
#define OFF122 OFF122
extern volatile uint32_t   OFF122 __attribute__((section("sfrs"), address(0xBF810728)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF122bits_t;
extern volatile __OFF122bits_t OFF122bits __asm__ ("OFF122") __attribute__((section("sfrs"), address(0xBF810728)));
#define OFF123 OFF123
extern volatile uint32_t   OFF123 __attribute__((section("sfrs"), address(0xBF81072C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF123bits_t;
extern volatile __OFF123bits_t OFF123bits __asm__ ("OFF123") __attribute__((section("sfrs"), address(0xBF81072C)));
#define OFF124 OFF124
extern volatile uint32_t   OFF124 __attribute__((section("sfrs"), address(0xBF810730)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF124bits_t;
extern volatile __OFF124bits_t OFF124bits __asm__ ("OFF124") __attribute__((section("sfrs"), address(0xBF810730)));
#define OFF125 OFF125
extern volatile uint32_t   OFF125 __attribute__((section("sfrs"), address(0xBF810734)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF125bits_t;
extern volatile __OFF125bits_t OFF125bits __asm__ ("OFF125") __attribute__((section("sfrs"), address(0xBF810734)));
#define OFF126 OFF126
extern volatile uint32_t   OFF126 __attribute__((section("sfrs"), address(0xBF810738)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF126bits_t;
extern volatile __OFF126bits_t OFF126bits __asm__ ("OFF126") __attribute__((section("sfrs"), address(0xBF810738)));
#define OFF127 OFF127
extern volatile uint32_t   OFF127 __attribute__((section("sfrs"), address(0xBF81073C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF127bits_t;
extern volatile __OFF127bits_t OFF127bits __asm__ ("OFF127") __attribute__((section("sfrs"), address(0xBF81073C)));
#define OFF128 OFF128
extern volatile uint32_t   OFF128 __attribute__((section("sfrs"), address(0xBF810740)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF128bits_t;
extern volatile __OFF128bits_t OFF128bits __asm__ ("OFF128") __attribute__((section("sfrs"), address(0xBF810740)));
#define OFF129 OFF129
extern volatile uint32_t   OFF129 __attribute__((section("sfrs"), address(0xBF810744)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF129bits_t;
extern volatile __OFF129bits_t OFF129bits __asm__ ("OFF129") __attribute__((section("sfrs"), address(0xBF810744)));
#define OFF130 OFF130
extern volatile uint32_t   OFF130 __attribute__((section("sfrs"), address(0xBF810748)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF130bits_t;
extern volatile __OFF130bits_t OFF130bits __asm__ ("OFF130") __attribute__((section("sfrs"), address(0xBF810748)));
#define OFF131 OFF131
extern volatile uint32_t   OFF131 __attribute__((section("sfrs"), address(0xBF81074C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF131bits_t;
extern volatile __OFF131bits_t OFF131bits __asm__ ("OFF131") __attribute__((section("sfrs"), address(0xBF81074C)));
#define OFF132 OFF132
extern volatile uint32_t   OFF132 __attribute__((section("sfrs"), address(0xBF810750)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF132bits_t;
extern volatile __OFF132bits_t OFF132bits __asm__ ("OFF132") __attribute__((section("sfrs"), address(0xBF810750)));
#define OFF133 OFF133
extern volatile uint32_t   OFF133 __attribute__((section("sfrs"), address(0xBF810754)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF133bits_t;
extern volatile __OFF133bits_t OFF133bits __asm__ ("OFF133") __attribute__((section("sfrs"), address(0xBF810754)));
#define OFF139 OFF139
extern volatile uint32_t   OFF139 __attribute__((section("sfrs"), address(0xBF81076C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF139bits_t;
extern volatile __OFF139bits_t OFF139bits __asm__ ("OFF139") __attribute__((section("sfrs"), address(0xBF81076C)));
#define OFF140 OFF140
extern volatile uint32_t   OFF140 __attribute__((section("sfrs"), address(0xBF810770)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF140bits_t;
extern volatile __OFF140bits_t OFF140bits __asm__ ("OFF140") __attribute__((section("sfrs"), address(0xBF810770)));
#define OFF141 OFF141
extern volatile uint32_t   OFF141 __attribute__((section("sfrs"), address(0xBF810774)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF141bits_t;
extern volatile __OFF141bits_t OFF141bits __asm__ ("OFF141") __attribute__((section("sfrs"), address(0xBF810774)));
#define OFF142 OFF142
extern volatile uint32_t   OFF142 __attribute__((section("sfrs"), address(0xBF810778)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF142bits_t;
extern volatile __OFF142bits_t OFF142bits __asm__ ("OFF142") __attribute__((section("sfrs"), address(0xBF810778)));
#define OFF143 OFF143
extern volatile uint32_t   OFF143 __attribute__((section("sfrs"), address(0xBF81077C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF143bits_t;
extern volatile __OFF143bits_t OFF143bits __asm__ ("OFF143") __attribute__((section("sfrs"), address(0xBF81077C)));
#define OFF144 OFF144
extern volatile uint32_t   OFF144 __attribute__((section("sfrs"), address(0xBF810780)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF144bits_t;
extern volatile __OFF144bits_t OFF144bits __asm__ ("OFF144") __attribute__((section("sfrs"), address(0xBF810780)));
#define OFF145 OFF145
extern volatile uint32_t   OFF145 __attribute__((section("sfrs"), address(0xBF810784)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF145bits_t;
extern volatile __OFF145bits_t OFF145bits __asm__ ("OFF145") __attribute__((section("sfrs"), address(0xBF810784)));
#define OFF146 OFF146
extern volatile uint32_t   OFF146 __attribute__((section("sfrs"), address(0xBF810788)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF146bits_t;
extern volatile __OFF146bits_t OFF146bits __asm__ ("OFF146") __attribute__((section("sfrs"), address(0xBF810788)));
#define OFF147 OFF147
extern volatile uint32_t   OFF147 __attribute__((section("sfrs"), address(0xBF81078C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF147bits_t;
extern volatile __OFF147bits_t OFF147bits __asm__ ("OFF147") __attribute__((section("sfrs"), address(0xBF81078C)));
#define OFF151 OFF151
extern volatile uint32_t   OFF151 __attribute__((section("sfrs"), address(0xBF81079C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF151bits_t;
