Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __LEBCON1bits_t LEBCON1bits __asm__ ("LEBCON1") __attribute__((section("sfrs"), address(0xBF82A180)));
extern volatile uint32_t        LEBCON1CLR __attribute__((section("sfrs"),address(0xBF82A184)));
extern volatile uint32_t        LEBCON1SET __attribute__((section("sfrs"),address(0xBF82A188)));
extern volatile uint32_t        LEBCON1INV __attribute__((section("sfrs"),address(0xBF82A18C)));
#define LEBDLY1 LEBDLY1
extern volatile uint32_t   LEBDLY1 __attribute__((section("sfrs"), address(0xBF82A190)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY1bits_t;
extern volatile __LEBDLY1bits_t LEBDLY1bits __asm__ ("LEBDLY1") __attribute__((section("sfrs"), address(0xBF82A190)));
extern volatile uint32_t        LEBDLY1CLR __attribute__((section("sfrs"),address(0xBF82A194)));
extern volatile uint32_t        LEBDLY1SET __attribute__((section("sfrs"),address(0xBF82A198)));
extern volatile uint32_t        LEBDLY1INV __attribute__((section("sfrs"),address(0xBF82A19C)));
#define AUXCON1 AUXCON1
extern volatile uint32_t   AUXCON1 __attribute__((section("sfrs"), address(0xBF82A1A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON1bits_t;
extern volatile __AUXCON1bits_t AUXCON1bits __asm__ ("AUXCON1") __attribute__((section("sfrs"), address(0xBF82A1A0)));
extern volatile uint32_t        AUXCON1CLR __attribute__((section("sfrs"),address(0xBF82A1A4)));
extern volatile uint32_t        AUXCON1SET __attribute__((section("sfrs"),address(0xBF82A1A8)));
extern volatile uint32_t        AUXCON1INV __attribute__((section("sfrs"),address(0xBF82A1AC)));
#define PTMR1 PTMR1
extern volatile uint32_t   PTMR1 __attribute__((section("sfrs"), address(0xBF82A1B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR1bits_t;
extern volatile __PTMR1bits_t PTMR1bits __asm__ ("PTMR1") __attribute__((section("sfrs"), address(0xBF82A1B0)));
extern volatile uint32_t        PTMR1CLR __attribute__((section("sfrs"),address(0xBF82A1B4)));
extern volatile uint32_t        PTMR1SET __attribute__((section("sfrs"),address(0xBF82A1B8)));
extern volatile uint32_t        PTMR1INV __attribute__((section("sfrs"),address(0xBF82A1BC)));
#define PWMCON2 PWMCON2
extern volatile uint32_t   PWMCON2 __attribute__((section("sfrs"), address(0xBF82A1C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON2bits_t;
extern volatile __PWMCON2bits_t PWMCON2bits __asm__ ("PWMCON2") __attribute__((section("sfrs"), address(0xBF82A1C0)));
extern volatile uint32_t        PWMCON2CLR __attribute__((section("sfrs"),address(0xBF82A1C4)));
extern volatile uint32_t        PWMCON2SET __attribute__((section("sfrs"),address(0xBF82A1C8)));
extern volatile uint32_t        PWMCON2INV __attribute__((section("sfrs"),address(0xBF82A1CC)));
#define IOCON2 IOCON2
extern volatile uint32_t   IOCON2 __attribute__((section("sfrs"), address(0xBF82A1D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON2bits_t;
extern volatile __IOCON2bits_t IOCON2bits __asm__ ("IOCON2") __attribute__((section("sfrs"), address(0xBF82A1D0)));
extern volatile uint32_t        IOCON2CLR __attribute__((section("sfrs"),address(0xBF82A1D4)));
extern volatile uint32_t        IOCON2SET __attribute__((section("sfrs"),address(0xBF82A1D8)));
extern volatile uint32_t        IOCON2INV __attribute__((section("sfrs"),address(0xBF82A1DC)));
#define PDC2 PDC2
extern volatile uint32_t   PDC2 __attribute__((section("sfrs"), address(0xBF82A1E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC2bits_t;
extern volatile __PDC2bits_t PDC2bits __asm__ ("PDC2") __attribute__((section("sfrs"), address(0xBF82A1E0)));
extern volatile uint32_t        PDC2CLR __attribute__((section("sfrs"),address(0xBF82A1E4)));
extern volatile uint32_t        PDC2SET __attribute__((section("sfrs"),address(0xBF82A1E8)));
extern volatile uint32_t        PDC2INV __attribute__((section("sfrs"),address(0xBF82A1EC)));
#define SDC2 SDC2
extern volatile uint32_t   SDC2 __attribute__((section("sfrs"), address(0xBF82A1F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC2bits_t;
extern volatile __SDC2bits_t SDC2bits __asm__ ("SDC2") __attribute__((section("sfrs"), address(0xBF82A1F0)));
extern volatile uint32_t        SDC2CLR __attribute__((section("sfrs"),address(0xBF82A1F4)));
extern volatile uint32_t        SDC2SET __attribute__((section("sfrs"),address(0xBF82A1F8)));
extern volatile uint32_t        SDC2INV __attribute__((section("sfrs"),address(0xBF82A1FC)));
#define PHASE2 PHASE2
extern volatile uint32_t   PHASE2 __attribute__((section("sfrs"), address(0xBF82A200)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE2bits_t;
extern volatile __PHASE2bits_t PHASE2bits __asm__ ("PHASE2") __attribute__((section("sfrs"), address(0xBF82A200)));
extern volatile uint32_t        PHASE2CLR __attribute__((section("sfrs"),address(0xBF82A204)));
extern volatile uint32_t        PHASE2SET __attribute__((section("sfrs"),address(0xBF82A208)));
extern volatile uint32_t        PHASE2INV __attribute__((section("sfrs"),address(0xBF82A20C)));
#define DTR2 DTR2
extern volatile uint32_t   DTR2 __attribute__((section("sfrs"), address(0xBF82A210)));
typedef struct {
  uint32_t DTR:16;
} __DTR2bits_t;
extern volatile __DTR2bits_t DTR2bits __asm__ ("DTR2") __attribute__((section("sfrs"), address(0xBF82A210)));
extern volatile uint32_t        DTR2CLR __attribute__((section("sfrs"),address(0xBF82A214)));
extern volatile uint32_t        DTR2SET __attribute__((section("sfrs"),address(0xBF82A218)));
extern volatile uint32_t        DTR2INV __attribute__((section("sfrs"),address(0xBF82A21C)));
#define ALTDTR2 ALTDTR2
extern volatile uint32_t   ALTDTR2 __attribute__((section("sfrs"), address(0xBF82A220)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR2bits_t;
extern volatile __ALTDTR2bits_t ALTDTR2bits __asm__ ("ALTDTR2") __attribute__((section("sfrs"), address(0xBF82A220)));
extern volatile uint32_t        ALTDTR2CLR __attribute__((section("sfrs"),address(0xBF82A224)));
extern volatile uint32_t        ALTDTR2SET __attribute__((section("sfrs"),address(0xBF82A228)));
extern volatile uint32_t        ALTDTR2INV __attribute__((section("sfrs"),address(0xBF82A22C)));
#define DTCOMP2 DTCOMP2
extern volatile uint32_t   DTCOMP2 __attribute__((section("sfrs"), address(0xBF82A230)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP2bits_t;
extern volatile __DTCOMP2bits_t DTCOMP2bits __asm__ ("DTCOMP2") __attribute__((section("sfrs"), address(0xBF82A230)));
extern volatile uint32_t        DTCOMP2CLR __attribute__((section("sfrs"),address(0xBF82A234)));
extern volatile uint32_t        DTCOMP2SET __attribute__((section("sfrs"),address(0xBF82A238)));
extern volatile uint32_t        DTCOMP2INV __attribute__((section("sfrs"),address(0xBF82A23C)));
#define TRIG2 TRIG2
extern volatile uint32_t   TRIG2 __attribute__((section("sfrs"), address(0xBF82A240)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG2bits_t;
extern volatile __TRIG2bits_t TRIG2bits __asm__ ("TRIG2") __attribute__((section("sfrs"), address(0xBF82A240)));
extern volatile uint32_t        TRIG2CLR __attribute__((section("sfrs"),address(0xBF82A244)));
extern volatile uint32_t        TRIG2SET __attribute__((section("sfrs"),address(0xBF82A248)));
extern volatile uint32_t        TRIG2INV __attribute__((section("sfrs"),address(0xBF82A24C)));
#define TRGCON2 TRGCON2
extern volatile uint32_t   TRGCON2 __attribute__((section("sfrs"), address(0xBF82A250)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON2bits_t;
extern volatile __TRGCON2bits_t TRGCON2bits __asm__ ("TRGCON2") __attribute__((section("sfrs"), address(0xBF82A250)));
extern volatile uint32_t        TRGCON2CLR __attribute__((section("sfrs"),address(0xBF82A254)));
extern volatile uint32_t        TRGCON2SET __attribute__((section("sfrs"),address(0xBF82A258)));
extern volatile uint32_t        TRGCON2INV __attribute__((section("sfrs"),address(0xBF82A25C)));
#define STRIG2 STRIG2
extern volatile uint32_t   STRIG2 __attribute__((section("sfrs"), address(0xBF82A260)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG2bits_t;
