Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD2FIFOUA29bits_t CFD2FIFOUA29bits __asm__ ("CFD2FIFOUA29") __attribute__((section("sfrs"), address(0xBF8816D0)));
extern volatile uint32_t        CFD2FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF8816D4)));
extern volatile uint32_t        CFD2FIFOUA29SET __attribute__((section("sfrs"),address(0xBF8816D8)));
extern volatile uint32_t        CFD2FIFOUA29INV __attribute__((section("sfrs"),address(0xBF8816DC)));
#define CFD2FIFOCON30 CFD2FIFOCON30
extern volatile uint32_t   CFD2FIFOCON30 __attribute__((section("sfrs"), address(0xBF8816E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON30bits_t;
extern volatile __CFD2FIFOCON30bits_t CFD2FIFOCON30bits __asm__ ("CFD2FIFOCON30") __attribute__((section("sfrs"), address(0xBF8816E0)));
extern volatile uint32_t        CFD2FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF8816E4)));
extern volatile uint32_t        CFD2FIFOCON30SET __attribute__((section("sfrs"),address(0xBF8816E8)));
extern volatile uint32_t        CFD2FIFOCON30INV __attribute__((section("sfrs"),address(0xBF8816EC)));
#define CFD2FIFOSTA30 CFD2FIFOSTA30
extern volatile uint32_t   CFD2FIFOSTA30 __attribute__((section("sfrs"), address(0xBF8816F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA30bits_t;
extern volatile __CFD2FIFOSTA30bits_t CFD2FIFOSTA30bits __asm__ ("CFD2FIFOSTA30") __attribute__((section("sfrs"), address(0xBF8816F0)));
extern volatile uint32_t        CFD2FIFOSTA30CLR __attribute__((section("sfrs"),address(0xBF8816F4)));
extern volatile uint32_t        CFD2FIFOSTA30SET __attribute__((section("sfrs"),address(0xBF8816F8)));
extern volatile uint32_t        CFD2FIFOSTA30INV __attribute__((section("sfrs"),address(0xBF8816FC)));
#define CFD2FIFOUA30 CFD2FIFOUA30
extern volatile uint32_t   CFD2FIFOUA30 __attribute__((section("sfrs"), address(0xBF881700)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA30bits_t;
extern volatile __CFD2FIFOUA30bits_t CFD2FIFOUA30bits __asm__ ("CFD2FIFOUA30") __attribute__((section("sfrs"), address(0xBF881700)));
extern volatile uint32_t        CFD2FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF881704)));
extern volatile uint32_t        CFD2FIFOUA30SET __attribute__((section("sfrs"),address(0xBF881708)));
extern volatile uint32_t        CFD2FIFOUA30INV __attribute__((section("sfrs"),address(0xBF88170C)));
#define CFD2FIFOCON31 CFD2FIFOCON31
extern volatile uint32_t   CFD2FIFOCON31 __attribute__((section("sfrs"), address(0xBF881710)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON31bits_t;
extern volatile __CFD2FIFOCON31bits_t CFD2FIFOCON31bits __asm__ ("CFD2FIFOCON31") __attribute__((section("sfrs"), address(0xBF881710)));
extern volatile uint32_t        CFD2FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF881714)));
extern volatile uint32_t        CFD2FIFOCON31SET __attribute__((section("sfrs"),address(0xBF881718)));
extern volatile uint32_t        CFD2FIFOCON31INV __attribute__((section("sfrs"),address(0xBF88171C)));
#define CFD2FIFOSTA31 CFD2FIFOSTA31
extern volatile uint32_t   CFD2FIFOSTA31 __attribute__((section("sfrs"), address(0xBF881720)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA31bits_t;
extern volatile __CFD2FIFOSTA31bits_t CFD2FIFOSTA31bits __asm__ ("CFD2FIFOSTA31") __attribute__((section("sfrs"), address(0xBF881720)));
extern volatile uint32_t        CFD2FIFOSTA31CLR __attribute__((section("sfrs"),address(0xBF881724)));
extern volatile uint32_t        CFD2FIFOSTA31SET __attribute__((section("sfrs"),address(0xBF881728)));
extern volatile uint32_t        CFD2FIFOSTA31INV __attribute__((section("sfrs"),address(0xBF88172C)));
#define CFD2FIFOUA31 CFD2FIFOUA31
extern volatile uint32_t   CFD2FIFOUA31 __attribute__((section("sfrs"), address(0xBF881730)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA31bits_t;
extern volatile __CFD2FIFOUA31bits_t CFD2FIFOUA31bits __asm__ ("CFD2FIFOUA31") __attribute__((section("sfrs"), address(0xBF881730)));
extern volatile uint32_t        CFD2FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF881734)));
extern volatile uint32_t        CFD2FIFOUA31SET __attribute__((section("sfrs"),address(0xBF881738)));
extern volatile uint32_t        CFD2FIFOUA31INV __attribute__((section("sfrs"),address(0xBF88173C)));
#define CFD2FLTCON0 CFD2FLTCON0
extern volatile uint32_t   CFD2FLTCON0 __attribute__((section("sfrs"), address(0xBF881740)));
typedef struct {
  uint32_t F0BP:5;
  uint32_t :2;
  uint32_t FLTEN0:1;
  uint32_t F1BP:5;
  uint32_t :2;
  uint32_t FLTEN1:1;
  uint32_t F2BP:5;
  uint32_t :2;
  uint32_t FLTEN2:1;
  uint32_t F3BP:5;
  uint32_t :2;
  uint32_t FLTEN3:1;
} __CFD2FLTCON0bits_t;
extern volatile __CFD2FLTCON0bits_t CFD2FLTCON0bits __asm__ ("CFD2FLTCON0") __attribute__((section("sfrs"), address(0xBF881740)));
extern volatile uint32_t        CFD2FLTCON0CLR __attribute__((section("sfrs"),address(0xBF881744)));
extern volatile uint32_t        CFD2FLTCON0SET __attribute__((section("sfrs"),address(0xBF881748)));
extern volatile uint32_t        CFD2FLTCON0INV __attribute__((section("sfrs"),address(0xBF88174C)));
#define CFD2FLTCON1 CFD2FLTCON1
extern volatile uint32_t   CFD2FLTCON1 __attribute__((section("sfrs"), address(0xBF881750)));
typedef struct {
  uint32_t F4BP:5;
  uint32_t :2;
  uint32_t FLTEN4:1;
  uint32_t F5BP:5;
  uint32_t :2;
  uint32_t FLTEN5:1;
  uint32_t F6BP:5;
  uint32_t :2;
  uint32_t FLTEN6:1;
  uint32_t F7BP:5;
  uint32_t :2;
  uint32_t FLTEN7:1;
} __CFD2FLTCON1bits_t;
