Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD3FIFOSTA7bits_t CFD3FIFOSTA7bits __asm__ ("CFD3FIFOSTA7") __attribute__((section("sfrs"), address(0xBF8842A0)));
extern volatile uint32_t        CFD3FIFOSTA7CLR __attribute__((section("sfrs"),address(0xBF8842A4)));
extern volatile uint32_t        CFD3FIFOSTA7SET __attribute__((section("sfrs"),address(0xBF8842A8)));
extern volatile uint32_t        CFD3FIFOSTA7INV __attribute__((section("sfrs"),address(0xBF8842AC)));
#define CFD3FIFOUA7 CFD3FIFOUA7
extern volatile uint32_t   CFD3FIFOUA7 __attribute__((section("sfrs"), address(0xBF8842B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA7bits_t;
extern volatile __CFD3FIFOUA7bits_t CFD3FIFOUA7bits __asm__ ("CFD3FIFOUA7") __attribute__((section("sfrs"), address(0xBF8842B0)));
extern volatile uint32_t        CFD3FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF8842B4)));
extern volatile uint32_t        CFD3FIFOUA7SET __attribute__((section("sfrs"),address(0xBF8842B8)));
extern volatile uint32_t        CFD3FIFOUA7INV __attribute__((section("sfrs"),address(0xBF8842BC)));
#define CFD3FIFOCON8 CFD3FIFOCON8
extern volatile uint32_t   CFD3FIFOCON8 __attribute__((section("sfrs"), address(0xBF8842C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON8bits_t;
extern volatile __CFD3FIFOCON8bits_t CFD3FIFOCON8bits __asm__ ("CFD3FIFOCON8") __attribute__((section("sfrs"), address(0xBF8842C0)));
extern volatile uint32_t        CFD3FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF8842C4)));
extern volatile uint32_t        CFD3FIFOCON8SET __attribute__((section("sfrs"),address(0xBF8842C8)));
extern volatile uint32_t        CFD3FIFOCON8INV __attribute__((section("sfrs"),address(0xBF8842CC)));
#define CFD3FIFOSTA8 CFD3FIFOSTA8
extern volatile uint32_t   CFD3FIFOSTA8 __attribute__((section("sfrs"), address(0xBF8842D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA8bits_t;
extern volatile __CFD3FIFOSTA8bits_t CFD3FIFOSTA8bits __asm__ ("CFD3FIFOSTA8") __attribute__((section("sfrs"), address(0xBF8842D0)));
extern volatile uint32_t        CFD3FIFOSTA8CLR __attribute__((section("sfrs"),address(0xBF8842D4)));
extern volatile uint32_t        CFD3FIFOSTA8SET __attribute__((section("sfrs"),address(0xBF8842D8)));
extern volatile uint32_t        CFD3FIFOSTA8INV __attribute__((section("sfrs"),address(0xBF8842DC)));
#define CFD3FIFOUA8 CFD3FIFOUA8
extern volatile uint32_t   CFD3FIFOUA8 __attribute__((section("sfrs"), address(0xBF8842E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA8bits_t;
extern volatile __CFD3FIFOUA8bits_t CFD3FIFOUA8bits __asm__ ("CFD3FIFOUA8") __attribute__((section("sfrs"), address(0xBF8842E0)));
extern volatile uint32_t        CFD3FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF8842E4)));
extern volatile uint32_t        CFD3FIFOUA8SET __attribute__((section("sfrs"),address(0xBF8842E8)));
extern volatile uint32_t        CFD3FIFOUA8INV __attribute__((section("sfrs"),address(0xBF8842EC)));
#define CFD3FIFOCON9 CFD3FIFOCON9
extern volatile uint32_t   CFD3FIFOCON9 __attribute__((section("sfrs"), address(0xBF8842F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON9bits_t;
extern volatile __CFD3FIFOCON9bits_t CFD3FIFOCON9bits __asm__ ("CFD3FIFOCON9") __attribute__((section("sfrs"), address(0xBF8842F0)));
extern volatile uint32_t        CFD3FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF8842F4)));
extern volatile uint32_t        CFD3FIFOCON9SET __attribute__((section("sfrs"),address(0xBF8842F8)));
extern volatile uint32_t        CFD3FIFOCON9INV __attribute__((section("sfrs"),address(0xBF8842FC)));
#define CFD3FIFOSTA9 CFD3FIFOSTA9
extern volatile uint32_t   CFD3FIFOSTA9 __attribute__((section("sfrs"), address(0xBF884300)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA9bits_t;
extern volatile __CFD3FIFOSTA9bits_t CFD3FIFOSTA9bits __asm__ ("CFD3FIFOSTA9") __attribute__((section("sfrs"), address(0xBF884300)));
extern volatile uint32_t        CFD3FIFOSTA9CLR __attribute__((section("sfrs"),address(0xBF884304)));
extern volatile uint32_t        CFD3FIFOSTA9SET __attribute__((section("sfrs"),address(0xBF884308)));
extern volatile uint32_t        CFD3FIFOSTA9INV __attribute__((section("sfrs"),address(0xBF88430C)));
#define CFD3FIFOUA9 CFD3FIFOUA9
extern volatile uint32_t   CFD3FIFOUA9 __attribute__((section("sfrs"), address(0xBF884310)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA9bits_t;
extern volatile __CFD3FIFOUA9bits_t CFD3FIFOUA9bits __asm__ ("CFD3FIFOUA9") __attribute__((section("sfrs"), address(0xBF884310)));
extern volatile uint32_t        CFD3FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF884314)));
extern volatile uint32_t        CFD3FIFOUA9SET __attribute__((section("sfrs"),address(0xBF884318)));
extern volatile uint32_t        CFD3FIFOUA9INV __attribute__((section("sfrs"),address(0xBF88431C)));
#define CFD3FIFOCON10 CFD3FIFOCON10
extern volatile uint32_t   CFD3FIFOCON10 __attribute__((section("sfrs"), address(0xBF884320)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON10bits_t;
extern volatile __CFD3FIFOCON10bits_t CFD3FIFOCON10bits __asm__ ("CFD3FIFOCON10") __attribute__((section("sfrs"), address(0xBF884320)));
extern volatile uint32_t        CFD3FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF884324)));
extern volatile uint32_t        CFD3FIFOCON10SET __attribute__((section("sfrs"),address(0xBF884328)));
extern volatile uint32_t        CFD3FIFOCON10INV __attribute__((section("sfrs"),address(0xBF88432C)));
#define CFD3FIFOSTA10 CFD3FIFOSTA10
extern volatile uint32_t   CFD3FIFOSTA10 __attribute__((section("sfrs"), address(0xBF884330)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA10bits_t;
extern volatile __CFD3FIFOSTA10bits_t CFD3FIFOSTA10bits __asm__ ("CFD3FIFOSTA10") __attribute__((section("sfrs"), address(0xBF884330)));
extern volatile uint32_t        CFD3FIFOSTA10CLR __attribute__((section("sfrs"),address(0xBF884334)));
extern volatile uint32_t        CFD3FIFOSTA10SET __attribute__((section("sfrs"),address(0xBF884338)));
extern volatile uint32_t        CFD3FIFOSTA10INV __attribute__((section("sfrs"),address(0xBF88433C)));
#define CFD3FIFOUA10 CFD3FIFOUA10
extern volatile uint32_t   CFD3FIFOUA10 __attribute__((section("sfrs"), address(0xBF884340)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA10bits_t;
extern volatile __CFD3FIFOUA10bits_t CFD3FIFOUA10bits __asm__ ("CFD3FIFOUA10") __attribute__((section("sfrs"), address(0xBF884340)));
extern volatile uint32_t        CFD3FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF884344)));
extern volatile uint32_t        CFD3FIFOUA10SET __attribute__((section("sfrs"),address(0xBF884348)));
extern volatile uint32_t        CFD3FIFOUA10INV __attribute__((section("sfrs"),address(0xBF88434C)));
#define CFD3FIFOCON11 CFD3FIFOCON11
extern volatile uint32_t   CFD3FIFOCON11 __attribute__((section("sfrs"), address(0xBF884350)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON11bits_t;
