Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD3FIFOUA23bits_t CFD3FIFOUA23bits __asm__ ("CFD3FIFOUA23") __attribute__((section("sfrs"), address(0xBF8845B0)));
extern volatile uint32_t        CFD3FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF8845B4)));
extern volatile uint32_t        CFD3FIFOUA23SET __attribute__((section("sfrs"),address(0xBF8845B8)));
extern volatile uint32_t        CFD3FIFOUA23INV __attribute__((section("sfrs"),address(0xBF8845BC)));
#define CFD3FIFOCON24 CFD3FIFOCON24
extern volatile uint32_t   CFD3FIFOCON24 __attribute__((section("sfrs"), address(0xBF8845C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON24bits_t;
extern volatile __CFD3FIFOCON24bits_t CFD3FIFOCON24bits __asm__ ("CFD3FIFOCON24") __attribute__((section("sfrs"), address(0xBF8845C0)));
extern volatile uint32_t        CFD3FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF8845C4)));
extern volatile uint32_t        CFD3FIFOCON24SET __attribute__((section("sfrs"),address(0xBF8845C8)));
extern volatile uint32_t        CFD3FIFOCON24INV __attribute__((section("sfrs"),address(0xBF8845CC)));
#define CFD3FIFOSTA24 CFD3FIFOSTA24
extern volatile uint32_t   CFD3FIFOSTA24 __attribute__((section("sfrs"), address(0xBF8845D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA24bits_t;
extern volatile __CFD3FIFOSTA24bits_t CFD3FIFOSTA24bits __asm__ ("CFD3FIFOSTA24") __attribute__((section("sfrs"), address(0xBF8845D0)));
extern volatile uint32_t        CFD3FIFOSTA24CLR __attribute__((section("sfrs"),address(0xBF8845D4)));
extern volatile uint32_t        CFD3FIFOSTA24SET __attribute__((section("sfrs"),address(0xBF8845D8)));
extern volatile uint32_t        CFD3FIFOSTA24INV __attribute__((section("sfrs"),address(0xBF8845DC)));
#define CFD3FIFOUA24 CFD3FIFOUA24
extern volatile uint32_t   CFD3FIFOUA24 __attribute__((section("sfrs"), address(0xBF8845E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA24bits_t;
extern volatile __CFD3FIFOUA24bits_t CFD3FIFOUA24bits __asm__ ("CFD3FIFOUA24") __attribute__((section("sfrs"), address(0xBF8845E0)));
extern volatile uint32_t        CFD3FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF8845E4)));
extern volatile uint32_t        CFD3FIFOUA24SET __attribute__((section("sfrs"),address(0xBF8845E8)));
extern volatile uint32_t        CFD3FIFOUA24INV __attribute__((section("sfrs"),address(0xBF8845EC)));
#define CFD3FIFOCON25 CFD3FIFOCON25
extern volatile uint32_t   CFD3FIFOCON25 __attribute__((section("sfrs"), address(0xBF8845F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON25bits_t;
extern volatile __CFD3FIFOCON25bits_t CFD3FIFOCON25bits __asm__ ("CFD3FIFOCON25") __attribute__((section("sfrs"), address(0xBF8845F0)));
extern volatile uint32_t        CFD3FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF8845F4)));
extern volatile uint32_t        CFD3FIFOCON25SET __attribute__((section("sfrs"),address(0xBF8845F8)));
extern volatile uint32_t        CFD3FIFOCON25INV __attribute__((section("sfrs"),address(0xBF8845FC)));
#define CFD3FIFOSTA25 CFD3FIFOSTA25
extern volatile uint32_t   CFD3FIFOSTA25 __attribute__((section("sfrs"), address(0xBF884600)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA25bits_t;
extern volatile __CFD3FIFOSTA25bits_t CFD3FIFOSTA25bits __asm__ ("CFD3FIFOSTA25") __attribute__((section("sfrs"), address(0xBF884600)));
extern volatile uint32_t        CFD3FIFOSTA25CLR __attribute__((section("sfrs"),address(0xBF884604)));
extern volatile uint32_t        CFD3FIFOSTA25SET __attribute__((section("sfrs"),address(0xBF884608)));
extern volatile uint32_t        CFD3FIFOSTA25INV __attribute__((section("sfrs"),address(0xBF88460C)));
#define CFD3FIFOUA25 CFD3FIFOUA25
extern volatile uint32_t   CFD3FIFOUA25 __attribute__((section("sfrs"), address(0xBF884610)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA25bits_t;
extern volatile __CFD3FIFOUA25bits_t CFD3FIFOUA25bits __asm__ ("CFD3FIFOUA25") __attribute__((section("sfrs"), address(0xBF884610)));
extern volatile uint32_t        CFD3FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF884614)));
extern volatile uint32_t        CFD3FIFOUA25SET __attribute__((section("sfrs"),address(0xBF884618)));
extern volatile uint32_t        CFD3FIFOUA25INV __attribute__((section("sfrs"),address(0xBF88461C)));
#define CFD3FIFOCON26 CFD3FIFOCON26
extern volatile uint32_t   CFD3FIFOCON26 __attribute__((section("sfrs"), address(0xBF884620)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON26bits_t;
extern volatile __CFD3FIFOCON26bits_t CFD3FIFOCON26bits __asm__ ("CFD3FIFOCON26") __attribute__((section("sfrs"), address(0xBF884620)));
extern volatile uint32_t        CFD3FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF884624)));
extern volatile uint32_t        CFD3FIFOCON26SET __attribute__((section("sfrs"),address(0xBF884628)));
extern volatile uint32_t        CFD3FIFOCON26INV __attribute__((section("sfrs"),address(0xBF88462C)));
#define CFD3FIFOSTA26 CFD3FIFOSTA26
extern volatile uint32_t   CFD3FIFOSTA26 __attribute__((section("sfrs"), address(0xBF884630)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA26bits_t;
extern volatile __CFD3FIFOSTA26bits_t CFD3FIFOSTA26bits __asm__ ("CFD3FIFOSTA26") __attribute__((section("sfrs"), address(0xBF884630)));
extern volatile uint32_t        CFD3FIFOSTA26CLR __attribute__((section("sfrs"),address(0xBF884634)));
extern volatile uint32_t        CFD3FIFOSTA26SET __attribute__((section("sfrs"),address(0xBF884638)));
extern volatile uint32_t        CFD3FIFOSTA26INV __attribute__((section("sfrs"),address(0xBF88463C)));
#define CFD3FIFOUA26 CFD3FIFOUA26
extern volatile uint32_t   CFD3FIFOUA26 __attribute__((section("sfrs"), address(0xBF884640)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA26bits_t;
extern volatile __CFD3FIFOUA26bits_t CFD3FIFOUA26bits __asm__ ("CFD3FIFOUA26") __attribute__((section("sfrs"), address(0xBF884640)));
extern volatile uint32_t        CFD3FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF884644)));
extern volatile uint32_t        CFD3FIFOUA26SET __attribute__((section("sfrs"),address(0xBF884648)));
extern volatile uint32_t        CFD3FIFOUA26INV __attribute__((section("sfrs"),address(0xBF88464C)));
#define CFD3FIFOCON27 CFD3FIFOCON27
extern volatile uint32_t   CFD3FIFOCON27 __attribute__((section("sfrs"), address(0xBF884650)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON27bits_t;
extern volatile __CFD3FIFOCON27bits_t CFD3FIFOCON27bits __asm__ ("CFD3FIFOCON27") __attribute__((section("sfrs"), address(0xBF884650)));
extern volatile uint32_t        CFD3FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF884654)));
extern volatile uint32_t        CFD3FIFOCON27SET __attribute__((section("sfrs"),address(0xBF884658)));
extern volatile uint32_t        CFD3FIFOCON27INV __attribute__((section("sfrs"),address(0xBF88465C)));
#define CFD3FIFOSTA27 CFD3FIFOSTA27
extern volatile uint32_t   CFD3FIFOSTA27 __attribute__((section("sfrs"), address(0xBF884660)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA27bits_t;
extern volatile __CFD3FIFOSTA27bits_t CFD3FIFOSTA27bits __asm__ ("CFD3FIFOSTA27") __attribute__((section("sfrs"), address(0xBF884660)));
extern volatile uint32_t        CFD3FIFOSTA27CLR __attribute__((section("sfrs"),address(0xBF884664)));
extern volatile uint32_t        CFD3FIFOSTA27SET __attribute__((section("sfrs"),address(0xBF884668)));
extern volatile uint32_t        CFD3FIFOSTA27INV __attribute__((section("sfrs"),address(0xBF88466C)));
#define CFD3FIFOUA27 CFD3FIFOUA27
extern volatile uint32_t   CFD3FIFOUA27 __attribute__((section("sfrs"), address(0xBF884670)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA27bits_t;
extern volatile __CFD3FIFOUA27bits_t CFD3FIFOUA27bits __asm__ ("CFD3FIFOUA27") __attribute__((section("sfrs"), address(0xBF884670)));
extern volatile uint32_t        CFD3FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF884674)));
extern volatile uint32_t        CFD3FIFOUA27SET __attribute__((section("sfrs"),address(0xBF884678)));
extern volatile uint32_t        CFD3FIFOUA27INV __attribute__((section("sfrs"),address(0xBF88467C)));
#define CFD3FIFOCON28 CFD3FIFOCON28
extern volatile uint32_t   CFD3FIFOCON28 __attribute__((section("sfrs"), address(0xBF884680)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON28bits_t;
