Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD3FLTCON6bits_t CFD3FLTCON6bits __asm__ ("CFD3FLTCON6") __attribute__((section("sfrs"), address(0xBF8847A0)));
extern volatile uint32_t        CFD3FLTCON6CLR __attribute__((section("sfrs"),address(0xBF8847A4)));
extern volatile uint32_t        CFD3FLTCON6SET __attribute__((section("sfrs"),address(0xBF8847A8)));
extern volatile uint32_t        CFD3FLTCON6INV __attribute__((section("sfrs"),address(0xBF8847AC)));
#define CFD3FLTCON7 CFD3FLTCON7
extern volatile uint32_t   CFD3FLTCON7 __attribute__((section("sfrs"), address(0xBF8847B0)));
typedef struct {
  uint32_t F28BP:5;
  uint32_t :2;
  uint32_t FLTEN28:1;
  uint32_t F29BP:5;
  uint32_t :2;
  uint32_t FLTEN29:1;
  uint32_t F30BP:5;
  uint32_t :2;
  uint32_t FLTEN30:1;
  uint32_t F31BP:5;
  uint32_t :2;
  uint32_t FLTEN31:1;
} __CFD3FLTCON7bits_t;
extern volatile __CFD3FLTCON7bits_t CFD3FLTCON7bits __asm__ ("CFD3FLTCON7") __attribute__((section("sfrs"), address(0xBF8847B0)));
extern volatile uint32_t        CFD3FLTCON7CLR __attribute__((section("sfrs"),address(0xBF8847B4)));
extern volatile uint32_t        CFD3FLTCON7SET __attribute__((section("sfrs"),address(0xBF8847B8)));
extern volatile uint32_t        CFD3FLTCON7INV __attribute__((section("sfrs"),address(0xBF8847BC)));
#define CFD3FLTOBJ0 CFD3FLTOBJ0
extern volatile uint32_t   CFD3FLTOBJ0 __attribute__((section("sfrs"), address(0xBF8847C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ0bits_t;
extern volatile __CFD3FLTOBJ0bits_t CFD3FLTOBJ0bits __asm__ ("CFD3FLTOBJ0") __attribute__((section("sfrs"), address(0xBF8847C0)));
extern volatile uint32_t        CFD3FLTOBJ0CLR __attribute__((section("sfrs"),address(0xBF8847C4)));
extern volatile uint32_t        CFD3FLTOBJ0SET __attribute__((section("sfrs"),address(0xBF8847C8)));
extern volatile uint32_t        CFD3FLTOBJ0INV __attribute__((section("sfrs"),address(0xBF8847CC)));
#define CFD3MASK0 CFD3MASK0
extern volatile uint32_t   CFD3MASK0 __attribute__((section("sfrs"), address(0xBF8847D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK0bits_t;
extern volatile __CFD3MASK0bits_t CFD3MASK0bits __asm__ ("CFD3MASK0") __attribute__((section("sfrs"), address(0xBF8847D0)));
extern volatile uint32_t        CFD3MASK0CLR __attribute__((section("sfrs"),address(0xBF8847D4)));
extern volatile uint32_t        CFD3MASK0SET __attribute__((section("sfrs"),address(0xBF8847D8)));
extern volatile uint32_t        CFD3MASK0INV __attribute__((section("sfrs"),address(0xBF8847DC)));
#define CFD3FLTOBJ1 CFD3FLTOBJ1
extern volatile uint32_t   CFD3FLTOBJ1 __attribute__((section("sfrs"), address(0xBF8847E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ1bits_t;
extern volatile __CFD3FLTOBJ1bits_t CFD3FLTOBJ1bits __asm__ ("CFD3FLTOBJ1") __attribute__((section("sfrs"), address(0xBF8847E0)));
extern volatile uint32_t        CFD3FLTOBJ1CLR __attribute__((section("sfrs"),address(0xBF8847E4)));
extern volatile uint32_t        CFD3FLTOBJ1SET __attribute__((section("sfrs"),address(0xBF8847E8)));
extern volatile uint32_t        CFD3FLTOBJ1INV __attribute__((section("sfrs"),address(0xBF8847EC)));
#define CFD3MASK1 CFD3MASK1
extern volatile uint32_t   CFD3MASK1 __attribute__((section("sfrs"), address(0xBF8847F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK1bits_t;
extern volatile __CFD3MASK1bits_t CFD3MASK1bits __asm__ ("CFD3MASK1") __attribute__((section("sfrs"), address(0xBF8847F0)));
extern volatile uint32_t        CFD3MASK1CLR __attribute__((section("sfrs"),address(0xBF8847F4)));
extern volatile uint32_t        CFD3MASK1SET __attribute__((section("sfrs"),address(0xBF8847F8)));
extern volatile uint32_t        CFD3MASK1INV __attribute__((section("sfrs"),address(0xBF8847FC)));
#define CFD3FLTOBJ2 CFD3FLTOBJ2
extern volatile uint32_t   CFD3FLTOBJ2 __attribute__((section("sfrs"), address(0xBF884800)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ2bits_t;
extern volatile __CFD3FLTOBJ2bits_t CFD3FLTOBJ2bits __asm__ ("CFD3FLTOBJ2") __attribute__((section("sfrs"), address(0xBF884800)));
extern volatile uint32_t        CFD3FLTOBJ2CLR __attribute__((section("sfrs"),address(0xBF884804)));
extern volatile uint32_t        CFD3FLTOBJ2SET __attribute__((section("sfrs"),address(0xBF884808)));
extern volatile uint32_t        CFD3FLTOBJ2INV __attribute__((section("sfrs"),address(0xBF88480C)));
#define CFD3MASK2 CFD3MASK2
extern volatile uint32_t   CFD3MASK2 __attribute__((section("sfrs"), address(0xBF884810)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK2bits_t;
extern volatile __CFD3MASK2bits_t CFD3MASK2bits __asm__ ("CFD3MASK2") __attribute__((section("sfrs"), address(0xBF884810)));
extern volatile uint32_t        CFD3MASK2CLR __attribute__((section("sfrs"),address(0xBF884814)));
extern volatile uint32_t        CFD3MASK2SET __attribute__((section("sfrs"),address(0xBF884818)));
extern volatile uint32_t        CFD3MASK2INV __attribute__((section("sfrs"),address(0xBF88481C)));
#define CFD3FLTOBJ3 CFD3FLTOBJ3
extern volatile uint32_t   CFD3FLTOBJ3 __attribute__((section("sfrs"), address(0xBF884820)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ3bits_t;
extern volatile __CFD3FLTOBJ3bits_t CFD3FLTOBJ3bits __asm__ ("CFD3FLTOBJ3") __attribute__((section("sfrs"), address(0xBF884820)));
extern volatile uint32_t        CFD3FLTOBJ3CLR __attribute__((section("sfrs"),address(0xBF884824)));
extern volatile uint32_t        CFD3FLTOBJ3SET __attribute__((section("sfrs"),address(0xBF884828)));
extern volatile uint32_t        CFD3FLTOBJ3INV __attribute__((section("sfrs"),address(0xBF88482C)));
#define CFD3MASK3 CFD3MASK3
extern volatile uint32_t   CFD3MASK3 __attribute__((section("sfrs"), address(0xBF884830)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK3bits_t;
