Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD4FIFOUA5bits_t CFD4FIFOUA5bits __asm__ ("CFD4FIFOUA5") __attribute__((section("sfrs"), address(0xBF885250)));
extern volatile uint32_t        CFD4FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF885254)));
extern volatile uint32_t        CFD4FIFOUA5SET __attribute__((section("sfrs"),address(0xBF885258)));
extern volatile uint32_t        CFD4FIFOUA5INV __attribute__((section("sfrs"),address(0xBF88525C)));
#define CFD4FIFOCON6 CFD4FIFOCON6
extern volatile uint32_t   CFD4FIFOCON6 __attribute__((section("sfrs"), address(0xBF885260)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON6bits_t;
extern volatile __CFD4FIFOCON6bits_t CFD4FIFOCON6bits __asm__ ("CFD4FIFOCON6") __attribute__((section("sfrs"), address(0xBF885260)));
extern volatile uint32_t        CFD4FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF885264)));
extern volatile uint32_t        CFD4FIFOCON6SET __attribute__((section("sfrs"),address(0xBF885268)));
extern volatile uint32_t        CFD4FIFOCON6INV __attribute__((section("sfrs"),address(0xBF88526C)));
#define CFD4FIFOSTA6 CFD4FIFOSTA6
extern volatile uint32_t   CFD4FIFOSTA6 __attribute__((section("sfrs"), address(0xBF885270)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA6bits_t;
extern volatile __CFD4FIFOSTA6bits_t CFD4FIFOSTA6bits __asm__ ("CFD4FIFOSTA6") __attribute__((section("sfrs"), address(0xBF885270)));
extern volatile uint32_t        CFD4FIFOSTA6CLR __attribute__((section("sfrs"),address(0xBF885274)));
extern volatile uint32_t        CFD4FIFOSTA6SET __attribute__((section("sfrs"),address(0xBF885278)));
extern volatile uint32_t        CFD4FIFOSTA6INV __attribute__((section("sfrs"),address(0xBF88527C)));
#define CFD4FIFOUA6 CFD4FIFOUA6
extern volatile uint32_t   CFD4FIFOUA6 __attribute__((section("sfrs"), address(0xBF885280)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA6bits_t;
extern volatile __CFD4FIFOUA6bits_t CFD4FIFOUA6bits __asm__ ("CFD4FIFOUA6") __attribute__((section("sfrs"), address(0xBF885280)));
extern volatile uint32_t        CFD4FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF885284)));
extern volatile uint32_t        CFD4FIFOUA6SET __attribute__((section("sfrs"),address(0xBF885288)));
extern volatile uint32_t        CFD4FIFOUA6INV __attribute__((section("sfrs"),address(0xBF88528C)));
#define CFD4FIFOCON7 CFD4FIFOCON7
extern volatile uint32_t   CFD4FIFOCON7 __attribute__((section("sfrs"), address(0xBF885290)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON7bits_t;
extern volatile __CFD4FIFOCON7bits_t CFD4FIFOCON7bits __asm__ ("CFD4FIFOCON7") __attribute__((section("sfrs"), address(0xBF885290)));
extern volatile uint32_t        CFD4FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF885294)));
extern volatile uint32_t        CFD4FIFOCON7SET __attribute__((section("sfrs"),address(0xBF885298)));
extern volatile uint32_t        CFD4FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88529C)));
#define CFD4FIFOSTA7 CFD4FIFOSTA7
extern volatile uint32_t   CFD4FIFOSTA7 __attribute__((section("sfrs"), address(0xBF8852A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA7bits_t;
extern volatile __CFD4FIFOSTA7bits_t CFD4FIFOSTA7bits __asm__ ("CFD4FIFOSTA7") __attribute__((section("sfrs"), address(0xBF8852A0)));
extern volatile uint32_t        CFD4FIFOSTA7CLR __attribute__((section("sfrs"),address(0xBF8852A4)));
extern volatile uint32_t        CFD4FIFOSTA7SET __attribute__((section("sfrs"),address(0xBF8852A8)));
extern volatile uint32_t        CFD4FIFOSTA7INV __attribute__((section("sfrs"),address(0xBF8852AC)));
#define CFD4FIFOUA7 CFD4FIFOUA7
extern volatile uint32_t   CFD4FIFOUA7 __attribute__((section("sfrs"), address(0xBF8852B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA7bits_t;
extern volatile __CFD4FIFOUA7bits_t CFD4FIFOUA7bits __asm__ ("CFD4FIFOUA7") __attribute__((section("sfrs"), address(0xBF8852B0)));
extern volatile uint32_t        CFD4FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF8852B4)));
extern volatile uint32_t        CFD4FIFOUA7SET __attribute__((section("sfrs"),address(0xBF8852B8)));
extern volatile uint32_t        CFD4FIFOUA7INV __attribute__((section("sfrs"),address(0xBF8852BC)));
#define CFD4FIFOCON8 CFD4FIFOCON8
extern volatile uint32_t   CFD4FIFOCON8 __attribute__((section("sfrs"), address(0xBF8852C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON8bits_t;
extern volatile __CFD4FIFOCON8bits_t CFD4FIFOCON8bits __asm__ ("CFD4FIFOCON8") __attribute__((section("sfrs"), address(0xBF8852C0)));
extern volatile uint32_t        CFD4FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF8852C4)));
extern volatile uint32_t        CFD4FIFOCON8SET __attribute__((section("sfrs"),address(0xBF8852C8)));
extern volatile uint32_t        CFD4FIFOCON8INV __attribute__((section("sfrs"),address(0xBF8852CC)));
#define CFD4FIFOSTA8 CFD4FIFOSTA8
extern volatile uint32_t   CFD4FIFOSTA8 __attribute__((section("sfrs"), address(0xBF8852D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA8bits_t;
extern volatile __CFD4FIFOSTA8bits_t CFD4FIFOSTA8bits __asm__ ("CFD4FIFOSTA8") __attribute__((section("sfrs"), address(0xBF8852D0)));
extern volatile uint32_t        CFD4FIFOSTA8CLR __attribute__((section("sfrs"),address(0xBF8852D4)));
extern volatile uint32_t        CFD4FIFOSTA8SET __attribute__((section("sfrs"),address(0xBF8852D8)));
extern volatile uint32_t        CFD4FIFOSTA8INV __attribute__((section("sfrs"),address(0xBF8852DC)));
#define CFD4FIFOUA8 CFD4FIFOUA8
extern volatile uint32_t   CFD4FIFOUA8 __attribute__((section("sfrs"), address(0xBF8852E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA8bits_t;
