Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD4FIFOUA8bits_t CFD4FIFOUA8bits __asm__ ("CFD4FIFOUA8") __attribute__((section("sfrs"), address(0xBF8852E0)));
extern volatile uint32_t        CFD4FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF8852E4)));
extern volatile uint32_t        CFD4FIFOUA8SET __attribute__((section("sfrs"),address(0xBF8852E8)));
extern volatile uint32_t        CFD4FIFOUA8INV __attribute__((section("sfrs"),address(0xBF8852EC)));
#define CFD4FIFOCON9 CFD4FIFOCON9
extern volatile uint32_t   CFD4FIFOCON9 __attribute__((section("sfrs"), address(0xBF8852F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON9bits_t;
extern volatile __CFD4FIFOCON9bits_t CFD4FIFOCON9bits __asm__ ("CFD4FIFOCON9") __attribute__((section("sfrs"), address(0xBF8852F0)));
extern volatile uint32_t        CFD4FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF8852F4)));
extern volatile uint32_t        CFD4FIFOCON9SET __attribute__((section("sfrs"),address(0xBF8852F8)));
extern volatile uint32_t        CFD4FIFOCON9INV __attribute__((section("sfrs"),address(0xBF8852FC)));
#define CFD4FIFOSTA9 CFD4FIFOSTA9
extern volatile uint32_t   CFD4FIFOSTA9 __attribute__((section("sfrs"), address(0xBF885300)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA9bits_t;
extern volatile __CFD4FIFOSTA9bits_t CFD4FIFOSTA9bits __asm__ ("CFD4FIFOSTA9") __attribute__((section("sfrs"), address(0xBF885300)));
extern volatile uint32_t        CFD4FIFOSTA9CLR __attribute__((section("sfrs"),address(0xBF885304)));
extern volatile uint32_t        CFD4FIFOSTA9SET __attribute__((section("sfrs"),address(0xBF885308)));
extern volatile uint32_t        CFD4FIFOSTA9INV __attribute__((section("sfrs"),address(0xBF88530C)));
#define CFD4FIFOUA9 CFD4FIFOUA9
extern volatile uint32_t   CFD4FIFOUA9 __attribute__((section("sfrs"), address(0xBF885310)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA9bits_t;
extern volatile __CFD4FIFOUA9bits_t CFD4FIFOUA9bits __asm__ ("CFD4FIFOUA9") __attribute__((section("sfrs"), address(0xBF885310)));
extern volatile uint32_t        CFD4FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF885314)));
extern volatile uint32_t        CFD4FIFOUA9SET __attribute__((section("sfrs"),address(0xBF885318)));
extern volatile uint32_t        CFD4FIFOUA9INV __attribute__((section("sfrs"),address(0xBF88531C)));
#define CFD4FIFOCON10 CFD4FIFOCON10
extern volatile uint32_t   CFD4FIFOCON10 __attribute__((section("sfrs"), address(0xBF885320)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON10bits_t;
extern volatile __CFD4FIFOCON10bits_t CFD4FIFOCON10bits __asm__ ("CFD4FIFOCON10") __attribute__((section("sfrs"), address(0xBF885320)));
extern volatile uint32_t        CFD4FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF885324)));
extern volatile uint32_t        CFD4FIFOCON10SET __attribute__((section("sfrs"),address(0xBF885328)));
extern volatile uint32_t        CFD4FIFOCON10INV __attribute__((section("sfrs"),address(0xBF88532C)));
#define CFD4FIFOSTA10 CFD4FIFOSTA10
extern volatile uint32_t   CFD4FIFOSTA10 __attribute__((section("sfrs"), address(0xBF885330)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA10bits_t;
extern volatile __CFD4FIFOSTA10bits_t CFD4FIFOSTA10bits __asm__ ("CFD4FIFOSTA10") __attribute__((section("sfrs"), address(0xBF885330)));
extern volatile uint32_t        CFD4FIFOSTA10CLR __attribute__((section("sfrs"),address(0xBF885334)));
extern volatile uint32_t        CFD4FIFOSTA10SET __attribute__((section("sfrs"),address(0xBF885338)));
extern volatile uint32_t        CFD4FIFOSTA10INV __attribute__((section("sfrs"),address(0xBF88533C)));
#define CFD4FIFOUA10 CFD4FIFOUA10
extern volatile uint32_t   CFD4FIFOUA10 __attribute__((section("sfrs"), address(0xBF885340)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA10bits_t;
extern volatile __CFD4FIFOUA10bits_t CFD4FIFOUA10bits __asm__ ("CFD4FIFOUA10") __attribute__((section("sfrs"), address(0xBF885340)));
extern volatile uint32_t        CFD4FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF885344)));
extern volatile uint32_t        CFD4FIFOUA10SET __attribute__((section("sfrs"),address(0xBF885348)));
extern volatile uint32_t        CFD4FIFOUA10INV __attribute__((section("sfrs"),address(0xBF88534C)));
#define CFD4FIFOCON11 CFD4FIFOCON11
extern volatile uint32_t   CFD4FIFOCON11 __attribute__((section("sfrs"), address(0xBF885350)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON11bits_t;
extern volatile __CFD4FIFOCON11bits_t CFD4FIFOCON11bits __asm__ ("CFD4FIFOCON11") __attribute__((section("sfrs"), address(0xBF885350)));
extern volatile uint32_t        CFD4FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF885354)));
extern volatile uint32_t        CFD4FIFOCON11SET __attribute__((section("sfrs"),address(0xBF885358)));
extern volatile uint32_t        CFD4FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88535C)));
#define CFD4FIFOSTA11 CFD4FIFOSTA11
extern volatile uint32_t   CFD4FIFOSTA11 __attribute__((section("sfrs"), address(0xBF885360)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA11bits_t;
