Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD4FIFOSTA11bits_t CFD4FIFOSTA11bits __asm__ ("CFD4FIFOSTA11") __attribute__((section("sfrs"), address(0xBF885360)));
extern volatile uint32_t        CFD4FIFOSTA11CLR __attribute__((section("sfrs"),address(0xBF885364)));
extern volatile uint32_t        CFD4FIFOSTA11SET __attribute__((section("sfrs"),address(0xBF885368)));
extern volatile uint32_t        CFD4FIFOSTA11INV __attribute__((section("sfrs"),address(0xBF88536C)));
#define CFD4FIFOUA11 CFD4FIFOUA11
extern volatile uint32_t   CFD4FIFOUA11 __attribute__((section("sfrs"), address(0xBF885370)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA11bits_t;
extern volatile __CFD4FIFOUA11bits_t CFD4FIFOUA11bits __asm__ ("CFD4FIFOUA11") __attribute__((section("sfrs"), address(0xBF885370)));
extern volatile uint32_t        CFD4FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF885374)));
extern volatile uint32_t        CFD4FIFOUA11SET __attribute__((section("sfrs"),address(0xBF885378)));
extern volatile uint32_t        CFD4FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88537C)));
#define CFD4FIFOCON12 CFD4FIFOCON12
extern volatile uint32_t   CFD4FIFOCON12 __attribute__((section("sfrs"), address(0xBF885380)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON12bits_t;
extern volatile __CFD4FIFOCON12bits_t CFD4FIFOCON12bits __asm__ ("CFD4FIFOCON12") __attribute__((section("sfrs"), address(0xBF885380)));
extern volatile uint32_t        CFD4FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF885384)));
extern volatile uint32_t        CFD4FIFOCON12SET __attribute__((section("sfrs"),address(0xBF885388)));
extern volatile uint32_t        CFD4FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88538C)));
#define CFD4FIFOSTA12 CFD4FIFOSTA12
extern volatile uint32_t   CFD4FIFOSTA12 __attribute__((section("sfrs"), address(0xBF885390)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA12bits_t;
extern volatile __CFD4FIFOSTA12bits_t CFD4FIFOSTA12bits __asm__ ("CFD4FIFOSTA12") __attribute__((section("sfrs"), address(0xBF885390)));
extern volatile uint32_t        CFD4FIFOSTA12CLR __attribute__((section("sfrs"),address(0xBF885394)));
extern volatile uint32_t        CFD4FIFOSTA12SET __attribute__((section("sfrs"),address(0xBF885398)));
extern volatile uint32_t        CFD4FIFOSTA12INV __attribute__((section("sfrs"),address(0xBF88539C)));
#define CFD4FIFOUA12 CFD4FIFOUA12
extern volatile uint32_t   CFD4FIFOUA12 __attribute__((section("sfrs"), address(0xBF8853A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA12bits_t;
extern volatile __CFD4FIFOUA12bits_t CFD4FIFOUA12bits __asm__ ("CFD4FIFOUA12") __attribute__((section("sfrs"), address(0xBF8853A0)));
extern volatile uint32_t        CFD4FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF8853A4)));
extern volatile uint32_t        CFD4FIFOUA12SET __attribute__((section("sfrs"),address(0xBF8853A8)));
extern volatile uint32_t        CFD4FIFOUA12INV __attribute__((section("sfrs"),address(0xBF8853AC)));
#define CFD4FIFOCON13 CFD4FIFOCON13
extern volatile uint32_t   CFD4FIFOCON13 __attribute__((section("sfrs"), address(0xBF8853B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON13bits_t;
extern volatile __CFD4FIFOCON13bits_t CFD4FIFOCON13bits __asm__ ("CFD4FIFOCON13") __attribute__((section("sfrs"), address(0xBF8853B0)));
extern volatile uint32_t        CFD4FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF8853B4)));
extern volatile uint32_t        CFD4FIFOCON13SET __attribute__((section("sfrs"),address(0xBF8853B8)));
extern volatile uint32_t        CFD4FIFOCON13INV __attribute__((section("sfrs"),address(0xBF8853BC)));
#define CFD4FIFOSTA13 CFD4FIFOSTA13
extern volatile uint32_t   CFD4FIFOSTA13 __attribute__((section("sfrs"), address(0xBF8853C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA13bits_t;
extern volatile __CFD4FIFOSTA13bits_t CFD4FIFOSTA13bits __asm__ ("CFD4FIFOSTA13") __attribute__((section("sfrs"), address(0xBF8853C0)));
extern volatile uint32_t        CFD4FIFOSTA13CLR __attribute__((section("sfrs"),address(0xBF8853C4)));
extern volatile uint32_t        CFD4FIFOSTA13SET __attribute__((section("sfrs"),address(0xBF8853C8)));
extern volatile uint32_t        CFD4FIFOSTA13INV __attribute__((section("sfrs"),address(0xBF8853CC)));
#define CFD4FIFOUA13 CFD4FIFOUA13
extern volatile uint32_t   CFD4FIFOUA13 __attribute__((section("sfrs"), address(0xBF8853D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA13bits_t;
extern volatile __CFD4FIFOUA13bits_t CFD4FIFOUA13bits __asm__ ("CFD4FIFOUA13") __attribute__((section("sfrs"), address(0xBF8853D0)));
extern volatile uint32_t        CFD4FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8853D4)));
extern volatile uint32_t        CFD4FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8853D8)));
extern volatile uint32_t        CFD4FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8853DC)));
#define CFD4FIFOCON14 CFD4FIFOCON14
extern volatile uint32_t   CFD4FIFOCON14 __attribute__((section("sfrs"), address(0xBF8853E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON14bits_t;
extern volatile __CFD4FIFOCON14bits_t CFD4FIFOCON14bits __asm__ ("CFD4FIFOCON14") __attribute__((section("sfrs"), address(0xBF8853E0)));
extern volatile uint32_t        CFD4FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8853E4)));
extern volatile uint32_t        CFD4FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8853E8)));
extern volatile uint32_t        CFD4FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8853EC)));
#define CFD4FIFOSTA14 CFD4FIFOSTA14
extern volatile uint32_t   CFD4FIFOSTA14 __attribute__((section("sfrs"), address(0xBF8853F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA14bits_t;
