Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
extern volatile __CFD4FIFOCON17bits_t CFD4FIFOCON17bits __asm__ ("CFD4FIFOCON17") __attribute__((section("sfrs"), address(0xBF885470)));
extern volatile uint32_t        CFD4FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF885474)));
extern volatile uint32_t        CFD4FIFOCON17SET __attribute__((section("sfrs"),address(0xBF885478)));
extern volatile uint32_t        CFD4FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88547C)));
#define CFD4FIFOSTA17 CFD4FIFOSTA17
extern volatile uint32_t   CFD4FIFOSTA17 __attribute__((section("sfrs"), address(0xBF885480)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA17bits_t;
extern volatile __CFD4FIFOSTA17bits_t CFD4FIFOSTA17bits __asm__ ("CFD4FIFOSTA17") __attribute__((section("sfrs"), address(0xBF885480)));
extern volatile uint32_t        CFD4FIFOSTA17CLR __attribute__((section("sfrs"),address(0xBF885484)));
extern volatile uint32_t        CFD4FIFOSTA17SET __attribute__((section("sfrs"),address(0xBF885488)));
extern volatile uint32_t        CFD4FIFOSTA17INV __attribute__((section("sfrs"),address(0xBF88548C)));
#define CFD4FIFOUA17 CFD4FIFOUA17
extern volatile uint32_t   CFD4FIFOUA17 __attribute__((section("sfrs"), address(0xBF885490)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA17bits_t;
extern volatile __CFD4FIFOUA17bits_t CFD4FIFOUA17bits __asm__ ("CFD4FIFOUA17") __attribute__((section("sfrs"), address(0xBF885490)));
extern volatile uint32_t        CFD4FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF885494)));
extern volatile uint32_t        CFD4FIFOUA17SET __attribute__((section("sfrs"),address(0xBF885498)));
extern volatile uint32_t        CFD4FIFOUA17INV __attribute__((section("sfrs"),address(0xBF88549C)));
#define CFD4FIFOCON18 CFD4FIFOCON18
extern volatile uint32_t   CFD4FIFOCON18 __attribute__((section("sfrs"), address(0xBF8854A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON18bits_t;
extern volatile __CFD4FIFOCON18bits_t CFD4FIFOCON18bits __asm__ ("CFD4FIFOCON18") __attribute__((section("sfrs"), address(0xBF8854A0)));
extern volatile uint32_t        CFD4FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF8854A4)));
extern volatile uint32_t        CFD4FIFOCON18SET __attribute__((section("sfrs"),address(0xBF8854A8)));
extern volatile uint32_t        CFD4FIFOCON18INV __attribute__((section("sfrs"),address(0xBF8854AC)));
#define CFD4FIFOSTA18 CFD4FIFOSTA18
extern volatile uint32_t   CFD4FIFOSTA18 __attribute__((section("sfrs"), address(0xBF8854B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA18bits_t;
extern volatile __CFD4FIFOSTA18bits_t CFD4FIFOSTA18bits __asm__ ("CFD4FIFOSTA18") __attribute__((section("sfrs"), address(0xBF8854B0)));
extern volatile uint32_t        CFD4FIFOSTA18CLR __attribute__((section("sfrs"),address(0xBF8854B4)));
extern volatile uint32_t        CFD4FIFOSTA18SET __attribute__((section("sfrs"),address(0xBF8854B8)));
extern volatile uint32_t        CFD4FIFOSTA18INV __attribute__((section("sfrs"),address(0xBF8854BC)));
#define CFD4FIFOUA18 CFD4FIFOUA18
extern volatile uint32_t   CFD4FIFOUA18 __attribute__((section("sfrs"), address(0xBF8854C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA18bits_t;
extern volatile __CFD4FIFOUA18bits_t CFD4FIFOUA18bits __asm__ ("CFD4FIFOUA18") __attribute__((section("sfrs"), address(0xBF8854C0)));
extern volatile uint32_t        CFD4FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF8854C4)));
extern volatile uint32_t        CFD4FIFOUA18SET __attribute__((section("sfrs"),address(0xBF8854C8)));
extern volatile uint32_t        CFD4FIFOUA18INV __attribute__((section("sfrs"),address(0xBF8854CC)));
#define CFD4FIFOCON19 CFD4FIFOCON19
extern volatile uint32_t   CFD4FIFOCON19 __attribute__((section("sfrs"), address(0xBF8854D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON19bits_t;
extern volatile __CFD4FIFOCON19bits_t CFD4FIFOCON19bits __asm__ ("CFD4FIFOCON19") __attribute__((section("sfrs"), address(0xBF8854D0)));
extern volatile uint32_t        CFD4FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF8854D4)));
extern volatile uint32_t        CFD4FIFOCON19SET __attribute__((section("sfrs"),address(0xBF8854D8)));
extern volatile uint32_t        CFD4FIFOCON19INV __attribute__((section("sfrs"),address(0xBF8854DC)));
#define CFD4FIFOSTA19 CFD4FIFOSTA19
extern volatile uint32_t   CFD4FIFOSTA19 __attribute__((section("sfrs"), address(0xBF8854E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA19bits_t;
extern volatile __CFD4FIFOSTA19bits_t CFD4FIFOSTA19bits __asm__ ("CFD4FIFOSTA19") __attribute__((section("sfrs"), address(0xBF8854E0)));
extern volatile uint32_t        CFD4FIFOSTA19CLR __attribute__((section("sfrs"),address(0xBF8854E4)));
extern volatile uint32_t        CFD4FIFOSTA19SET __attribute__((section("sfrs"),address(0xBF8854E8)));
extern volatile uint32_t        CFD4FIFOSTA19INV __attribute__((section("sfrs"),address(0xBF8854EC)));
#define CFD4FIFOUA19 CFD4FIFOUA19
extern volatile uint32_t   CFD4FIFOUA19 __attribute__((section("sfrs"), address(0xBF8854F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA19bits_t;
