Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
  .extern QEI4STATSET      /* 0xBF82B828 */
  .extern QEI4STATINV      /* 0xBF82B82C */
  .extern POS4CNT          /* 0xBF82B830 */
  .extern POS4CNTCLR       /* 0xBF82B834 */
  .extern POS4CNTSET       /* 0xBF82B838 */
  .extern POS4CNTINV       /* 0xBF82B83C */
  .extern POS4HLD          /* 0xBF82B840 */
  .extern POS4HLDCLR       /* 0xBF82B844 */
  .extern POS4HLDSET       /* 0xBF82B848 */
  .extern POS4HLDINV       /* 0xBF82B84C */
  .extern VEL4CNT          /* 0xBF82B850 */
  .extern VEL4CNTCLR       /* 0xBF82B854 */
  .extern VEL4CNTSET       /* 0xBF82B858 */
  .extern VEL4CNTINV       /* 0xBF82B85C */
  .extern VEL4HLD          /* 0xBF82B860 */
  .extern VEL4HLDCLR       /* 0xBF82B864 */
  .extern VEL4HLDSET       /* 0xBF82B868 */
  .extern VEL4HLDINV       /* 0xBF82B86C */
  .extern INT4TMR          /* 0xBF82B870 */
  .extern INT4TMRCLR       /* 0xBF82B874 */
  .extern INT4TMRSET       /* 0xBF82B878 */
  .extern INT4TMRINV       /* 0xBF82B87C */
  .extern INT4HLD          /* 0xBF82B880 */
  .extern INT4HLDCLR       /* 0xBF82B884 */
  .extern INT4HLDSET       /* 0xBF82B888 */
  .extern INT4HLDINV       /* 0xBF82B88C */
  .extern INDX4CNT         /* 0xBF82B890 */
  .extern INDX4CNTCLR      /* 0xBF82B894 */
  .extern INDX4CNTSET      /* 0xBF82B898 */
  .extern INDX4CNTINV      /* 0xBF82B89C */
  .extern INDX4HLD         /* 0xBF82B8A0 */
  .extern INDX4HLDCLR      /* 0xBF82B8A4 */
  .extern INDX4HLDSET      /* 0xBF82B8A8 */
  .extern INDX4HLDINV      /* 0xBF82B8AC */
  .extern QEI4ICC          /* 0xBF82B8B0 */
  .extern QEI4ICCCLR       /* 0xBF82B8B4 */
  .extern QEI4ICCSET       /* 0xBF82B8B8 */
  .extern QEI4ICCINV       /* 0xBF82B8BC */
  .extern QEI4CMPL         /* 0xBF82B8C0 */
  .extern QEI4CMPLCLR      /* 0xBF82B8C4 */
  .extern QEI4CMPLSET      /* 0xBF82B8C8 */
  .extern QEI4CMPLINV      /* 0xBF82B8CC */
  .extern QEI5CON          /* 0xBF82BA00 */
  .extern QEI5CONCLR       /* 0xBF82BA04 */
  .extern QEI5CONSET       /* 0xBF82BA08 */
  .extern QEI5CONINV       /* 0xBF82BA0C */
  .extern QEI5IOC          /* 0xBF82BA10 */
  .extern QEI5IOCCLR       /* 0xBF82BA14 */
  .extern QEI5IOCSET       /* 0xBF82BA18 */
  .extern QEI5IOCINV       /* 0xBF82BA1C */
  .extern QEI5STAT         /* 0xBF82BA20 */
  .extern QEI5STATCLR      /* 0xBF82BA24 */
  .extern QEI5STATSET      /* 0xBF82BA28 */
  .extern QEI5STATINV      /* 0xBF82BA2C */
  .extern POS5CNT          /* 0xBF82BA30 */
  .extern POS5CNTCLR       /* 0xBF82BA34 */
  .extern POS5CNTSET       /* 0xBF82BA38 */
  .extern POS5CNTINV       /* 0xBF82BA3C */
  .extern POS5HLD          /* 0xBF82BA40 */
  .extern POS5HLDCLR       /* 0xBF82BA44 */
  .extern POS5HLDSET       /* 0xBF82BA48 */
  .extern POS5HLDINV       /* 0xBF82BA4C */
  .extern VEL5CNT          /* 0xBF82BA50 */
  .extern VEL5CNTCLR       /* 0xBF82BA54 */
  .extern VEL5CNTSET       /* 0xBF82BA58 */
  .extern VEL5CNTINV       /* 0xBF82BA5C */
  .extern VEL5HLD          /* 0xBF82BA60 */
  .extern VEL5HLDCLR       /* 0xBF82BA64 */
  .extern VEL5HLDSET       /* 0xBF82BA68 */
  .extern VEL5HLDINV       /* 0xBF82BA6C */
  .extern INT5TMR          /* 0xBF82BA70 */
  .extern INT5TMRCLR       /* 0xBF82BA74 */
  .extern INT5TMRSET       /* 0xBF82BA78 */
  .extern INT5TMRINV       /* 0xBF82BA7C */
  .extern INT5HLD          /* 0xBF82BA80 */
  .extern INT5HLDCLR       /* 0xBF82BA84 */
  .extern INT5HLDSET       /* 0xBF82BA88 */
  .extern INT5HLDINV       /* 0xBF82BA8C */
  .extern INDX5CNT         /* 0xBF82BA90 */
  .extern INDX5CNTCLR      /* 0xBF82BA94 */
  .extern INDX5CNTSET      /* 0xBF82BA98 */
  .extern INDX5CNTINV      /* 0xBF82BA9C */
  .extern INDX5HLD         /* 0xBF82BAA0 */
  .extern INDX5HLDCLR      /* 0xBF82BAA4 */
  .extern INDX5HLDSET      /* 0xBF82BAA8 */
  .extern INDX5HLDINV      /* 0xBF82BAAC */
  .extern QEI5ICC          /* 0xBF82BAB0 */
  .extern QEI5ICCCLR       /* 0xBF82BAB4 */
  .extern QEI5ICCSET       /* 0xBF82BAB8 */
  .extern QEI5ICCINV       /* 0xBF82BABC */
  .extern QEI5CMPL         /* 0xBF82BAC0 */
  .extern QEI5CMPLCLR      /* 0xBF82BAC4 */
  .extern QEI5CMPLSET      /* 0xBF82BAC8 */
  .extern QEI5CMPLINV      /* 0xBF82BACC */
  .extern QEI6CON          /* 0xBF82BC00 */
  .extern QEI6CONCLR       /* 0xBF82BC04 */
  .extern QEI6CONSET       /* 0xBF82BC08 */
  .extern QEI6CONINV       /* 0xBF82BC0C */
  .extern QEI6IOC          /* 0xBF82BC10 */
  .extern QEI6IOCCLR       /* 0xBF82BC14 */
  .extern QEI6IOCSET       /* 0xBF82BC18 */
  .extern QEI6IOCINV       /* 0xBF82BC1C */
  .extern QEI6STAT         /* 0xBF82BC20 */
  .extern QEI6STATCLR      /* 0xBF82BC24 */
  .extern QEI6STATSET      /* 0xBF82BC28 */
  .extern QEI6STATINV      /* 0xBF82BC2C */
  .extern POS6CNT          /* 0xBF82BC30 */
  .extern POS6CNTCLR       /* 0xBF82BC34 */
  .extern POS6CNTSET       /* 0xBF82BC38 */
  .extern POS6CNTINV       /* 0xBF82BC3C */
  .extern POS6HLD          /* 0xBF82BC40 */
  .extern POS6HLDCLR       /* 0xBF82BC44 */
  .extern POS6HLDSET       /* 0xBF82BC48 */
  .extern POS6HLDINV       /* 0xBF82BC4C */
  .extern VEL6CNT          /* 0xBF82BC50 */
  .extern VEL6CNTCLR       /* 0xBF82BC54 */
  .extern VEL6CNTSET       /* 0xBF82BC58 */
  .extern VEL6CNTINV       /* 0xBF82BC5C */
  .extern VEL6HLD          /* 0xBF82BC60 */
  .extern VEL6HLDCLR       /* 0xBF82BC64 */
  .extern VEL6HLDSET       /* 0xBF82BC68 */
  .extern VEL6HLDINV       /* 0xBF82BC6C */
  .extern INT6TMR          /* 0xBF82BC70 */
  .extern INT6TMRCLR       /* 0xBF82BC74 */
  .extern INT6TMRSET       /* 0xBF82BC78 */
  .extern INT6TMRINV       /* 0xBF82BC7C */
  .extern INT6HLD          /* 0xBF82BC80 */
  .extern INT6HLDCLR       /* 0xBF82BC84 */
  .extern INT6HLDSET       /* 0xBF82BC88 */
  .extern INT6HLDINV       /* 0xBF82BC8C */
  .extern INDX6CNT         /* 0xBF82BC90 */
  .extern INDX6CNTCLR      /* 0xBF82BC94 */
  .extern INDX6CNTSET      /* 0xBF82BC98 */
  .extern INDX6CNTINV      /* 0xBF82BC9C */
  .extern INDX6HLD         /* 0xBF82BCA0 */
  .extern INDX6HLDCLR      /* 0xBF82BCA4 */
  .extern INDX6HLDSET      /* 0xBF82BCA8 */
  .extern INDX6HLDINV      /* 0xBF82BCAC */
  .extern QEI6ICC          /* 0xBF82BCB0 */
  .extern QEI6ICCCLR       /* 0xBF82BCB4 */
  .extern QEI6ICCSET       /* 0xBF82BCB8 */
  .extern QEI6ICCINV       /* 0xBF82BCBC */
  .extern QEI6CMPL         /* 0xBF82BCC0 */
  .extern QEI6CMPLCLR      /* 0xBF82BCC4 */
  .extern QEI6CMPLSET      /* 0xBF82BCC8 */
  .extern QEI6CMPLINV      /* 0xBF82BCCC */
  .extern CMSTAT           /* 0xBF82C000 */
  .extern CMSTATCLR        /* 0xBF82C004 */
  .extern CMSTATSET        /* 0xBF82C008 */
  .extern CMSTATINV        /* 0xBF82C00C */
  .extern CM1CON           /* 0xBF82C010 */
  .extern CM1CONCLR        /* 0xBF82C014 */
  .extern CM1CONSET        /* 0xBF82C018 */
  .extern CM1CONINV        /* 0xBF82C01C */
  .extern CM1MSKCON        /* 0xBF82C020 */
  .extern CM1MSKCONCLR     /* 0xBF82C024 */
  .extern CM1MSKCONSET     /* 0xBF82C028 */
  .extern CM1MSKCONINV     /* 0xBF82C02C */
  .extern CM2CON           /* 0xBF82C030 */
  .extern CM2CONCLR        /* 0xBF82C034 */
  .extern CM2CONSET        /* 0xBF82C038 */
  .extern CM2CONINV        /* 0xBF82C03C */
  .extern CM2MSKCON        /* 0xBF82C040 */
  .extern CM2MSKCONCLR     /* 0xBF82C044 */
  .extern CM2MSKCONSET     /* 0xBF82C048 */
  .extern CM2MSKCONINV     /* 0xBF82C04C */
  .extern CM3CON           /* 0xBF82C050 */
  .extern CM3CONCLR        /* 0xBF82C054 */
  .extern CM3CONSET        /* 0xBF82C058 */
  .extern CM3CONINV        /* 0xBF82C05C */
  .extern CM3MSKCON        /* 0xBF82C060 */
  .extern CM3MSKCONCLR     /* 0xBF82C064 */
  .extern CM3MSKCONSET     /* 0xBF82C068 */
  .extern CM3MSKCONINV     /* 0xBF82C06C */
  .extern CM4CON           /* 0xBF82C070 */
  .extern CM4CONCLR        /* 0xBF82C074 */
  .extern CM4CONSET        /* 0xBF82C078 */
  .extern CM4CONINV        /* 0xBF82C07C */
  .extern CM4MSKCON        /* 0xBF82C080 */
  .extern CM4MSKCONCLR     /* 0xBF82C084 */
  .extern CM4MSKCONSET     /* 0xBF82C088 */
  .extern CM4MSKCONINV     /* 0xBF82C08C */
  .extern CM5CON           /* 0xBF82C090 */
  .extern CM5CONCLR        /* 0xBF82C094 */
  .extern CM5CONSET        /* 0xBF82C098 */
  .extern CM5CONINV        /* 0xBF82C09C */
  .extern CM5MSKCON        /* 0xBF82C0A0 */
  .extern CM5MSKCONCLR     /* 0xBF82C0A4 */
  .extern CM5MSKCONSET     /* 0xBF82C0A8 */
  .extern CM5MSKCONINV     /* 0xBF82C0AC */
  .extern DAC1CON          /* 0xBF82C200 */
  .extern DAC1CONCLR       /* 0xBF82C204 */
  .extern DAC1CONSET       /* 0xBF82C208 */
  .extern DAC1CONINV       /* 0xBF82C20C */
  .extern CTMUCON          /* 0xBF82D000 */
  .extern CTMUCONCLR       /* 0xBF82D004 */
  .extern CTMUCONSET       /* 0xBF82D008 */
  .extern CTMUCONINV       /* 0xBF82D00C */
  .extern PMCON            /* 0xBF82E000 */
  .extern PMCONCLR         /* 0xBF82E004 */
  .extern PMCONSET         /* 0xBF82E008 */
  .extern PMCONINV         /* 0xBF82E00C */
  .extern PMMODE           /* 0xBF82E010 */
  .extern PMMODECLR        /* 0xBF82E014 */
  .extern PMMODESET        /* 0xBF82E018 */
  .extern PMMODEINV        /* 0xBF82E01C */
  .extern PMADDR           /* 0xBF82E020 */
  .extern PMADDRCLR        /* 0xBF82E024 */
  .extern PMADDRSET        /* 0xBF82E028 */
  .extern PMADDRINV        /* 0xBF82E02C */
  .extern PMDOUT           /* 0xBF82E030 */
  .extern PMDOUTCLR        /* 0xBF82E034 */
  .extern PMDOUTSET        /* 0xBF82E038 */
  .extern PMDOUTINV        /* 0xBF82E03C */
  .extern PMDIN            /* 0xBF82E040 */
  .extern PMDINCLR         /* 0xBF82E044 */
  .extern PMDINSET         /* 0xBF82E048 */
  .extern PMDININV         /* 0xBF82E04C */
  .extern PMAEN            /* 0xBF82E050 */
  .extern PMAENCLR         /* 0xBF82E054 */
  .extern PMAENSET         /* 0xBF82E058 */
  .extern PMAENINV         /* 0xBF82E05C */
  .extern PMSTAT           /* 0xBF82E060 */
  .extern PMSTATCLR        /* 0xBF82E064 */
  .extern PMSTATSET        /* 0xBF82E068 */
  .extern PMSTATINV        /* 0xBF82E06C */
  .extern PMWADDR          /* 0xBF82E070 */
  .extern PMWADDRCLR       /* 0xBF82E074 */
  .extern PMWADDRSET       /* 0xBF82E078 */
  .extern PMWADDRINV       /* 0xBF82E07C */
  .extern PMRADDR          /* 0xBF82E080 */
  .extern PMRADDRCLR       /* 0xBF82E084 */
  .extern PMRADDRSET       /* 0xBF82E088 */
  .extern PMRADDRINV       /* 0xBF82E08C */
  .extern PMRDIN           /* 0xBF82E090 */
  .extern PMRDINCLR        /* 0xBF82E094 */
  .extern PMRDINSET        /* 0xBF82E098 */
  .extern PMRDININV        /* 0xBF82E09C */
  .extern IC10CON          /* 0xBF843200 */
  .extern IC10CONCLR       /* 0xBF843204 */
  .extern IC10CONSET       /* 0xBF843208 */
  .extern IC10CONINV       /* 0xBF84320C */
  .extern IC10BUF          /* 0xBF843210 */
  .extern IC11CON          /* 0xBF843400 */
  .extern IC11CONCLR       /* 0xBF843404 */
  .extern IC11CONSET       /* 0xBF843408 */
  .extern IC11CONINV       /* 0xBF84340C */
  .extern IC11BUF          /* 0xBF843410 */
  .extern IC12CON          /* 0xBF843600 */
  .extern IC12CONCLR       /* 0xBF843604 */
  .extern IC12CONSET       /* 0xBF843608 */
  .extern IC12CONINV       /* 0xBF84360C */
  .extern IC12BUF          /* 0xBF843610 */
  .extern IC13CON          /* 0xBF843800 */
  .extern IC13CONCLR       /* 0xBF843804 */
  .extern IC13CONSET       /* 0xBF843808 */
  .extern IC13CONINV       /* 0xBF84380C */
  .extern IC13BUF          /* 0xBF843810 */
  .extern IC14CON          /* 0xBF843A00 */
  .extern IC14CONCLR       /* 0xBF843A04 */
  .extern IC14CONSET       /* 0xBF843A08 */
  .extern IC14CONINV       /* 0xBF843A0C */
  .extern IC14BUF          /* 0xBF843A10 */
  .extern IC15CON          /* 0xBF843C00 */
  .extern IC15CONCLR       /* 0xBF843C04 */
  .extern IC15CONSET       /* 0xBF843C08 */
  .extern IC15CONINV       /* 0xBF843C0C */
  .extern IC15BUF          /* 0xBF843C10 */
  .extern IC16CON          /* 0xBF843E00 */
  .extern IC16CONCLR       /* 0xBF843E04 */
  .extern IC16CONSET       /* 0xBF843E08 */
  .extern IC16CONINV       /* 0xBF843E0C */
  .extern IC16BUF          /* 0xBF843E10 */
  .extern OC10CON          /* 0xBF845200 */
  .extern OC10CONCLR       /* 0xBF845204 */
  .extern OC10CONSET       /* 0xBF845208 */
  .extern OC10CONINV       /* 0xBF84520C */
  .extern OC10R            /* 0xBF845210 */
  .extern OC10RCLR         /* 0xBF845214 */
  .extern OC10RSET         /* 0xBF845218 */
  .extern OC10RINV         /* 0xBF84521C */
  .extern OC10RS           /* 0xBF845220 */
  .extern OC10RSCLR        /* 0xBF845224 */
  .extern OC10RSSET        /* 0xBF845228 */
  .extern OC10RSINV        /* 0xBF84522C */
  .extern OC11CON          /* 0xBF845400 */
  .extern OC11CONCLR       /* 0xBF845404 */
  .extern OC11CONSET       /* 0xBF845408 */
  .extern OC11CONINV       /* 0xBF84540C */
  .extern OC11R            /* 0xBF845410 */
  .extern OC11RCLR         /* 0xBF845414 */
  .extern OC11RSET         /* 0xBF845418 */
  .extern OC11RINV         /* 0xBF84541C */
  .extern OC11RS           /* 0xBF845420 */
  .extern OC11RSCLR        /* 0xBF845424 */
  .extern OC11RSSET        /* 0xBF845428 */
  .extern OC11RSINV        /* 0xBF84542C */
  .extern OC12CON          /* 0xBF845600 */
  .extern OC12CONCLR       /* 0xBF845604 */
  .extern OC12CONSET       /* 0xBF845608 */
  .extern OC12CONINV       /* 0xBF84560C */
  .extern OC12R            /* 0xBF845610 */
  .extern OC12RCLR         /* 0xBF845614 */
  .extern OC12RSET         /* 0xBF845618 */
  .extern OC12RINV         /* 0xBF84561C */
  .extern OC12RS           /* 0xBF845620 */
  .extern OC12RSCLR        /* 0xBF845624 */
  .extern OC12RSSET        /* 0xBF845628 */
  .extern OC12RSINV        /* 0xBF84562C */
  .extern OC13CON          /* 0xBF845800 */
  .extern OC13CONCLR       /* 0xBF845804 */
  .extern OC13CONSET       /* 0xBF845808 */
  .extern OC13CONINV       /* 0xBF84580C */
  .extern OC13R            /* 0xBF845810 */
  .extern OC13RCLR         /* 0xBF845814 */
  .extern OC13RSET         /* 0xBF845818 */
  .extern OC13RINV         /* 0xBF84581C */
  .extern OC13RS           /* 0xBF845820 */
  .extern OC13RSCLR        /* 0xBF845824 */
  .extern OC13RSSET        /* 0xBF845828 */
  .extern OC13RSINV        /* 0xBF84582C */
  .extern OC14CON          /* 0xBF845A00 */
  .extern OC14CONCLR       /* 0xBF845A04 */
  .extern OC14CONSET       /* 0xBF845A08 */
  .extern OC14CONINV       /* 0xBF845A0C */
  .extern OC14R            /* 0xBF845A10 */
  .extern OC14RCLR         /* 0xBF845A14 */
  .extern OC14RSET         /* 0xBF845A18 */
  .extern OC14RINV         /* 0xBF845A1C */
  .extern OC14RS           /* 0xBF845A20 */
  .extern OC14RSCLR        /* 0xBF845A24 */
  .extern OC14RSSET        /* 0xBF845A28 */
  .extern OC14RSINV        /* 0xBF845A2C */
  .extern OC15CON          /* 0xBF845C00 */
  .extern OC15CONCLR       /* 0xBF845C04 */
  .extern OC15CONSET       /* 0xBF845C08 */
  .extern OC15CONINV       /* 0xBF845C0C */
  .extern OC15R            /* 0xBF845C10 */
  .extern OC15RCLR         /* 0xBF845C14 */
  .extern OC15RSET         /* 0xBF845C18 */
  .extern OC15RINV         /* 0xBF845C1C */
  .extern OC15RS           /* 0xBF845C20 */
  .extern OC15RSCLR        /* 0xBF845C24 */
  .extern OC15RSSET        /* 0xBF845C28 */
  .extern OC15RSINV        /* 0xBF845C2C */
  .extern OC16CON          /* 0xBF845E00 */
  .extern OC16CONCLR       /* 0xBF845E04 */
  .extern OC16CONSET       /* 0xBF845E08 */
  .extern OC16CONINV       /* 0xBF845E0C */
  .extern OC16R            /* 0xBF845E10 */
  .extern OC16RCLR         /* 0xBF845E14 */
  .extern OC16RSET         /* 0xBF845E18 */
  .extern OC16RINV         /* 0xBF845E1C */
  .extern OC16RS           /* 0xBF845E20 */
  .extern OC16RSCLR        /* 0xBF845E24 */
  .extern OC16RSSET        /* 0xBF845E28 */
  .extern OC16RSINV        /* 0xBF845E2C */
  .extern I2C3CON          /* 0xBF846400 */
  .extern I2C3CONCLR       /* 0xBF846404 */
  .extern I2C3CONSET       /* 0xBF846408 */
  .extern I2C3CONINV       /* 0xBF84640C */
  .extern I2C3STAT         /* 0xBF846410 */
  .extern I2C3STATCLR      /* 0xBF846414 */
  .extern I2C3STATSET      /* 0xBF846418 */
  .extern I2C3STATINV      /* 0xBF84641C */
  .extern I2C3ADD          /* 0xBF846420 */
  .extern I2C3ADDCLR       /* 0xBF846424 */
  .extern I2C3ADDSET       /* 0xBF846428 */
  .extern I2C3ADDINV       /* 0xBF84642C */
  .extern I2C3MSK          /* 0xBF846430 */
  .extern I2C3MSKCLR       /* 0xBF846434 */
  .extern I2C3MSKSET       /* 0xBF846438 */
  .extern I2C3MSKINV       /* 0xBF84643C */
  .extern I2C3BRG          /* 0xBF846440 */
  .extern I2C3BRGCLR       /* 0xBF846444 */
  .extern I2C3BRGSET       /* 0xBF846448 */
  .extern I2C3BRGINV       /* 0xBF84644C */
  .extern I2C3TRN          /* 0xBF846450 */
  .extern I2C3TRNCLR       /* 0xBF846454 */
  .extern I2C3TRNSET       /* 0xBF846458 */
  .extern I2C3TRNINV       /* 0xBF84645C */
  .extern I2C3RCV          /* 0xBF846460 */
  .extern I2C3RCVCLR       /* 0xBF846464 */
  .extern I2C3RCVSET       /* 0xBF846468 */
  .extern I2C3RCVINV       /* 0xBF84646C */
  .extern I2C4CON          /* 0xBF846600 */
  .extern I2C4CONCLR       /* 0xBF846604 */
  .extern I2C4CONSET       /* 0xBF846608 */
  .extern I2C4CONINV       /* 0xBF84660C */
  .extern I2C4STAT         /* 0xBF846610 */
  .extern I2C4STATCLR      /* 0xBF846614 */
  .extern I2C4STATSET      /* 0xBF846618 */
  .extern I2C4STATINV      /* 0xBF84661C */
  .extern I2C4ADD          /* 0xBF846620 */
  .extern I2C4ADDCLR       /* 0xBF846624 */
  .extern I2C4ADDSET       /* 0xBF846628 */
  .extern I2C4ADDINV       /* 0xBF84662C */
  .extern I2C4MSK          /* 0xBF846630 */
  .extern I2C4MSKCLR       /* 0xBF846634 */
  .extern I2C4MSKSET       /* 0xBF846638 */
  .extern I2C4MSKINV       /* 0xBF84663C */
  .extern I2C4BRG          /* 0xBF846640 */
  .extern I2C4BRGCLR       /* 0xBF846644 */
  .extern I2C4BRGSET       /* 0xBF846648 */
  .extern I2C4BRGINV       /* 0xBF84664C */
  .extern I2C4TRN          /* 0xBF846650 */
  .extern I2C4TRNCLR       /* 0xBF846654 */
  .extern I2C4TRNSET       /* 0xBF846658 */
  .extern I2C4TRNINV       /* 0xBF84665C */
  .extern I2C4RCV          /* 0xBF846660 */
  .extern I2C4RCVCLR       /* 0xBF846664 */
  .extern I2C4RCVSET       /* 0xBF846668 */
  .extern I2C4RCVINV       /* 0xBF84666C */
  .extern SPI3CON          /* 0xBF847400 */
  .extern SPI3CONCLR       /* 0xBF847404 */
  .extern SPI3CONSET       /* 0xBF847408 */
  .extern SPI3CONINV       /* 0xBF84740C */
  .extern SPI3STAT         /* 0xBF847410 */
  .extern SPI3STATCLR      /* 0xBF847414 */
  .extern SPI3STATSET      /* 0xBF847418 */
  .extern SPI3STATINV      /* 0xBF84741C */
  .extern SPI3BUF          /* 0xBF847420 */
  .extern SPI3BRG          /* 0xBF847430 */
  .extern SPI3BRGCLR       /* 0xBF847434 */
  .extern SPI3BRGSET       /* 0xBF847438 */
  .extern SPI3BRGINV       /* 0xBF84743C */
  .extern SPI3CON2         /* 0xBF847440 */
  .extern SPI3CON2CLR      /* 0xBF847444 */
  .extern SPI3CON2SET      /* 0xBF847448 */
  .extern SPI3CON2INV      /* 0xBF84744C */
  .extern SPI4CON          /* 0xBF847600 */
  .extern SPI4CONCLR       /* 0xBF847604 */
  .extern SPI4CONSET       /* 0xBF847608 */
  .extern SPI4CONINV       /* 0xBF84760C */
  .extern SPI4STAT         /* 0xBF847610 */
  .extern SPI4STATCLR      /* 0xBF847614 */
  .extern SPI4STATSET      /* 0xBF847618 */
  .extern SPI4STATINV      /* 0xBF84761C */
  .extern SPI4BUF          /* 0xBF847620 */
  .extern SPI4BRG          /* 0xBF847630 */
  .extern SPI4BRGCLR       /* 0xBF847634 */
  .extern SPI4BRGSET       /* 0xBF847638 */
  .extern SPI4BRGINV       /* 0xBF84763C */
  .extern SPI4CON2         /* 0xBF847640 */
  .extern SPI4CON2CLR      /* 0xBF847644 */
  .extern SPI4CON2SET      /* 0xBF847648 */
  .extern SPI4CON2INV      /* 0xBF84764C */
  .extern SPI5CON          /* 0xBF847800 */
  .extern SPI5CONCLR       /* 0xBF847804 */
  .extern SPI5CONSET       /* 0xBF847808 */
  .extern SPI5CONINV       /* 0xBF84780C */
  .extern SPI5STAT         /* 0xBF847810 */
  .extern SPI5STATCLR      /* 0xBF847814 */
  .extern SPI5STATSET      /* 0xBF847818 */
  .extern SPI5STATINV      /* 0xBF84781C */
  .extern SPI5BUF          /* 0xBF847820 */
  .extern SPI5BRG          /* 0xBF847830 */
  .extern SPI5BRGCLR       /* 0xBF847834 */
  .extern SPI5BRGSET       /* 0xBF847838 */
  .extern SPI5BRGINV       /* 0xBF84783C */
  .extern SPI5CON2         /* 0xBF847840 */
  .extern SPI5CON2CLR      /* 0xBF847844 */
  .extern SPI5CON2SET      /* 0xBF847848 */
  .extern SPI5CON2INV      /* 0xBF84784C */
  .extern SPI6CON          /* 0xBF847A00 */
  .extern SPI6CONCLR       /* 0xBF847A04 */
  .extern SPI6CONSET       /* 0xBF847A08 */
  .extern SPI6CONINV       /* 0xBF847A0C */
  .extern SPI6STAT         /* 0xBF847A10 */
  .extern SPI6STATCLR      /* 0xBF847A14 */
  .extern SPI6STATSET      /* 0xBF847A18 */
  .extern SPI6STATINV      /* 0xBF847A1C */
  .extern SPI6BUF          /* 0xBF847A20 */
  .extern SPI6BRG          /* 0xBF847A30 */
  .extern SPI6BRGCLR       /* 0xBF847A34 */
  .extern SPI6BRGSET       /* 0xBF847A38 */
  .extern SPI6BRGINV       /* 0xBF847A3C */
  .extern SPI6CON2         /* 0xBF847A40 */
  .extern SPI6CON2CLR      /* 0xBF847A44 */
  .extern SPI6CON2SET      /* 0xBF847A48 */
  .extern SPI6CON2INV      /* 0xBF847A4C */
  .extern U3MODE           /* 0xBF848400 */
  .extern U3MODECLR        /* 0xBF848404 */
  .extern U3MODESET        /* 0xBF848408 */
  .extern U3MODEINV        /* 0xBF84840C */
  .extern U3STA            /* 0xBF848410 */
  .extern U3STACLR         /* 0xBF848414 */
  .extern U3STASET         /* 0xBF848418 */
  .extern U3STAINV         /* 0xBF84841C */
  .extern U3TXREG          /* 0xBF848420 */
  .extern U3RXREG          /* 0xBF848430 */
  .extern U3BRG            /* 0xBF848440 */
  .extern U3BRGCLR         /* 0xBF848444 */
  .extern U3BRGSET         /* 0xBF848448 */
  .extern U3BRGINV         /* 0xBF84844C */
  .extern U4MODE           /* 0xBF848600 */
  .extern U4MODECLR        /* 0xBF848604 */
  .extern U4MODESET        /* 0xBF848608 */
  .extern U4MODEINV        /* 0xBF84860C */
  .extern U4STA            /* 0xBF848610 */
  .extern U4STACLR         /* 0xBF848614 */
  .extern U4STASET         /* 0xBF848618 */
  .extern U4STAINV         /* 0xBF84861C */
  .extern U4TXREG          /* 0xBF848620 */
  .extern U4RXREG          /* 0xBF848630 */
  .extern U4BRG            /* 0xBF848640 */
  .extern U4BRGCLR         /* 0xBF848644 */
  .extern U4BRGSET         /* 0xBF848648 */
  .extern U4BRGINV         /* 0xBF84864C */
  .extern U5MODE           /* 0xBF848800 */
  .extern U5MODECLR        /* 0xBF848804 */
  .extern U5MODESET        /* 0xBF848808 */
  .extern U5MODEINV        /* 0xBF84880C */
  .extern U5STA            /* 0xBF848810 */
  .extern U5STACLR         /* 0xBF848814 */
  .extern U5STASET         /* 0xBF848818 */
  .extern U5STAINV         /* 0xBF84881C */
  .extern U5TXREG          /* 0xBF848820 */
  .extern U5RXREG          /* 0xBF848830 */
  .extern U5BRG            /* 0xBF848840 */
  .extern U5BRGCLR         /* 0xBF848844 */
  .extern U5BRGSET         /* 0xBF848848 */
  .extern U5BRGINV         /* 0xBF84884C */
  .extern U6MODE           /* 0xBF848A00 */
  .extern U6MODECLR        /* 0xBF848A04 */
  .extern U6MODESET        /* 0xBF848A08 */
  .extern U6MODEINV        /* 0xBF848A0C */
  .extern U6STA            /* 0xBF848A10 */
  .extern U6STACLR         /* 0xBF848A14 */
  .extern U6STASET         /* 0xBF848A18 */
  .extern U6STAINV         /* 0xBF848A1C */
  .extern U6TXREG          /* 0xBF848A20 */
  .extern U6RXREG          /* 0xBF848A30 */
  .extern U6BRG            /* 0xBF848A40 */
  .extern U6BRGCLR         /* 0xBF848A44 */
  .extern U6BRGSET         /* 0xBF848A48 */
  .extern U6BRGINV         /* 0xBF848A4C */
  .extern DAC2CON          /* 0xBF84C400 */
  .extern DAC2CONCLR       /* 0xBF84C404 */
  .extern DAC2CONSET       /* 0xBF84C408 */
  .extern DAC2CONINV       /* 0xBF84C40C */
  .extern DAC3CON          /* 0xBF84C600 */
  .extern DAC3CONCLR       /* 0xBF84C604 */
  .extern DAC3CONSET       /* 0xBF84C608 */
  .extern DAC3CONINV       /* 0xBF84C60C */
