Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
  .extern CFD1FLTOBJ27INV  /* 0xBF880B2C */
  .extern CFD1MASK27       /* 0xBF880B30 */
  .extern CFD1MASK27CLR    /* 0xBF880B34 */
  .extern CFD1MASK27SET    /* 0xBF880B38 */
  .extern CFD1MASK27INV    /* 0xBF880B3C */
  .extern CFD1FLTOBJ28     /* 0xBF880B40 */
  .extern CFD1FLTOBJ28CLR  /* 0xBF880B44 */
  .extern CFD1FLTOBJ28SET  /* 0xBF880B48 */
  .extern CFD1FLTOBJ28INV  /* 0xBF880B4C */
  .extern CFD1MASK28       /* 0xBF880B50 */
  .extern CFD1MASK28CLR    /* 0xBF880B54 */
  .extern CFD1MASK28SET    /* 0xBF880B58 */
  .extern CFD1MASK28INV    /* 0xBF880B5C */
  .extern CFD1FLTOBJ29     /* 0xBF880B60 */
  .extern CFD1FLTOBJ29CLR  /* 0xBF880B64 */
  .extern CFD1FLTOBJ29SET  /* 0xBF880B68 */
  .extern CFD1FLTOBJ29INV  /* 0xBF880B6C */
  .extern CFD1MASK29       /* 0xBF880B70 */
  .extern CFD1MASK29CLR    /* 0xBF880B74 */
  .extern CFD1MASK29SET    /* 0xBF880B78 */
  .extern CFD1MASK29INV    /* 0xBF880B7C */
  .extern CFD1FLTOBJ30     /* 0xBF880B80 */
  .extern CFD1FLTOBJ30CLR  /* 0xBF880B84 */
  .extern CFD1FLTOBJ30SET  /* 0xBF880B88 */
  .extern CFD1FLTOBJ30INV  /* 0xBF880B8C */
  .extern CFD1MASK30       /* 0xBF880B90 */
  .extern CFD1MASK30CLR    /* 0xBF880B94 */
  .extern CFD1MASK30SET    /* 0xBF880B98 */
  .extern CFD1MASK30INV    /* 0xBF880B9C */
  .extern CFD1FLTOBJ31     /* 0xBF880BA0 */
  .extern CFD1FLTOBJ31CLR  /* 0xBF880BA4 */
  .extern CFD1FLTOBJ31SET  /* 0xBF880BA8 */
  .extern CFD1FLTOBJ31INV  /* 0xBF880BAC */
  .extern CFD1MASK31       /* 0xBF880BB0 */
  .extern CFD1MASK31CLR    /* 0xBF880BB4 */
  .extern CFD1MASK31SET    /* 0xBF880BB8 */
  .extern CFD1MASK31INV    /* 0xBF880BBC */
  .extern CFD2CON          /* 0xBF881000 */
  .extern CFD2CONCLR       /* 0xBF881004 */
  .extern CFD2CONSET       /* 0xBF881008 */
  .extern CFD2CONINV       /* 0xBF88100C */
  .extern CFD2NBTCFG       /* 0xBF881010 */
  .extern CFD2NBTCFGCLR    /* 0xBF881014 */
  .extern CFD2NBTCFGSET    /* 0xBF881018 */
  .extern CFD2NBTCFGINV    /* 0xBF88101C */
  .extern CFD2DBTCFG       /* 0xBF881020 */
  .extern CFD2DBTCFGCLR    /* 0xBF881024 */
  .extern CFD2DBTCFGSET    /* 0xBF881028 */
  .extern CFD2DBTCFGINV    /* 0xBF88102C */
  .extern CFD2TDC          /* 0xBF881030 */
  .extern CFD2TDCCLR       /* 0xBF881034 */
  .extern CFD2TDCSET       /* 0xBF881038 */
  .extern CFD2TDCINV       /* 0xBF88103C */
  .extern CFD2TBC          /* 0xBF881040 */
  .extern CFD2TBCCLR       /* 0xBF881044 */
  .extern CFD2TBCSET       /* 0xBF881048 */
  .extern CFD2TBCINV       /* 0xBF88104C */
  .extern CFD2TSCON        /* 0xBF881050 */
  .extern CFD2TSCONCLR     /* 0xBF881054 */
  .extern CFD2TSCONSET     /* 0xBF881058 */
  .extern CFD2TSCONINV     /* 0xBF88105C */
  .extern CFD2VEC          /* 0xBF881060 */
  .extern CFD2VECCLR       /* 0xBF881064 */
  .extern CFD2VECSET       /* 0xBF881068 */
  .extern CFD2VECINV       /* 0xBF88106C */
  .extern CFD2INT          /* 0xBF881070 */
  .extern CFD2INTCLR       /* 0xBF881074 */
  .extern CFD2INTSET       /* 0xBF881078 */
  .extern CFD2INTINV       /* 0xBF88107C */
  .extern CFD2RXIF         /* 0xBF881080 */
  .extern CFD2RXIFCLR      /* 0xBF881084 */
  .extern CFD2RXIFSET      /* 0xBF881088 */
  .extern CFD2RXIFINV      /* 0xBF88108C */
  .extern CFD2TXIF         /* 0xBF881090 */
  .extern CFD2TXIFCLR      /* 0xBF881094 */
  .extern CFD2TXIFSET      /* 0xBF881098 */
  .extern CFD2TXIFINV      /* 0xBF88109C */
  .extern CFD2RXOVIF       /* 0xBF8810A0 */
  .extern CFD2RXOVIFCLR    /* 0xBF8810A4 */
  .extern CFD2RXOVIFSET    /* 0xBF8810A8 */
  .extern CFD2RXOVIFINV    /* 0xBF8810AC */
  .extern CFD2TXATIF       /* 0xBF8810B0 */
  .extern CFD2TXATIFCLR    /* 0xBF8810B4 */
  .extern CFD2TXATIFSET    /* 0xBF8810B8 */
  .extern CFD2TXATIFINV    /* 0xBF8810BC */
  .extern CFD2TXREQ        /* 0xBF8810C0 */
  .extern CFD2TXREQCLR     /* 0xBF8810C4 */
  .extern CFD2TXREQSET     /* 0xBF8810C8 */
  .extern CFD2TXREQINV     /* 0xBF8810CC */
  .extern CFD2TREC         /* 0xBF8810D0 */
  .extern CFD2TRECCLR      /* 0xBF8810D4 */
  .extern CFD2TRECSET      /* 0xBF8810D8 */
  .extern CFD2TRECINV      /* 0xBF8810DC */
  .extern CFD2BDIAG0       /* 0xBF8810E0 */
  .extern CFD2BDIAG0CLR    /* 0xBF8810E4 */
  .extern CFD2BDIAG0SET    /* 0xBF8810E8 */
  .extern CFD2BDIAG0INV    /* 0xBF8810EC */
  .extern CFD2BDIAG1       /* 0xBF8810F0 */
  .extern CFD2BDIAG1CLR    /* 0xBF8810F4 */
  .extern CFD2BDIAG1SET    /* 0xBF8810F8 */
  .extern CFD2BDIAG1INV    /* 0xBF8810FC */
  .extern CFD2TEFCON       /* 0xBF881100 */
  .extern CFD2TEFCONCLR    /* 0xBF881104 */
  .extern CFD2TEFCONSET    /* 0xBF881108 */
  .extern CFD2TEFCONINV    /* 0xBF88110C */
  .extern CFD2TEFSTA       /* 0xBF881110 */
  .extern CFD2TEFSTACLR    /* 0xBF881114 */
  .extern CFD2TEFSTASET    /* 0xBF881118 */
  .extern CFD2TEFSTAINV    /* 0xBF88111C */
  .extern CFD2TEFUA        /* 0xBF881120 */
  .extern CFD2TEFUACLR     /* 0xBF881124 */
  .extern CFD2TEFUASET     /* 0xBF881128 */
  .extern CFD2TEFUAINV     /* 0xBF88112C */
  .extern CFD2FIFOBA       /* 0xBF881130 */
  .extern CFD2FIFOBACLR    /* 0xBF881134 */
  .extern CFD2FIFOBASET    /* 0xBF881138 */
  .extern CFD2FIFOBAINV    /* 0xBF88113C */
  .extern CFD2TXQCON       /* 0xBF881140 */
  .extern CFD2TXQCONCLR    /* 0xBF881144 */
  .extern CFD2TXQCONSET    /* 0xBF881148 */
  .extern CFD2TXQCONINV    /* 0xBF88114C */
  .extern CFD2TXQSTA       /* 0xBF881150 */
  .extern CFD2TXQSTACLR    /* 0xBF881154 */
  .extern CFD2TXQSTASET    /* 0xBF881158 */
  .extern CFD2TXQSTAINV    /* 0xBF88115C */
  .extern CFD2TXQUA        /* 0xBF881160 */
  .extern CFD2TXQUACLR     /* 0xBF881164 */
  .extern CFD2TXQUASET     /* 0xBF881168 */
  .extern CFD2TXQUAINV     /* 0xBF88116C */
  .extern CFD2FIFOCON1     /* 0xBF881170 */
  .extern CFD2FIFOCON1CLR  /* 0xBF881174 */
  .extern CFD2FIFOCON1SET  /* 0xBF881178 */
  .extern CFD2FIFOCON1INV  /* 0xBF88117C */
  .extern CFD2FIFOSTA1     /* 0xBF881180 */
  .extern CFD2FIFOSTA1CLR  /* 0xBF881184 */
  .extern CFD2FIFOSTA1SET  /* 0xBF881188 */
  .extern CFD2FIFOSTA1INV  /* 0xBF88118C */
  .extern CFD2FIFOUA1      /* 0xBF881190 */
  .extern CFD2FIFOUA1CLR   /* 0xBF881194 */
  .extern CFD2FIFOUA1SET   /* 0xBF881198 */
  .extern CFD2FIFOUA1INV   /* 0xBF88119C */
  .extern CFD2FIFOCON2     /* 0xBF8811A0 */
  .extern CFD2FIFOCON2CLR  /* 0xBF8811A4 */
  .extern CFD2FIFOCON2SET  /* 0xBF8811A8 */
  .extern CFD2FIFOCON2INV  /* 0xBF8811AC */
  .extern CFD2FIFOSTA2     /* 0xBF8811B0 */
  .extern CFD2FIFOSTA2CLR  /* 0xBF8811B4 */
  .extern CFD2FIFOSTA2SET  /* 0xBF8811B8 */
  .extern CFD2FIFOSTA2INV  /* 0xBF8811BC */
  .extern CFD2FIFOUA2      /* 0xBF8811C0 */
  .extern CFD2FIFOUA2CLR   /* 0xBF8811C4 */
  .extern CFD2FIFOUA2SET   /* 0xBF8811C8 */
  .extern CFD2FIFOUA2INV   /* 0xBF8811CC */
  .extern CFD2FIFOCON3     /* 0xBF8811D0 */
  .extern CFD2FIFOCON3CLR  /* 0xBF8811D4 */
  .extern CFD2FIFOCON3SET  /* 0xBF8811D8 */
  .extern CFD2FIFOCON3INV  /* 0xBF8811DC */
  .extern CFD2FIFOSTA3     /* 0xBF8811E0 */
  .extern CFD2FIFOSTA3CLR  /* 0xBF8811E4 */
  .extern CFD2FIFOSTA3SET  /* 0xBF8811E8 */
  .extern CFD2FIFOSTA3INV  /* 0xBF8811EC */
  .extern CFD2FIFOUA3      /* 0xBF8811F0 */
  .extern CFD2FIFOUA3CLR   /* 0xBF8811F4 */
  .extern CFD2FIFOUA3SET   /* 0xBF8811F8 */
  .extern CFD2FIFOUA3INV   /* 0xBF8811FC */
  .extern CFD2FIFOCON4     /* 0xBF881200 */
  .extern CFD2FIFOCON4CLR  /* 0xBF881204 */
  .extern CFD2FIFOCON4SET  /* 0xBF881208 */
  .extern CFD2FIFOCON4INV  /* 0xBF88120C */
  .extern CFD2FIFOSTA4     /* 0xBF881210 */
  .extern CFD2FIFOSTA4CLR  /* 0xBF881214 */
  .extern CFD2FIFOSTA4SET  /* 0xBF881218 */
  .extern CFD2FIFOSTA4INV  /* 0xBF88121C */
  .extern CFD2FIFOUA4      /* 0xBF881220 */
  .extern CFD2FIFOUA4CLR   /* 0xBF881224 */
  .extern CFD2FIFOUA4SET   /* 0xBF881228 */
  .extern CFD2FIFOUA4INV   /* 0xBF88122C */
  .extern CFD2FIFOCON5     /* 0xBF881230 */
  .extern CFD2FIFOCON5CLR  /* 0xBF881234 */
  .extern CFD2FIFOCON5SET  /* 0xBF881238 */
  .extern CFD2FIFOCON5INV  /* 0xBF88123C */
  .extern CFD2FIFOSTA5     /* 0xBF881240 */
  .extern CFD2FIFOSTA5CLR  /* 0xBF881244 */
  .extern CFD2FIFOSTA5SET  /* 0xBF881248 */
  .extern CFD2FIFOSTA5INV  /* 0xBF88124C */
  .extern CFD2FIFOUA5      /* 0xBF881250 */
  .extern CFD2FIFOUA5CLR   /* 0xBF881254 */
  .extern CFD2FIFOUA5SET   /* 0xBF881258 */
  .extern CFD2FIFOUA5INV   /* 0xBF88125C */
  .extern CFD2FIFOCON6     /* 0xBF881260 */
  .extern CFD2FIFOCON6CLR  /* 0xBF881264 */
  .extern CFD2FIFOCON6SET  /* 0xBF881268 */
  .extern CFD2FIFOCON6INV  /* 0xBF88126C */
  .extern CFD2FIFOSTA6     /* 0xBF881270 */
  .extern CFD2FIFOSTA6CLR  /* 0xBF881274 */
  .extern CFD2FIFOSTA6SET  /* 0xBF881278 */
  .extern CFD2FIFOSTA6INV  /* 0xBF88127C */
  .extern CFD2FIFOUA6      /* 0xBF881280 */
  .extern CFD2FIFOUA6CLR   /* 0xBF881284 */
  .extern CFD2FIFOUA6SET   /* 0xBF881288 */
  .extern CFD2FIFOUA6INV   /* 0xBF88128C */
  .extern CFD2FIFOCON7     /* 0xBF881290 */
  .extern CFD2FIFOCON7CLR  /* 0xBF881294 */
  .extern CFD2FIFOCON7SET  /* 0xBF881298 */
  .extern CFD2FIFOCON7INV  /* 0xBF88129C */
  .extern CFD2FIFOSTA7     /* 0xBF8812A0 */
  .extern CFD2FIFOSTA7CLR  /* 0xBF8812A4 */
  .extern CFD2FIFOSTA7SET  /* 0xBF8812A8 */
  .extern CFD2FIFOSTA7INV  /* 0xBF8812AC */
  .extern CFD2FIFOUA7      /* 0xBF8812B0 */
  .extern CFD2FIFOUA7CLR   /* 0xBF8812B4 */
  .extern CFD2FIFOUA7SET   /* 0xBF8812B8 */
  .extern CFD2FIFOUA7INV   /* 0xBF8812BC */
  .extern CFD2FIFOCON8     /* 0xBF8812C0 */
  .extern CFD2FIFOCON8CLR  /* 0xBF8812C4 */
  .extern CFD2FIFOCON8SET  /* 0xBF8812C8 */
  .extern CFD2FIFOCON8INV  /* 0xBF8812CC */
  .extern CFD2FIFOSTA8     /* 0xBF8812D0 */
  .extern CFD2FIFOSTA8CLR  /* 0xBF8812D4 */
  .extern CFD2FIFOSTA8SET  /* 0xBF8812D8 */
  .extern CFD2FIFOSTA8INV  /* 0xBF8812DC */
  .extern CFD2FIFOUA8      /* 0xBF8812E0 */
  .extern CFD2FIFOUA8CLR   /* 0xBF8812E4 */
  .extern CFD2FIFOUA8SET   /* 0xBF8812E8 */
  .extern CFD2FIFOUA8INV   /* 0xBF8812EC */
  .extern CFD2FIFOCON9     /* 0xBF8812F0 */
  .extern CFD2FIFOCON9CLR  /* 0xBF8812F4 */
  .extern CFD2FIFOCON9SET  /* 0xBF8812F8 */
  .extern CFD2FIFOCON9INV  /* 0xBF8812FC */
  .extern CFD2FIFOSTA9     /* 0xBF881300 */
  .extern CFD2FIFOSTA9CLR  /* 0xBF881304 */
  .extern CFD2FIFOSTA9SET  /* 0xBF881308 */
  .extern CFD2FIFOSTA9INV  /* 0xBF88130C */
  .extern CFD2FIFOUA9      /* 0xBF881310 */
  .extern CFD2FIFOUA9CLR   /* 0xBF881314 */
  .extern CFD2FIFOUA9SET   /* 0xBF881318 */
  .extern CFD2FIFOUA9INV   /* 0xBF88131C */
  .extern CFD2FIFOCON10    /* 0xBF881320 */
  .extern CFD2FIFOCON10CLR /* 0xBF881324 */
  .extern CFD2FIFOCON10SET /* 0xBF881328 */
  .extern CFD2FIFOCON10INV /* 0xBF88132C */
  .extern CFD2FIFOSTA10    /* 0xBF881330 */
  .extern CFD2FIFOSTA10CLR /* 0xBF881334 */
  .extern CFD2FIFOSTA10SET /* 0xBF881338 */
  .extern CFD2FIFOSTA10INV /* 0xBF88133C */
  .extern CFD2FIFOUA10     /* 0xBF881340 */
  .extern CFD2FIFOUA10CLR  /* 0xBF881344 */
  .extern CFD2FIFOUA10SET  /* 0xBF881348 */
  .extern CFD2FIFOUA10INV  /* 0xBF88134C */
  .extern CFD2FIFOCON11    /* 0xBF881350 */
  .extern CFD2FIFOCON11CLR /* 0xBF881354 */
  .extern CFD2FIFOCON11SET /* 0xBF881358 */
  .extern CFD2FIFOCON11INV /* 0xBF88135C */
  .extern CFD2FIFOSTA11    /* 0xBF881360 */
  .extern CFD2FIFOSTA11CLR /* 0xBF881364 */
  .extern CFD2FIFOSTA11SET /* 0xBF881368 */
  .extern CFD2FIFOSTA11INV /* 0xBF88136C */
  .extern CFD2FIFOUA11     /* 0xBF881370 */
  .extern CFD2FIFOUA11CLR  /* 0xBF881374 */
  .extern CFD2FIFOUA11SET  /* 0xBF881378 */
  .extern CFD2FIFOUA11INV  /* 0xBF88137C */
  .extern CFD2FIFOCON12    /* 0xBF881380 */
  .extern CFD2FIFOCON12CLR /* 0xBF881384 */
  .extern CFD2FIFOCON12SET /* 0xBF881388 */
  .extern CFD2FIFOCON12INV /* 0xBF88138C */
  .extern CFD2FIFOSTA12    /* 0xBF881390 */
  .extern CFD2FIFOSTA12CLR /* 0xBF881394 */
  .extern CFD2FIFOSTA12SET /* 0xBF881398 */
  .extern CFD2FIFOSTA12INV /* 0xBF88139C */
  .extern CFD2FIFOUA12     /* 0xBF8813A0 */
  .extern CFD2FIFOUA12CLR  /* 0xBF8813A4 */
  .extern CFD2FIFOUA12SET  /* 0xBF8813A8 */
  .extern CFD2FIFOUA12INV  /* 0xBF8813AC */
  .extern CFD2FIFOCON13    /* 0xBF8813B0 */
  .extern CFD2FIFOCON13CLR /* 0xBF8813B4 */
  .extern CFD2FIFOCON13SET /* 0xBF8813B8 */
  .extern CFD2FIFOCON13INV /* 0xBF8813BC */
  .extern CFD2FIFOSTA13    /* 0xBF8813C0 */
  .extern CFD2FIFOSTA13CLR /* 0xBF8813C4 */
  .extern CFD2FIFOSTA13SET /* 0xBF8813C8 */
  .extern CFD2FIFOSTA13INV /* 0xBF8813CC */
  .extern CFD2FIFOUA13     /* 0xBF8813D0 */
  .extern CFD2FIFOUA13CLR  /* 0xBF8813D4 */
  .extern CFD2FIFOUA13SET  /* 0xBF8813D8 */
  .extern CFD2FIFOUA13INV  /* 0xBF8813DC */
  .extern CFD2FIFOCON14    /* 0xBF8813E0 */
  .extern CFD2FIFOCON14CLR /* 0xBF8813E4 */
  .extern CFD2FIFOCON14SET /* 0xBF8813E8 */
  .extern CFD2FIFOCON14INV /* 0xBF8813EC */
  .extern CFD2FIFOSTA14    /* 0xBF8813F0 */
  .extern CFD2FIFOSTA14CLR /* 0xBF8813F4 */
  .extern CFD2FIFOSTA14SET /* 0xBF8813F8 */
  .extern CFD2FIFOSTA14INV /* 0xBF8813FC */
  .extern CFD2FIFOUA14     /* 0xBF881400 */
  .extern CFD2FIFOUA14CLR  /* 0xBF881404 */
  .extern CFD2FIFOUA14SET  /* 0xBF881408 */
  .extern CFD2FIFOUA14INV  /* 0xBF88140C */
  .extern CFD2FIFOCON15    /* 0xBF881410 */
  .extern CFD2FIFOCON15CLR /* 0xBF881414 */
  .extern CFD2FIFOCON15SET /* 0xBF881418 */
  .extern CFD2FIFOCON15INV /* 0xBF88141C */
  .extern CFD2FIFOSTA15    /* 0xBF881420 */
  .extern CFD2FIFOSTA15CLR /* 0xBF881424 */
  .extern CFD2FIFOSTA15SET /* 0xBF881428 */
  .extern CFD2FIFOSTA15INV /* 0xBF88142C */
  .extern CFD2FIFOUA15     /* 0xBF881430 */
  .extern CFD2FIFOUA15CLR  /* 0xBF881434 */
  .extern CFD2FIFOUA15SET  /* 0xBF881438 */
  .extern CFD2FIFOUA15INV  /* 0xBF88143C */
  .extern CFD2FIFOCON16    /* 0xBF881440 */
  .extern CFD2FIFOCON16CLR /* 0xBF881444 */
  .extern CFD2FIFOCON16SET /* 0xBF881448 */
  .extern CFD2FIFOCON16INV /* 0xBF88144C */
  .extern CFD2FIFOSTA16    /* 0xBF881450 */
  .extern CFD2FIFOSTA16CLR /* 0xBF881454 */
  .extern CFD2FIFOSTA16SET /* 0xBF881458 */
  .extern CFD2FIFOSTA16INV /* 0xBF88145C */
  .extern CFD2FIFOUA16     /* 0xBF881460 */
  .extern CFD2FIFOUA16CLR  /* 0xBF881464 */
  .extern CFD2FIFOUA16SET  /* 0xBF881468 */
  .extern CFD2FIFOUA16INV  /* 0xBF88146C */
  .extern CFD2FIFOCON17    /* 0xBF881470 */
  .extern CFD2FIFOCON17CLR /* 0xBF881474 */
  .extern CFD2FIFOCON17SET /* 0xBF881478 */
  .extern CFD2FIFOCON17INV /* 0xBF88147C */
  .extern CFD2FIFOSTA17    /* 0xBF881480 */
  .extern CFD2FIFOSTA17CLR /* 0xBF881484 */
  .extern CFD2FIFOSTA17SET /* 0xBF881488 */
  .extern CFD2FIFOSTA17INV /* 0xBF88148C */
  .extern CFD2FIFOUA17     /* 0xBF881490 */
  .extern CFD2FIFOUA17CLR  /* 0xBF881494 */
  .extern CFD2FIFOUA17SET  /* 0xBF881498 */
  .extern CFD2FIFOUA17INV  /* 0xBF88149C */
  .extern CFD2FIFOCON18    /* 0xBF8814A0 */
  .extern CFD2FIFOCON18CLR /* 0xBF8814A4 */
  .extern CFD2FIFOCON18SET /* 0xBF8814A8 */
  .extern CFD2FIFOCON18INV /* 0xBF8814AC */
  .extern CFD2FIFOSTA18    /* 0xBF8814B0 */
  .extern CFD2FIFOSTA18CLR /* 0xBF8814B4 */
  .extern CFD2FIFOSTA18SET /* 0xBF8814B8 */
  .extern CFD2FIFOSTA18INV /* 0xBF8814BC */
  .extern CFD2FIFOUA18     /* 0xBF8814C0 */
  .extern CFD2FIFOUA18CLR  /* 0xBF8814C4 */
  .extern CFD2FIFOUA18SET  /* 0xBF8814C8 */
  .extern CFD2FIFOUA18INV  /* 0xBF8814CC */
  .extern CFD2FIFOCON19    /* 0xBF8814D0 */
  .extern CFD2FIFOCON19CLR /* 0xBF8814D4 */
  .extern CFD2FIFOCON19SET /* 0xBF8814D8 */
  .extern CFD2FIFOCON19INV /* 0xBF8814DC */
  .extern CFD2FIFOSTA19    /* 0xBF8814E0 */
  .extern CFD2FIFOSTA19CLR /* 0xBF8814E4 */
  .extern CFD2FIFOSTA19SET /* 0xBF8814E8 */
  .extern CFD2FIFOSTA19INV /* 0xBF8814EC */
  .extern CFD2FIFOUA19     /* 0xBF8814F0 */
  .extern CFD2FIFOUA19CLR  /* 0xBF8814F4 */
  .extern CFD2FIFOUA19SET  /* 0xBF8814F8 */
  .extern CFD2FIFOUA19INV  /* 0xBF8814FC */
  .extern CFD2FIFOCON20    /* 0xBF881500 */
  .extern CFD2FIFOCON20CLR /* 0xBF881504 */
  .extern CFD2FIFOCON20SET /* 0xBF881508 */
  .extern CFD2FIFOCON20INV /* 0xBF88150C */
  .extern CFD2FIFOSTA20    /* 0xBF881510 */
  .extern CFD2FIFOSTA20CLR /* 0xBF881514 */
  .extern CFD2FIFOSTA20SET /* 0xBF881518 */
  .extern CFD2FIFOSTA20INV /* 0xBF88151C */
  .extern CFD2FIFOUA20     /* 0xBF881520 */
  .extern CFD2FIFOUA20CLR  /* 0xBF881524 */
  .extern CFD2FIFOUA20SET  /* 0xBF881528 */
  .extern CFD2FIFOUA20INV  /* 0xBF88152C */
  .extern CFD2FIFOCON21    /* 0xBF881530 */
  .extern CFD2FIFOCON21CLR /* 0xBF881534 */
  .extern CFD2FIFOCON21SET /* 0xBF881538 */
  .extern CFD2FIFOCON21INV /* 0xBF88153C */
  .extern CFD2FIFOSTA21    /* 0xBF881540 */
  .extern CFD2FIFOSTA21CLR /* 0xBF881544 */
  .extern CFD2FIFOSTA21SET /* 0xBF881548 */
  .extern CFD2FIFOSTA21INV /* 0xBF88154C */
  .extern CFD2FIFOUA21     /* 0xBF881550 */
  .extern CFD2FIFOUA21CLR  /* 0xBF881554 */
  .extern CFD2FIFOUA21SET  /* 0xBF881558 */
  .extern CFD2FIFOUA21INV  /* 0xBF88155C */
  .extern CFD2FIFOCON22    /* 0xBF881560 */
  .extern CFD2FIFOCON22CLR /* 0xBF881564 */
  .extern CFD2FIFOCON22SET /* 0xBF881568 */
  .extern CFD2FIFOCON22INV /* 0xBF88156C */
  .extern CFD2FIFOSTA22    /* 0xBF881570 */
  .extern CFD2FIFOSTA22CLR /* 0xBF881574 */
  .extern CFD2FIFOSTA22SET /* 0xBF881578 */
  .extern CFD2FIFOSTA22INV /* 0xBF88157C */
  .extern CFD2FIFOUA22     /* 0xBF881580 */
  .extern CFD2FIFOUA22CLR  /* 0xBF881584 */
  .extern CFD2FIFOUA22SET  /* 0xBF881588 */
  .extern CFD2FIFOUA22INV  /* 0xBF88158C */
  .extern CFD2FIFOCON23    /* 0xBF881590 */
  .extern CFD2FIFOCON23CLR /* 0xBF881594 */
  .extern CFD2FIFOCON23SET /* 0xBF881598 */
  .extern CFD2FIFOCON23INV /* 0xBF88159C */
  .extern CFD2FIFOSTA23    /* 0xBF8815A0 */
  .extern CFD2FIFOSTA23CLR /* 0xBF8815A4 */
  .extern CFD2FIFOSTA23SET /* 0xBF8815A8 */
  .extern CFD2FIFOSTA23INV /* 0xBF8815AC */
  .extern CFD2FIFOUA23     /* 0xBF8815B0 */
  .extern CFD2FIFOUA23CLR  /* 0xBF8815B4 */
  .extern CFD2FIFOUA23SET  /* 0xBF8815B8 */
  .extern CFD2FIFOUA23INV  /* 0xBF8815BC */
  .extern CFD2FIFOCON24    /* 0xBF8815C0 */
  .extern CFD2FIFOCON24CLR /* 0xBF8815C4 */
  .extern CFD2FIFOCON24SET /* 0xBF8815C8 */
  .extern CFD2FIFOCON24INV /* 0xBF8815CC */
  .extern CFD2FIFOSTA24    /* 0xBF8815D0 */
  .extern CFD2FIFOSTA24CLR /* 0xBF8815D4 */
  .extern CFD2FIFOSTA24SET /* 0xBF8815D8 */
  .extern CFD2FIFOSTA24INV /* 0xBF8815DC */
  .extern CFD2FIFOUA24     /* 0xBF8815E0 */
  .extern CFD2FIFOUA24CLR  /* 0xBF8815E4 */
  .extern CFD2FIFOUA24SET  /* 0xBF8815E8 */
  .extern CFD2FIFOUA24INV  /* 0xBF8815EC */
  .extern CFD2FIFOCON25    /* 0xBF8815F0 */
  .extern CFD2FIFOCON25CLR /* 0xBF8815F4 */
  .extern CFD2FIFOCON25SET /* 0xBF8815F8 */
  .extern CFD2FIFOCON25INV /* 0xBF8815FC */
  .extern CFD2FIFOSTA25    /* 0xBF881600 */
  .extern CFD2FIFOSTA25CLR /* 0xBF881604 */
  .extern CFD2FIFOSTA25SET /* 0xBF881608 */
  .extern CFD2FIFOSTA25INV /* 0xBF88160C */
  .extern CFD2FIFOUA25     /* 0xBF881610 */
  .extern CFD2FIFOUA25CLR  /* 0xBF881614 */
  .extern CFD2FIFOUA25SET  /* 0xBF881618 */
  .extern CFD2FIFOUA25INV  /* 0xBF88161C */
  .extern CFD2FIFOCON26    /* 0xBF881620 */
  .extern CFD2FIFOCON26CLR /* 0xBF881624 */
  .extern CFD2FIFOCON26SET /* 0xBF881628 */
  .extern CFD2FIFOCON26INV /* 0xBF88162C */
  .extern CFD2FIFOSTA26    /* 0xBF881630 */
  .extern CFD2FIFOSTA26CLR /* 0xBF881634 */
  .extern CFD2FIFOSTA26SET /* 0xBF881638 */
  .extern CFD2FIFOSTA26INV /* 0xBF88163C */
  .extern CFD2FIFOUA26     /* 0xBF881640 */
  .extern CFD2FIFOUA26CLR  /* 0xBF881644 */
  .extern CFD2FIFOUA26SET  /* 0xBF881648 */
  .extern CFD2FIFOUA26INV  /* 0xBF88164C */
  .extern CFD2FIFOCON27    /* 0xBF881650 */
  .extern CFD2FIFOCON27CLR /* 0xBF881654 */
  .extern CFD2FIFOCON27SET /* 0xBF881658 */
  .extern CFD2FIFOCON27INV /* 0xBF88165C */
  .extern CFD2FIFOSTA27    /* 0xBF881660 */
  .extern CFD2FIFOSTA27CLR /* 0xBF881664 */
  .extern CFD2FIFOSTA27SET /* 0xBF881668 */
  .extern CFD2FIFOSTA27INV /* 0xBF88166C */
  .extern CFD2FIFOUA27     /* 0xBF881670 */
  .extern CFD2FIFOUA27CLR  /* 0xBF881674 */
  .extern CFD2FIFOUA27SET  /* 0xBF881678 */
  .extern CFD2FIFOUA27INV  /* 0xBF88167C */
  .extern CFD2FIFOCON28    /* 0xBF881680 */
  .extern CFD2FIFOCON28CLR /* 0xBF881684 */
  .extern CFD2FIFOCON28SET /* 0xBF881688 */
  .extern CFD2FIFOCON28INV /* 0xBF88168C */
  .extern CFD2FIFOSTA28    /* 0xBF881690 */
  .extern CFD2FIFOSTA28CLR /* 0xBF881694 */
  .extern CFD2FIFOSTA28SET /* 0xBF881698 */
  .extern CFD2FIFOSTA28INV /* 0xBF88169C */
  .extern CFD2FIFOUA28     /* 0xBF8816A0 */
  .extern CFD2FIFOUA28CLR  /* 0xBF8816A4 */
  .extern CFD2FIFOUA28SET  /* 0xBF8816A8 */
  .extern CFD2FIFOUA28INV  /* 0xBF8816AC */
  .extern CFD2FIFOCON29    /* 0xBF8816B0 */
  .extern CFD2FIFOCON29CLR /* 0xBF8816B4 */
  .extern CFD2FIFOCON29SET /* 0xBF8816B8 */
  .extern CFD2FIFOCON29INV /* 0xBF8816BC */
  .extern CFD2FIFOSTA29    /* 0xBF8816C0 */
  .extern CFD2FIFOSTA29CLR /* 0xBF8816C4 */
  .extern CFD2FIFOSTA29SET /* 0xBF8816C8 */
  .extern CFD2FIFOSTA29INV /* 0xBF8816CC */
  .extern CFD2FIFOUA29     /* 0xBF8816D0 */
  .extern CFD2FIFOUA29CLR  /* 0xBF8816D4 */
  .extern CFD2FIFOUA29SET  /* 0xBF8816D8 */
  .extern CFD2FIFOUA29INV  /* 0xBF8816DC */
  .extern CFD2FIFOCON30    /* 0xBF8816E0 */
  .extern CFD2FIFOCON30CLR /* 0xBF8816E4 */
  .extern CFD2FIFOCON30SET /* 0xBF8816E8 */
  .extern CFD2FIFOCON30INV /* 0xBF8816EC */
  .extern CFD2FIFOSTA30    /* 0xBF8816F0 */
  .extern CFD2FIFOSTA30CLR /* 0xBF8816F4 */
  .extern CFD2FIFOSTA30SET /* 0xBF8816F8 */
  .extern CFD2FIFOSTA30INV /* 0xBF8816FC */
  .extern CFD2FIFOUA30     /* 0xBF881700 */
  .extern CFD2FIFOUA30CLR  /* 0xBF881704 */
  .extern CFD2FIFOUA30SET  /* 0xBF881708 */
  .extern CFD2FIFOUA30INV  /* 0xBF88170C */
  .extern CFD2FIFOCON31    /* 0xBF881710 */
  .extern CFD2FIFOCON31CLR /* 0xBF881714 */
  .extern CFD2FIFOCON31SET /* 0xBF881718 */
  .extern CFD2FIFOCON31INV /* 0xBF88171C */
  .extern CFD2FIFOSTA31    /* 0xBF881720 */
  .extern CFD2FIFOSTA31CLR /* 0xBF881724 */
  .extern CFD2FIFOSTA31SET /* 0xBF881728 */
  .extern CFD2FIFOSTA31INV /* 0xBF88172C */
  .extern CFD2FIFOUA31     /* 0xBF881730 */
  .extern CFD2FIFOUA31CLR  /* 0xBF881734 */
  .extern CFD2FIFOUA31SET  /* 0xBF881738 */
  .extern CFD2FIFOUA31INV  /* 0xBF88173C */
  .extern CFD2FLTCON0      /* 0xBF881740 */
  .extern CFD2FLTCON0CLR   /* 0xBF881744 */
  .extern CFD2FLTCON0SET   /* 0xBF881748 */
  .extern CFD2FLTCON0INV   /* 0xBF88174C */
  .extern CFD2FLTCON1      /* 0xBF881750 */
  .extern CFD2FLTCON1CLR   /* 0xBF881754 */
  .extern CFD2FLTCON1SET   /* 0xBF881758 */
  .extern CFD2FLTCON1INV   /* 0xBF88175C */
  .extern CFD2FLTCON2      /* 0xBF881760 */
  .extern CFD2FLTCON2CLR   /* 0xBF881764 */
  .extern CFD2FLTCON2SET   /* 0xBF881768 */
  .extern CFD2FLTCON2INV   /* 0xBF88176C */
  .extern CFD2FLTCON3      /* 0xBF881770 */
  .extern CFD2FLTCON3CLR   /* 0xBF881774 */
  .extern CFD2FLTCON3SET   /* 0xBF881778 */
  .extern CFD2FLTCON3INV   /* 0xBF88177C */
  .extern CFD2FLTCON4      /* 0xBF881780 */
  .extern CFD2FLTCON4CLR   /* 0xBF881784 */
  .extern CFD2FLTCON4SET   /* 0xBF881788 */
  .extern CFD2FLTCON4INV   /* 0xBF88178C */
  .extern CFD2FLTCON5      /* 0xBF881790 */
  .extern CFD2FLTCON5CLR   /* 0xBF881794 */
  .extern CFD2FLTCON5SET   /* 0xBF881798 */
  .extern CFD2FLTCON5INV   /* 0xBF88179C */
  .extern CFD2FLTCON6      /* 0xBF8817A0 */
  .extern CFD2FLTCON6CLR   /* 0xBF8817A4 */
  .extern CFD2FLTCON6SET   /* 0xBF8817A8 */
  .extern CFD2FLTCON6INV   /* 0xBF8817AC */
  .extern CFD2FLTCON7      /* 0xBF8817B0 */
  .extern CFD2FLTCON7CLR   /* 0xBF8817B4 */
  .extern CFD2FLTCON7SET   /* 0xBF8817B8 */
  .extern CFD2FLTCON7INV   /* 0xBF8817BC */
  .extern CFD2FLTOBJ0      /* 0xBF8817C0 */
  .extern CFD2FLTOBJ0CLR   /* 0xBF8817C4 */
  .extern CFD2FLTOBJ0SET   /* 0xBF8817C8 */
  .extern CFD2FLTOBJ0INV   /* 0xBF8817CC */
  .extern CFD2MASK0        /* 0xBF8817D0 */
  .extern CFD2MASK0CLR     /* 0xBF8817D4 */
  .extern CFD2MASK0SET     /* 0xBF8817D8 */
  .extern CFD2MASK0INV     /* 0xBF8817DC */
  .extern CFD2FLTOBJ1      /* 0xBF8817E0 */
  .extern CFD2FLTOBJ1CLR   /* 0xBF8817E4 */
  .extern CFD2FLTOBJ1SET   /* 0xBF8817E8 */
  .extern CFD2FLTOBJ1INV   /* 0xBF8817EC */
