Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
  .extern CFD4FLTOBJ18SET  /* 0xBF885A08 */
  .extern CFD4FLTOBJ18INV  /* 0xBF885A0C */
  .extern CFD4MASK18       /* 0xBF885A10 */
  .extern CFD4MASK18CLR    /* 0xBF885A14 */
  .extern CFD4MASK18SET    /* 0xBF885A18 */
  .extern CFD4MASK18INV    /* 0xBF885A1C */
  .extern CFD4FLTOBJ19     /* 0xBF885A20 */
  .extern CFD4FLTOBJ19CLR  /* 0xBF885A24 */
  .extern CFD4FLTOBJ19SET  /* 0xBF885A28 */
  .extern CFD4FLTOBJ19INV  /* 0xBF885A2C */
  .extern CFD4MASK19       /* 0xBF885A30 */
  .extern CFD4MASK19CLR    /* 0xBF885A34 */
  .extern CFD4MASK19SET    /* 0xBF885A38 */
  .extern CFD4MASK19INV    /* 0xBF885A3C */
  .extern CFD4FLTOBJ20     /* 0xBF885A40 */
  .extern CFD4FLTOBJ20CLR  /* 0xBF885A44 */
  .extern CFD4FLTOBJ20SET  /* 0xBF885A48 */
  .extern CFD4FLTOBJ20INV  /* 0xBF885A4C */
  .extern CFD4MASK20       /* 0xBF885A50 */
  .extern CFD4MASK20CLR    /* 0xBF885A54 */
  .extern CFD4MASK20SET    /* 0xBF885A58 */
  .extern CFD4MASK20INV    /* 0xBF885A5C */
  .extern CFD4FLTOBJ21     /* 0xBF885A60 */
  .extern CFD4FLTOBJ21CLR  /* 0xBF885A64 */
  .extern CFD4FLTOBJ21SET  /* 0xBF885A68 */
  .extern CFD4FLTOBJ21INV  /* 0xBF885A6C */
  .extern CFD4MASK21       /* 0xBF885A70 */
  .extern CFD4MASK21CLR    /* 0xBF885A74 */
  .extern CFD4MASK21SET    /* 0xBF885A78 */
  .extern CFD4MASK21INV    /* 0xBF885A7C */
  .extern CFD4FLTOBJ22     /* 0xBF885A80 */
  .extern CFD4FLTOBJ22CLR  /* 0xBF885A84 */
  .extern CFD4FLTOBJ22SET  /* 0xBF885A88 */
  .extern CFD4FLTOBJ22INV  /* 0xBF885A8C */
  .extern CFD4MASK22       /* 0xBF885A90 */
  .extern CFD4MASK22CLR    /* 0xBF885A94 */
  .extern CFD4MASK22SET    /* 0xBF885A98 */
  .extern CFD4MASK22INV    /* 0xBF885A9C */
  .extern CFD4FLTOBJ23     /* 0xBF885AA0 */
  .extern CFD4FLTOBJ23CLR  /* 0xBF885AA4 */
  .extern CFD4FLTOBJ23SET  /* 0xBF885AA8 */
  .extern CFD4FLTOBJ23INV  /* 0xBF885AAC */
  .extern CFD4MASK23       /* 0xBF885AB0 */
  .extern CFD4MASK23CLR    /* 0xBF885AB4 */
  .extern CFD4MASK23SET    /* 0xBF885AB8 */
  .extern CFD4MASK23INV    /* 0xBF885ABC */
  .extern CFD4FLTOBJ24     /* 0xBF885AC0 */
  .extern CFD4FLTOBJ24CLR  /* 0xBF885AC4 */
  .extern CFD4FLTOBJ24SET  /* 0xBF885AC8 */
  .extern CFD4FLTOBJ24INV  /* 0xBF885ACC */
  .extern CFD4MASK24       /* 0xBF885AD0 */
  .extern CFD4MASK24CLR    /* 0xBF885AD4 */
  .extern CFD4MASK24SET    /* 0xBF885AD8 */
  .extern CFD4MASK24INV    /* 0xBF885ADC */
  .extern CFD4FLTOBJ25     /* 0xBF885AE0 */
  .extern CFD4FLTOBJ25CLR  /* 0xBF885AE4 */
  .extern CFD4FLTOBJ25SET  /* 0xBF885AE8 */
  .extern CFD4FLTOBJ25INV  /* 0xBF885AEC */
  .extern CFD4MASK25       /* 0xBF885AF0 */
  .extern CFD4MASK25CLR    /* 0xBF885AF4 */
  .extern CFD4MASK25SET    /* 0xBF885AF8 */
  .extern CFD4MASK25INV    /* 0xBF885AFC */
  .extern CFD4FLTOBJ26     /* 0xBF885B00 */
  .extern CFD4FLTOBJ26CLR  /* 0xBF885B04 */
  .extern CFD4FLTOBJ26SET  /* 0xBF885B08 */
  .extern CFD4FLTOBJ26INV  /* 0xBF885B0C */
  .extern CFD4MASK26       /* 0xBF885B10 */
  .extern CFD4MASK26CLR    /* 0xBF885B14 */
  .extern CFD4MASK26SET    /* 0xBF885B18 */
  .extern CFD4MASK26INV    /* 0xBF885B1C */
  .extern CFD4FLTOBJ27     /* 0xBF885B20 */
  .extern CFD4FLTOBJ27CLR  /* 0xBF885B24 */
  .extern CFD4FLTOBJ27SET  /* 0xBF885B28 */
  .extern CFD4FLTOBJ27INV  /* 0xBF885B2C */
  .extern CFD4MASK27       /* 0xBF885B30 */
  .extern CFD4MASK27CLR    /* 0xBF885B34 */
  .extern CFD4MASK27SET    /* 0xBF885B38 */
  .extern CFD4MASK27INV    /* 0xBF885B3C */
  .extern CFD4FLTOBJ28     /* 0xBF885B40 */
  .extern CFD4FLTOBJ28CLR  /* 0xBF885B44 */
  .extern CFD4FLTOBJ28SET  /* 0xBF885B48 */
  .extern CFD4FLTOBJ28INV  /* 0xBF885B4C */
  .extern CFD4MASK28       /* 0xBF885B50 */
  .extern CFD4MASK28CLR    /* 0xBF885B54 */
  .extern CFD4MASK28SET    /* 0xBF885B58 */
  .extern CFD4MASK28INV    /* 0xBF885B5C */
  .extern CFD4FLTOBJ29     /* 0xBF885B60 */
  .extern CFD4FLTOBJ29CLR  /* 0xBF885B64 */
  .extern CFD4FLTOBJ29SET  /* 0xBF885B68 */
  .extern CFD4FLTOBJ29INV  /* 0xBF885B6C */
  .extern CFD4MASK29       /* 0xBF885B70 */
  .extern CFD4MASK29CLR    /* 0xBF885B74 */
  .extern CFD4MASK29SET    /* 0xBF885B78 */
  .extern CFD4MASK29INV    /* 0xBF885B7C */
  .extern CFD4FLTOBJ30     /* 0xBF885B80 */
  .extern CFD4FLTOBJ30CLR  /* 0xBF885B84 */
  .extern CFD4FLTOBJ30SET  /* 0xBF885B88 */
  .extern CFD4FLTOBJ30INV  /* 0xBF885B8C */
  .extern CFD4MASK30       /* 0xBF885B90 */
  .extern CFD4MASK30CLR    /* 0xBF885B94 */
  .extern CFD4MASK30SET    /* 0xBF885B98 */
  .extern CFD4MASK30INV    /* 0xBF885B9C */
  .extern CFD4FLTOBJ31     /* 0xBF885BA0 */
  .extern CFD4FLTOBJ31CLR  /* 0xBF885BA4 */
  .extern CFD4FLTOBJ31SET  /* 0xBF885BA8 */
  .extern CFD4FLTOBJ31INV  /* 0xBF885BAC */
  .extern CFD4MASK31       /* 0xBF885BB0 */
  .extern CFD4MASK31CLR    /* 0xBF885BB4 */
  .extern CFD4MASK31SET    /* 0xBF885BB8 */
  .extern CFD4MASK31INV    /* 0xBF885BBC */
  .extern ADCCON1          /* 0xBF887000 */
  .extern ADCCON1CLR       /* 0xBF887004 */
  .extern ADCCON1SET       /* 0xBF887008 */
  .extern ADCCON1INV       /* 0xBF88700C */
  .extern ADCCON2          /* 0xBF887010 */
  .extern ADCCON2CLR       /* 0xBF887014 */
  .extern ADCCON2SET       /* 0xBF887018 */
  .extern ADCCON2INV       /* 0xBF88701C */
  .extern ADCCON3          /* 0xBF887020 */
  .extern ADCCON3CLR       /* 0xBF887024 */
  .extern ADCCON3SET       /* 0xBF887028 */
  .extern ADCCON3INV       /* 0xBF88702C */
  .extern ADCTRGMODE       /* 0xBF887030 */
  .extern ADCTRGMODECLR    /* 0xBF887034 */
  .extern ADCTRGMODESET    /* 0xBF887038 */
  .extern ADCTRGMODEINV    /* 0xBF88703C */
  .extern ADCIMCON1        /* 0xBF887040 */
  .extern ADCIMCON1CLR     /* 0xBF887044 */
  .extern ADCIMCON1SET     /* 0xBF887048 */
  .extern ADCIMCON1INV     /* 0xBF88704C */
  .extern ADCIMCON2        /* 0xBF887050 */
  .extern ADCIMCON2CLR     /* 0xBF887054 */
  .extern ADCIMCON2SET     /* 0xBF887058 */
  .extern ADCIMCON2INV     /* 0xBF88705C */
  .extern ADCIMCON3        /* 0xBF887060 */
  .extern ADCIMCON3CLR     /* 0xBF887064 */
  .extern ADCIMCON3SET     /* 0xBF887068 */
  .extern ADCIMCON3INV     /* 0xBF88706C */
  .extern ADCIMCON4        /* 0xBF887070 */
  .extern ADCIMCON4CLR     /* 0xBF887074 */
  .extern ADCIMCON4SET     /* 0xBF887078 */
  .extern ADCIMCON4INV     /* 0xBF88707C */
  .extern ADCGIRQEN1       /* 0xBF887080 */
  .extern ADCGIRQEN1CLR    /* 0xBF887084 */
  .extern ADCGIRQEN1SET    /* 0xBF887088 */
  .extern ADCGIRQEN1INV    /* 0xBF88708C */
  .extern ADCGIRQEN2       /* 0xBF887090 */
  .extern ADCGIRQEN2CLR    /* 0xBF887094 */
  .extern ADCGIRQEN2SET    /* 0xBF887098 */
  .extern ADCGIRQEN2INV    /* 0xBF88709C */
  .extern ADCCSS1          /* 0xBF8870A0 */
  .extern ADCCSS1CLR       /* 0xBF8870A4 */
  .extern ADCCSS1SET       /* 0xBF8870A8 */
  .extern ADCCSS1INV       /* 0xBF8870AC */
  .extern ADCCSS2          /* 0xBF8870B0 */
  .extern ADCCSS2CLR       /* 0xBF8870B4 */
  .extern ADCCSS2SET       /* 0xBF8870B8 */
  .extern ADCCSS2INV       /* 0xBF8870BC */
  .extern ADCDSTAT1        /* 0xBF8870C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8870C4 */
  .extern ADCDSTAT1SET     /* 0xBF8870C8 */
  .extern ADCDSTAT1INV     /* 0xBF8870CC */
  .extern ADCDSTAT2        /* 0xBF8870D0 */
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
  .extern ADCCMP4CLR       /* 0xBF887154 */
  .extern ADCCMP4SET       /* 0xBF887158 */
  .extern ADCCMP4INV       /* 0xBF88715C */
  .extern ADCFLTR1         /* 0xBF8871A0 */
  .extern ADCFLTR1CLR      /* 0xBF8871A4 */
  .extern ADCFLTR1SET      /* 0xBF8871A8 */
  .extern ADCFLTR1INV      /* 0xBF8871AC */
  .extern ADCFLTR2         /* 0xBF8871B0 */
  .extern ADCFLTR2CLR      /* 0xBF8871B4 */
  .extern ADCFLTR2SET      /* 0xBF8871B8 */
  .extern ADCFLTR2INV      /* 0xBF8871BC */
  .extern ADCFLTR3         /* 0xBF8871C0 */
  .extern ADCFLTR3CLR      /* 0xBF8871C4 */
  .extern ADCFLTR3SET      /* 0xBF8871C8 */
  .extern ADCFLTR3INV      /* 0xBF8871CC */
  .extern ADCFLTR4         /* 0xBF8871D0 */
  .extern ADCFLTR4CLR      /* 0xBF8871D4 */
  .extern ADCFLTR4SET      /* 0xBF8871D8 */
  .extern ADCFLTR4INV      /* 0xBF8871DC */
  .extern ADCTRG1          /* 0xBF887200 */
  .extern ADCTRG1CLR       /* 0xBF887204 */
  .extern ADCTRG1SET       /* 0xBF887208 */
  .extern ADCTRG1INV       /* 0xBF88720C */
  .extern ADCTRG2          /* 0xBF887210 */
  .extern ADCTRG2CLR       /* 0xBF887214 */
  .extern ADCTRG2SET       /* 0xBF887218 */
  .extern ADCTRG2INV       /* 0xBF88721C */
  .extern ADCTRG3          /* 0xBF887220 */
  .extern ADCTRG3CLR       /* 0xBF887224 */
  .extern ADCTRG3SET       /* 0xBF887228 */
  .extern ADCTRG3INV       /* 0xBF88722C */
  .extern ADCTRG4          /* 0xBF887230 */
  .extern ADCTRG4CLR       /* 0xBF887234 */
  .extern ADCTRG4SET       /* 0xBF887238 */
  .extern ADCTRG4INV       /* 0xBF88723C */
  .extern ADCTRG5          /* 0xBF887240 */
  .extern ADCTRG5CLR       /* 0xBF887244 */
  .extern ADCTRG5SET       /* 0xBF887248 */
  .extern ADCTRG5INV       /* 0xBF88724C */
  .extern ADCTRG7          /* 0xBF887260 */
  .extern ADCTRG7CLR       /* 0xBF887264 */
  .extern ADCTRG7SET       /* 0xBF887268 */
  .extern ADCTRG7INV       /* 0xBF88726C */
  .extern ADCCMPCON1       /* 0xBF887280 */
  .extern ADCCMPCON1CLR    /* 0xBF887284 */
  .extern ADCCMPCON1SET    /* 0xBF887288 */
  .extern ADCCMPCON1INV    /* 0xBF88728C */
  .extern ADCCMPCON2       /* 0xBF887290 */
  .extern ADCCMPCON2CLR    /* 0xBF887294 */
  .extern ADCCMPCON2SET    /* 0xBF887298 */
  .extern ADCCMPCON2INV    /* 0xBF88729C */
  .extern ADCCMPCON3       /* 0xBF8872A0 */
  .extern ADCCMPCON3CLR    /* 0xBF8872A4 */
  .extern ADCCMPCON3SET    /* 0xBF8872A8 */
  .extern ADCCMPCON3INV    /* 0xBF8872AC */
  .extern ADCCMPCON4       /* 0xBF8872B0 */
  .extern ADCCMPCON4CLR    /* 0xBF8872B4 */
  .extern ADCCMPCON4SET    /* 0xBF8872B8 */
  .extern ADCCMPCON4INV    /* 0xBF8872BC */
  .extern ADCBASE          /* 0xBF887300 */
  .extern ADCBASECLR       /* 0xBF887304 */
  .extern ADCBASESET       /* 0xBF887308 */
  .extern ADCBASEINV       /* 0xBF88730C */
  .extern ADCDSTAT         /* 0xBF887310 */
  .extern ADCDSTATCLR      /* 0xBF887314 */
  .extern ADCDSTATSET      /* 0xBF887318 */
  .extern ADCDSTATINV      /* 0xBF88731C */
  .extern ADCCNTB          /* 0xBF887320 */
  .extern ADCCNTBCLR       /* 0xBF887324 */
  .extern ADCCNTBSET       /* 0xBF887328 */
  .extern ADCCNTBINV       /* 0xBF88732C */
  .extern ADCDMAB          /* 0xBF887330 */
  .extern ADCDMABCLR       /* 0xBF887334 */
  .extern ADCDMABSET       /* 0xBF887338 */
  .extern ADCDMABINV       /* 0xBF88733C */
  .extern ADCTRGSNS        /* 0xBF887340 */
  .extern ADCTRGSNSCLR     /* 0xBF887344 */
  .extern ADCTRGSNSSET     /* 0xBF887348 */
  .extern ADCTRGSNSINV     /* 0xBF88734C */
  .extern ADC0TIME         /* 0xBF887350 */
  .extern ADC0TIMECLR      /* 0xBF887354 */
  .extern ADC0TIMESET      /* 0xBF887358 */
  .extern ADC0TIMEINV      /* 0xBF88735C */
  .extern ADC1TIME         /* 0xBF887360 */
  .extern ADC1TIMECLR      /* 0xBF887364 */
  .extern ADC1TIMESET      /* 0xBF887368 */
  .extern ADC1TIMEINV      /* 0xBF88736C */
  .extern ADC2TIME         /* 0xBF887370 */
  .extern ADC2TIMECLR      /* 0xBF887374 */
  .extern ADC2TIMESET      /* 0xBF887378 */
  .extern ADC2TIMEINV      /* 0xBF88737C */
  .extern ADC3TIME         /* 0xBF887380 */
  .extern ADC3TIMECLR      /* 0xBF887384 */
  .extern ADC3TIMESET      /* 0xBF887388 */
  .extern ADC3TIMEINV      /* 0xBF88738C */
  .extern ADC4TIME         /* 0xBF887390 */
  .extern ADC4TIMECLR      /* 0xBF887394 */
  .extern ADC4TIMESET      /* 0xBF887398 */
  .extern ADC4TIMEINV      /* 0xBF88739C */
  .extern ADC5TIME         /* 0xBF8873A0 */
  .extern ADC5TIMECLR      /* 0xBF8873A4 */
  .extern ADC5TIMESET      /* 0xBF8873A8 */
  .extern ADC5TIMEINV      /* 0xBF8873AC */
  .extern ADCEIEN1         /* 0xBF8873C0 */
  .extern ADCEIEN1CLR      /* 0xBF8873C4 */
  .extern ADCEIEN1SET      /* 0xBF8873C8 */
  .extern ADCEIEN1INV      /* 0xBF8873CC */
  .extern ADCEIEN2         /* 0xBF8873D0 */
  .extern ADCEIEN2CLR      /* 0xBF8873D4 */
  .extern ADCEIEN2SET      /* 0xBF8873D8 */
  .extern ADCEIEN2INV      /* 0xBF8873DC */
  .extern ADCEISTAT1       /* 0xBF8873E0 */
  .extern ADCEISTAT1CLR    /* 0xBF8873E4 */
  .extern ADCEISTAT1SET    /* 0xBF8873E8 */
  .extern ADCEISTAT1INV    /* 0xBF8873EC */
  .extern ADCEISTAT2       /* 0xBF8873F0 */
  .extern ADCEISTAT2CLR    /* 0xBF8873F4 */
  .extern ADCEISTAT2SET    /* 0xBF8873F8 */
  .extern ADCEISTAT2INV    /* 0xBF8873FC */
  .extern ADCANCON         /* 0xBF887400 */
  .extern ADCANCONCLR      /* 0xBF887404 */
  .extern ADCANCONSET      /* 0xBF887408 */
  .extern ADCANCONINV      /* 0xBF88740C */
  .extern ADCDATA0         /* 0xBF887600 */
  .extern ADCDATA0CLR      /* 0xBF887604 */
  .extern ADCDATA0SET      /* 0xBF887608 */
  .extern ADCDATA0INV      /* 0xBF88760C */
  .extern ADCDATA1         /* 0xBF887610 */
  .extern ADCDATA1CLR      /* 0xBF887614 */
  .extern ADCDATA1SET      /* 0xBF887618 */
  .extern ADCDATA1INV      /* 0xBF88761C */
  .extern ADCDATA2         /* 0xBF887620 */
  .extern ADCDATA2CLR      /* 0xBF887624 */
  .extern ADCDATA2SET      /* 0xBF887628 */
  .extern ADCDATA2INV      /* 0xBF88762C */
  .extern ADCDATA3         /* 0xBF887630 */
  .extern ADCDATA3CLR      /* 0xBF887634 */
  .extern ADCDATA3SET      /* 0xBF887638 */
  .extern ADCDATA3INV      /* 0xBF88763C */
  .extern ADCDATA4         /* 0xBF887640 */
  .extern ADCDATA4CLR      /* 0xBF887644 */
  .extern ADCDATA4SET      /* 0xBF887648 */
  .extern ADCDATA4INV      /* 0xBF88764C */
  .extern ADCDATA5         /* 0xBF887650 */
  .extern ADCDATA5CLR      /* 0xBF887654 */
  .extern ADCDATA5SET      /* 0xBF887658 */
  .extern ADCDATA5INV      /* 0xBF88765C */
  .extern ADCDATA6         /* 0xBF887660 */
  .extern ADCDATA6CLR      /* 0xBF887664 */
  .extern ADCDATA6SET      /* 0xBF887668 */
  .extern ADCDATA6INV      /* 0xBF88766C */
  .extern ADCDATA7         /* 0xBF887670 */
  .extern ADCDATA7CLR      /* 0xBF887674 */
  .extern ADCDATA7SET      /* 0xBF887678 */
  .extern ADCDATA7INV      /* 0xBF88767C */
  .extern ADCDATA8         /* 0xBF887680 */
  .extern ADCDATA8CLR      /* 0xBF887684 */
  .extern ADCDATA8SET      /* 0xBF887688 */
  .extern ADCDATA8INV      /* 0xBF88768C */
  .extern ADCDATA9         /* 0xBF887690 */
  .extern ADCDATA9CLR      /* 0xBF887694 */
  .extern ADCDATA9SET      /* 0xBF887698 */
  .extern ADCDATA9INV      /* 0xBF88769C */
  .extern ADCDATA10        /* 0xBF8876A0 */
  .extern ADCDATA10CLR     /* 0xBF8876A4 */
  .extern ADCDATA10SET     /* 0xBF8876A8 */
  .extern ADCDATA10INV     /* 0xBF8876AC */
  .extern ADCDATA11        /* 0xBF8876B0 */
  .extern ADCDATA11CLR     /* 0xBF8876B4 */
  .extern ADCDATA11SET     /* 0xBF8876B8 */
  .extern ADCDATA11INV     /* 0xBF8876BC */
  .extern ADCDATA12        /* 0xBF8876C0 */
  .extern ADCDATA12CLR     /* 0xBF8876C4 */
  .extern ADCDATA12SET     /* 0xBF8876C8 */
  .extern ADCDATA12INV     /* 0xBF8876CC */
  .extern ADCDATA13        /* 0xBF8876D0 */
  .extern ADCDATA13CLR     /* 0xBF8876D4 */
  .extern ADCDATA13SET     /* 0xBF8876D8 */
  .extern ADCDATA13INV     /* 0xBF8876DC */
  .extern ADCDATA14        /* 0xBF8876E0 */
  .extern ADCDATA14CLR     /* 0xBF8876E4 */
  .extern ADCDATA14SET     /* 0xBF8876E8 */
  .extern ADCDATA14INV     /* 0xBF8876EC */
  .extern ADCDATA15        /* 0xBF8876F0 */
  .extern ADCDATA15CLR     /* 0xBF8876F4 */
  .extern ADCDATA15SET     /* 0xBF8876F8 */
  .extern ADCDATA15INV     /* 0xBF8876FC */
  .extern ADCDATA16        /* 0xBF887700 */
  .extern ADCDATA16CLR     /* 0xBF887704 */
  .extern ADCDATA16SET     /* 0xBF887708 */
  .extern ADCDATA16INV     /* 0xBF88770C */
  .extern ADCDATA17        /* 0xBF887710 */
  .extern ADCDATA17CLR     /* 0xBF887714 */
  .extern ADCDATA17SET     /* 0xBF887718 */
  .extern ADCDATA17INV     /* 0xBF88771C */
  .extern ADCDATA18        /* 0xBF887720 */
  .extern ADCDATA18CLR     /* 0xBF887724 */
  .extern ADCDATA18SET     /* 0xBF887728 */
  .extern ADCDATA18INV     /* 0xBF88772C */
  .extern ADCDATA19        /* 0xBF887730 */
  .extern ADCDATA19CLR     /* 0xBF887734 */
  .extern ADCDATA19SET     /* 0xBF887738 */
  .extern ADCDATA19INV     /* 0xBF88773C */
  .extern ADCDATA24        /* 0xBF887780 */
  .extern ADCDATA24CLR     /* 0xBF887784 */
  .extern ADCDATA24SET     /* 0xBF887788 */
  .extern ADCDATA24INV     /* 0xBF88778C */
  .extern ADCDATA25        /* 0xBF887790 */
  .extern ADCDATA25CLR     /* 0xBF887794 */
  .extern ADCDATA25SET     /* 0xBF887798 */
  .extern ADCDATA25INV     /* 0xBF88779C */
  .extern ADCDATA26        /* 0xBF8877A0 */
  .extern ADCDATA26CLR     /* 0xBF8877A4 */
  .extern ADCDATA26SET     /* 0xBF8877A8 */
  .extern ADCDATA26INV     /* 0xBF8877AC */
  .extern ADCDATA27        /* 0xBF8877B0 */
  .extern ADCDATA27CLR     /* 0xBF8877B4 */
  .extern ADCDATA27SET     /* 0xBF8877B8 */
  .extern ADCDATA27INV     /* 0xBF8877BC */
  .extern ADCDATA48        /* 0xBF887900 */
  .extern ADCDATA48CLR     /* 0xBF887904 */
  .extern ADCDATA48SET     /* 0xBF887908 */
  .extern ADCDATA48INV     /* 0xBF88790C */
  .extern ADCDATA49        /* 0xBF887910 */
  .extern ADCDATA49CLR     /* 0xBF887914 */
  .extern ADCDATA49SET     /* 0xBF887918 */
  .extern ADCDATA49INV     /* 0xBF88791C */
  .extern ADCDATA50        /* 0xBF887920 */
  .extern ADCDATA50CLR     /* 0xBF887924 */
  .extern ADCDATA50SET     /* 0xBF887928 */
  .extern ADCDATA50INV     /* 0xBF88792C */
  .extern ADCDATA51        /* 0xBF887930 */
  .extern ADCDATA51CLR     /* 0xBF887934 */
  .extern ADCDATA51SET     /* 0xBF887938 */
  .extern ADCDATA51INV     /* 0xBF88793C */
  .extern ADCDATA52        /* 0xBF887940 */
  .extern ADCDATA52CLR     /* 0xBF887944 */
  .extern ADCDATA52SET     /* 0xBF887948 */
  .extern ADCDATA52INV     /* 0xBF88794C */
  .extern ADCDATA53        /* 0xBF887950 */
  .extern ADCDATA53CLR     /* 0xBF887954 */
  .extern ADCDATA53SET     /* 0xBF887958 */
  .extern ADCDATA53INV     /* 0xBF88795C */
  .extern ADC0CFG          /* 0xBF887D00 */
  .extern ADC0CFGCLR       /* 0xBF887D04 */
  .extern ADC0CFGSET       /* 0xBF887D08 */
  .extern ADC0CFGINV       /* 0xBF887D0C */
  .extern ADC1CFG          /* 0xBF887D10 */
  .extern ADC1CFGCLR       /* 0xBF887D14 */
  .extern ADC1CFGSET       /* 0xBF887D18 */
  .extern ADC1CFGINV       /* 0xBF887D1C */
  .extern ADC2CFG          /* 0xBF887D20 */
  .extern ADC2CFGCLR       /* 0xBF887D24 */
  .extern ADC2CFGSET       /* 0xBF887D28 */
  .extern ADC2CFGINV       /* 0xBF887D2C */
  .extern ADC3CFG          /* 0xBF887D30 */
  .extern ADC3CFGCLR       /* 0xBF887D34 */
  .extern ADC3CFGSET       /* 0xBF887D38 */
  .extern ADC3CFGINV       /* 0xBF887D3C */
  .extern ADC4CFG          /* 0xBF887D40 */
  .extern ADC4CFGCLR       /* 0xBF887D44 */
  .extern ADC4CFGSET       /* 0xBF887D48 */
  .extern ADC4CFGINV       /* 0xBF887D4C */
  .extern ADC5CFG          /* 0xBF887D50 */
  .extern ADC5CFGCLR       /* 0xBF887D54 */
  .extern ADC5CFGSET       /* 0xBF887D58 */
  .extern ADC5CFGINV       /* 0xBF887D5C */
  .extern ADC6CFG          /* 0xBF887D60 */
  .extern ADC6CFGCLR       /* 0xBF887D64 */
  .extern ADC6CFGSET       /* 0xBF887D68 */
  .extern ADC6CFGINV       /* 0xBF887D6C */
  .extern ADC7CFG          /* 0xBF887D70 */
  .extern ADC7CFGCLR       /* 0xBF887D74 */
  .extern ADC7CFGSET       /* 0xBF887D78 */
  .extern ADC7CFGINV       /* 0xBF887D7C */
  .extern ADCSYSCFG0       /* 0xBF887E00 */
  .extern ADCSYSCFG0CLR    /* 0xBF887E04 */
  .extern ADCSYSCFG0SET    /* 0xBF887E08 */
  .extern ADCSYSCFG0INV    /* 0xBF887E0C */
  .extern ADCSYSCFG1       /* 0xBF887E10 */
  .extern ADCSYSCFG1CLR    /* 0xBF887E14 */
  .extern ADCSYSCFG1SET    /* 0xBF887E18 */
  .extern ADCSYSCFG1INV    /* 0xBF887E1C */
  .extern U1OTGIR          /* 0xBF889040 */
  .extern U1OTGIRCLR       /* 0xBF889044 */
  .extern U1OTGIE          /* 0xBF889050 */
  .extern U1OTGIECLR       /* 0xBF889054 */
  .extern U1OTGIESET       /* 0xBF889058 */
  .extern U1OTGIEINV       /* 0xBF88905C */
  .extern U1OTGSTAT        /* 0xBF889060 */
  .extern U1OTGCON         /* 0xBF889070 */
  .extern U1OTGCONCLR      /* 0xBF889074 */
  .extern U1OTGCONSET      /* 0xBF889078 */
  .extern U1OTGCONINV      /* 0xBF88907C */
  .extern U1PWRC           /* 0xBF889080 */
  .extern U1PWRCCLR        /* 0xBF889084 */
  .extern U1PWRCSET        /* 0xBF889088 */
  .extern U1PWRCINV        /* 0xBF88908C */
  .extern U1IR             /* 0xBF889200 */
  .extern U1IRCLR          /* 0xBF889204 */
  .extern U1IE             /* 0xBF889210 */
  .extern U1IECLR          /* 0xBF889214 */
  .extern U1IESET          /* 0xBF889218 */
  .extern U1IEINV          /* 0xBF88921C */
  .extern U1EIR            /* 0xBF889220 */
  .extern U1EIRCLR         /* 0xBF889224 */
  .extern U1EIE            /* 0xBF889230 */
  .extern U1EIECLR         /* 0xBF889234 */
  .extern U1EIESET         /* 0xBF889238 */
  .extern U1EIEINV         /* 0xBF88923C */
  .extern U1STAT           /* 0xBF889240 */
  .extern U1CON            /* 0xBF889250 */
  .extern U1CONCLR         /* 0xBF889254 */
  .extern U1CONSET         /* 0xBF889258 */
  .extern U1CONINV         /* 0xBF88925C */
  .extern U1ADDR           /* 0xBF889260 */
  .extern U1ADDRCLR        /* 0xBF889264 */
  .extern U1ADDRSET        /* 0xBF889268 */
  .extern U1ADDRINV        /* 0xBF88926C */
  .extern U1BDTP1          /* 0xBF889270 */
  .extern U1BDTP1CLR       /* 0xBF889274 */
  .extern U1BDTP1SET       /* 0xBF889278 */
  .extern U1BDTP1INV       /* 0xBF88927C */
  .extern U1FRML           /* 0xBF889280 */
  .extern U1FRMH           /* 0xBF889290 */
  .extern U1TOK            /* 0xBF8892A0 */
  .extern U1TOKCLR         /* 0xBF8892A4 */
  .extern U1TOKSET         /* 0xBF8892A8 */
  .extern U1TOKINV         /* 0xBF8892AC */
  .extern U1SOF            /* 0xBF8892B0 */
  .extern U1SOFCLR         /* 0xBF8892B4 */
  .extern U1SOFSET         /* 0xBF8892B8 */
  .extern U1SOFINV         /* 0xBF8892BC */
  .extern U1BDTP2          /* 0xBF8892C0 */
  .extern U1BDTP2CLR       /* 0xBF8892C4 */
  .extern U1BDTP2SET       /* 0xBF8892C8 */
  .extern U1BDTP2INV       /* 0xBF8892CC */
  .extern U1BDTP3          /* 0xBF8892D0 */
  .extern U1BDTP3CLR       /* 0xBF8892D4 */
  .extern U1BDTP3SET       /* 0xBF8892D8 */
  .extern U1BDTP3INV       /* 0xBF8892DC */
  .extern U1CNFG1          /* 0xBF8892E0 */
  .extern U1CNFG1CLR       /* 0xBF8892E4 */
  .extern U1CNFG1SET       /* 0xBF8892E8 */
  .extern U1CNFG1INV       /* 0xBF8892EC */
  .extern U1EP0            /* 0xBF889300 */
  .extern U1EP0CLR         /* 0xBF889304 */
  .extern U1EP0SET         /* 0xBF889308 */
  .extern U1EP0INV         /* 0xBF88930C */
  .extern U1EP1            /* 0xBF889310 */
