Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _IPC26_AD1D0IS_POSITION                  0x00000010
#define _IPC26_AD1D0IS_MASK                      0x00030000
#define _IPC26_AD1D0IS_LENGTH                    0x00000002

#define _IPC26_AD1D0IP_POSITION                  0x00000012
#define _IPC26_AD1D0IP_MASK                      0x001C0000
#define _IPC26_AD1D0IP_LENGTH                    0x00000003

#define _IPC26_AD1D1IS_POSITION                  0x00000018
#define _IPC26_AD1D1IS_MASK                      0x03000000
#define _IPC26_AD1D1IS_LENGTH                    0x00000002

#define _IPC26_AD1D1IP_POSITION                  0x0000001A
#define _IPC26_AD1D1IP_MASK                      0x1C000000
#define _IPC26_AD1D1IP_LENGTH                    0x00000003

#define _IPC26_w_POSITION                        0x00000000
#define _IPC26_w_MASK                            0xFFFFFFFF
#define _IPC26_w_LENGTH                          0x00000020

#define _IPC27_AD1D2IS_POSITION                  0x00000000
#define _IPC27_AD1D2IS_MASK                      0x00000003
#define _IPC27_AD1D2IS_LENGTH                    0x00000002

#define _IPC27_AD1D2IP_POSITION                  0x00000002
#define _IPC27_AD1D2IP_MASK                      0x0000001C
#define _IPC27_AD1D2IP_LENGTH                    0x00000003

#define _IPC27_AD1D3IS_POSITION                  0x00000008
#define _IPC27_AD1D3IS_MASK                      0x00000300
#define _IPC27_AD1D3IS_LENGTH                    0x00000002

#define _IPC27_AD1D3IP_POSITION                  0x0000000A
#define _IPC27_AD1D3IP_MASK                      0x00001C00
#define _IPC27_AD1D3IP_LENGTH                    0x00000003

#define _IPC27_AD1D4IS_POSITION                  0x00000010
#define _IPC27_AD1D4IS_MASK                      0x00030000
#define _IPC27_AD1D4IS_LENGTH                    0x00000002

#define _IPC27_AD1D4IP_POSITION                  0x00000012
#define _IPC27_AD1D4IP_MASK                      0x001C0000
#define _IPC27_AD1D4IP_LENGTH                    0x00000003

#define _IPC27_AD1D5IS_POSITION                  0x00000018
#define _IPC27_AD1D5IS_MASK                      0x03000000
#define _IPC27_AD1D5IS_LENGTH                    0x00000002

#define _IPC27_AD1D5IP_POSITION                  0x0000001A
#define _IPC27_AD1D5IP_MASK                      0x1C000000
#define _IPC27_AD1D5IP_LENGTH                    0x00000003

#define _IPC27_w_POSITION                        0x00000000
#define _IPC27_w_MASK                            0xFFFFFFFF
#define _IPC27_w_LENGTH                          0x00000020

#define _IPC28_AD1D6IS_POSITION                  0x00000000
#define _IPC28_AD1D6IS_MASK                      0x00000003
#define _IPC28_AD1D6IS_LENGTH                    0x00000002

#define _IPC28_AD1D6IP_POSITION                  0x00000002
#define _IPC28_AD1D6IP_MASK                      0x0000001C
#define _IPC28_AD1D6IP_LENGTH                    0x00000003

#define _IPC28_AD1D7IS_POSITION                  0x00000008
#define _IPC28_AD1D7IS_MASK                      0x00000300
#define _IPC28_AD1D7IS_LENGTH                    0x00000002

#define _IPC28_AD1D7IP_POSITION                  0x0000000A
#define _IPC28_AD1D7IP_MASK                      0x00001C00
#define _IPC28_AD1D7IP_LENGTH                    0x00000003

#define _IPC28_AD1D8IS_POSITION                  0x00000010
#define _IPC28_AD1D8IS_MASK                      0x00030000
#define _IPC28_AD1D8IS_LENGTH                    0x00000002

#define _IPC28_AD1D8IP_POSITION                  0x00000012
#define _IPC28_AD1D8IP_MASK                      0x001C0000
#define _IPC28_AD1D8IP_LENGTH                    0x00000003

#define _IPC28_AD1D9IS_POSITION                  0x00000018
#define _IPC28_AD1D9IS_MASK                      0x03000000
#define _IPC28_AD1D9IS_LENGTH                    0x00000002

#define _IPC28_AD1D9IP_POSITION                  0x0000001A
#define _IPC28_AD1D9IP_MASK                      0x1C000000
#define _IPC28_AD1D9IP_LENGTH                    0x00000003

#define _IPC28_w_POSITION                        0x00000000
#define _IPC28_w_MASK                            0xFFFFFFFF
#define _IPC28_w_LENGTH                          0x00000020

#define _IPC29_AD1D10IS_POSITION                 0x00000000
#define _IPC29_AD1D10IS_MASK                     0x00000003
#define _IPC29_AD1D10IS_LENGTH                   0x00000002

#define _IPC29_AD1D10IP_POSITION                 0x00000002
#define _IPC29_AD1D10IP_MASK                     0x0000001C
#define _IPC29_AD1D10IP_LENGTH                   0x00000003

#define _IPC29_AD1D11IS_POSITION                 0x00000008
#define _IPC29_AD1D11IS_MASK                     0x00000300
#define _IPC29_AD1D11IS_LENGTH                   0x00000002

#define _IPC29_AD1D11IP_POSITION                 0x0000000A
#define _IPC29_AD1D11IP_MASK                     0x00001C00
#define _IPC29_AD1D11IP_LENGTH                   0x00000003

#define _IPC29_AD1D12IS_POSITION                 0x00000010
#define _IPC29_AD1D12IS_MASK                     0x00030000
#define _IPC29_AD1D12IS_LENGTH                   0x00000002

#define _IPC29_AD1D12IP_POSITION                 0x00000012
#define _IPC29_AD1D12IP_MASK                     0x001C0000
#define _IPC29_AD1D12IP_LENGTH                   0x00000003

#define _IPC29_AD1D13IS_POSITION                 0x00000018
#define _IPC29_AD1D13IS_MASK                     0x03000000
#define _IPC29_AD1D13IS_LENGTH                   0x00000002

#define _IPC29_AD1D13IP_POSITION                 0x0000001A
#define _IPC29_AD1D13IP_MASK                     0x1C000000
#define _IPC29_AD1D13IP_LENGTH                   0x00000003

#define _IPC29_w_POSITION                        0x00000000
#define _IPC29_w_MASK                            0xFFFFFFFF
#define _IPC29_w_LENGTH                          0x00000020

#define _IPC30_AD1D14IS_POSITION                 0x00000000
#define _IPC30_AD1D14IS_MASK                     0x00000003
#define _IPC30_AD1D14IS_LENGTH                   0x00000002

#define _IPC30_AD1D14IP_POSITION                 0x00000002
#define _IPC30_AD1D14IP_MASK                     0x0000001C
#define _IPC30_AD1D14IP_LENGTH                   0x00000003

#define _IPC30_AD1D15IS_POSITION                 0x00000008
#define _IPC30_AD1D15IS_MASK                     0x00000300
#define _IPC30_AD1D15IS_LENGTH                   0x00000002

#define _IPC30_AD1D15IP_POSITION                 0x0000000A
#define _IPC30_AD1D15IP_MASK                     0x00001C00
#define _IPC30_AD1D15IP_LENGTH                   0x00000003

#define _IPC30_AD1D16IS_POSITION                 0x00000010
#define _IPC30_AD1D16IS_MASK                     0x00030000
#define _IPC30_AD1D16IS_LENGTH                   0x00000002

#define _IPC30_AD1D16IP_POSITION                 0x00000012
#define _IPC30_AD1D16IP_MASK                     0x001C0000
#define _IPC30_AD1D16IP_LENGTH                   0x00000003

#define _IPC30_AD1D17IS_POSITION                 0x00000018
#define _IPC30_AD1D17IS_MASK                     0x03000000
#define _IPC30_AD1D17IS_LENGTH                   0x00000002

#define _IPC30_AD1D17IP_POSITION                 0x0000001A
#define _IPC30_AD1D17IP_MASK                     0x1C000000
#define _IPC30_AD1D17IP_LENGTH                   0x00000003

