Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CAP3_CAP_POSITION                       0x00000000
#define _CAP3_CAP_MASK                           0x0000FFFF
#define _CAP3_CAP_LENGTH                         0x00000010

#define _LEBCON3_CLLEBEN_POSITION                0x0000000A
#define _LEBCON3_CLLEBEN_MASK                    0x00000400
#define _LEBCON3_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON3_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON3_FLTLEBEN_MASK                   0x00000800
#define _LEBCON3_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON3_PLF_POSITION                    0x0000000C
#define _LEBCON3_PLF_MASK                        0x00001000
#define _LEBCON3_PLF_LENGTH                      0x00000001

#define _LEBCON3_PLR_POSITION                    0x0000000D
#define _LEBCON3_PLR_MASK                        0x00002000
#define _LEBCON3_PLR_LENGTH                      0x00000001

#define _LEBCON3_PHF_POSITION                    0x0000000E
#define _LEBCON3_PHF_MASK                        0x00004000
#define _LEBCON3_PHF_LENGTH                      0x00000001

#define _LEBCON3_PHR_POSITION                    0x0000000F
#define _LEBCON3_PHR_MASK                        0x00008000
#define _LEBCON3_PHR_LENGTH                      0x00000001

#define _LEBDLY3_LEB_POSITION                    0x00000000
#define _LEBDLY3_LEB_MASK                        0x00000FFF
#define _LEBDLY3_LEB_LENGTH                      0x0000000C

#define _AUXCON3_CHOPLEN_POSITION                0x00000000
#define _AUXCON3_CHOPLEN_MASK                    0x00000001
#define _AUXCON3_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON3_CHOPHEN_POSITION                0x00000001
#define _AUXCON3_CHOPHEN_MASK                    0x00000002
#define _AUXCON3_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON3_CHOPSEL_POSITION                0x00000002
#define _AUXCON3_CHOPSEL_MASK                    0x0000003C
#define _AUXCON3_CHOPSEL_LENGTH                  0x00000004

#define _PTMR3_TMR_POSITION                      0x00000000
#define _PTMR3_TMR_MASK                          0x0000FFFF
#define _PTMR3_TMR_LENGTH                        0x00000010

#define _PWMCON4_XPRES_POSITION                  0x00000001
#define _PWMCON4_XPRES_MASK                      0x00000002
#define _PWMCON4_XPRES_LENGTH                    0x00000001

#define _PWMCON4_MTBS_POSITION                   0x00000003
#define _PWMCON4_MTBS_MASK                       0x00000008
#define _PWMCON4_MTBS_LENGTH                     0x00000001

#define _PWMCON4_PTDIR_POSITION                  0x00000004
#define _PWMCON4_PTDIR_MASK                      0x00000010
#define _PWMCON4_PTDIR_LENGTH                    0x00000001

#define _PWMCON4_DTCP_POSITION                   0x00000005
#define _PWMCON4_DTCP_MASK                       0x00000020
#define _PWMCON4_DTCP_LENGTH                     0x00000001

#define _PWMCON4_DTC_POSITION                    0x00000006
#define _PWMCON4_DTC_MASK                        0x000000C0
#define _PWMCON4_DTC_LENGTH                      0x00000002

#define _PWMCON4_ITB_POSITION                    0x00000009
#define _PWMCON4_ITB_MASK                        0x00000200
#define _PWMCON4_ITB_LENGTH                      0x00000001

#define _PWMCON4_ECAM_POSITION                   0x0000000A
#define _PWMCON4_ECAM_MASK                       0x00000C00
#define _PWMCON4_ECAM_LENGTH                     0x00000002

#define _PWMCON4_CLTSTAT_POSITION                0x0000000E
#define _PWMCON4_CLTSTAT_MASK                    0x00004000
#define _PWMCON4_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON4_FLTSTAT_POSITION                0x0000000F
#define _PWMCON4_FLTSTAT_MASK                    0x00008000
#define _PWMCON4_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON4_PWMHIEN_POSITION                0x00000013
#define _PWMCON4_PWMHIEN_MASK                    0x00080000
#define _PWMCON4_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON4_PWMLIEN_POSITION                0x00000014
#define _PWMCON4_PWMLIEN_MASK                    0x00100000
#define _PWMCON4_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON4_TRGIEN_POSITION                 0x00000015
#define _PWMCON4_TRGIEN_MASK                     0x00200000
#define _PWMCON4_TRGIEN_LENGTH                   0x00000001

#define _PWMCON4_CLIEN_POSITION                  0x00000016
#define _PWMCON4_CLIEN_MASK                      0x00400000
#define _PWMCON4_CLIEN_LENGTH                    0x00000001

#define _PWMCON4_FLTIEN_POSITION                 0x00000017
#define _PWMCON4_FLTIEN_MASK                     0x00800000
#define _PWMCON4_FLTIEN_LENGTH                   0x00000001

#define _PWMCON4_PWMHIF_POSITION                 0x0000001B
#define _PWMCON4_PWMHIF_MASK                     0x08000000
#define _PWMCON4_PWMHIF_LENGTH                   0x00000001

#define _PWMCON4_PWMLIF_POSITION                 0x0000001C
#define _PWMCON4_PWMLIF_MASK                     0x10000000
#define _PWMCON4_PWMLIF_LENGTH                   0x00000001

#define _PWMCON4_TRGIF_POSITION                  0x0000001D
#define _PWMCON4_TRGIF_MASK                      0x20000000
#define _PWMCON4_TRGIF_LENGTH                    0x00000001

#define _PWMCON4_CLIF_POSITION                   0x0000001E
#define _PWMCON4_CLIF_MASK                       0x40000000
#define _PWMCON4_CLIF_LENGTH                     0x00000001

#define _PWMCON4_FLTIF_POSITION                  0x0000001F
#define _PWMCON4_FLTIF_MASK                      0x80000000
#define _PWMCON4_FLTIF_LENGTH                    0x00000001

#define _IOCON4_OSYNC_POSITION                   0x00000000
#define _IOCON4_OSYNC_MASK                       0x00000001
#define _IOCON4_OSYNC_LENGTH                     0x00000001

#define _IOCON4_SWAP_POSITION                    0x00000001
#define _IOCON4_SWAP_MASK                        0x00000002
#define _IOCON4_SWAP_LENGTH                      0x00000001

#define _IOCON4_CLDAT_POSITION                   0x00000002
#define _IOCON4_CLDAT_MASK                       0x0000000C
#define _IOCON4_CLDAT_LENGTH                     0x00000002

#define _IOCON4_FLTDAT_POSITION                  0x00000004
#define _IOCON4_FLTDAT_MASK                      0x00000030
#define _IOCON4_FLTDAT_LENGTH                    0x00000002

#define _IOCON4_OVRDAT_POSITION                  0x00000006
#define _IOCON4_OVRDAT_MASK                      0x000000C0
#define _IOCON4_OVRDAT_LENGTH                    0x00000002

#define _IOCON4_OVRENL_POSITION                  0x00000008
#define _IOCON4_OVRENL_MASK                      0x00000100
#define _IOCON4_OVRENL_LENGTH                    0x00000001

