Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _AUXCON11_CHOPLEN_POSITION               0x00000000
#define _AUXCON11_CHOPLEN_MASK                   0x00000001
#define _AUXCON11_CHOPLEN_LENGTH                 0x00000001

#define _AUXCON11_CHOPHEN_POSITION               0x00000001
#define _AUXCON11_CHOPHEN_MASK                   0x00000002
#define _AUXCON11_CHOPHEN_LENGTH                 0x00000001

#define _AUXCON11_CHOPSEL_POSITION               0x00000002
#define _AUXCON11_CHOPSEL_MASK                   0x0000003C
#define _AUXCON11_CHOPSEL_LENGTH                 0x00000004

#define _PTMR11_TMR_POSITION                     0x00000000
#define _PTMR11_TMR_MASK                         0x0000FFFF
#define _PTMR11_TMR_LENGTH                       0x00000010

#define _PWMCON12_XPRES_POSITION                 0x00000001
#define _PWMCON12_XPRES_MASK                     0x00000002
#define _PWMCON12_XPRES_LENGTH                   0x00000001

#define _PWMCON12_MTBS_POSITION                  0x00000003
#define _PWMCON12_MTBS_MASK                      0x00000008
#define _PWMCON12_MTBS_LENGTH                    0x00000001

#define _PWMCON12_PTDIR_POSITION                 0x00000004
#define _PWMCON12_PTDIR_MASK                     0x00000010
#define _PWMCON12_PTDIR_LENGTH                   0x00000001

#define _PWMCON12_DTCP_POSITION                  0x00000005
#define _PWMCON12_DTCP_MASK                      0x00000020
#define _PWMCON12_DTCP_LENGTH                    0x00000001

#define _PWMCON12_DTC_POSITION                   0x00000006
#define _PWMCON12_DTC_MASK                       0x000000C0
#define _PWMCON12_DTC_LENGTH                     0x00000002

#define _PWMCON12_ITB_POSITION                   0x00000009
#define _PWMCON12_ITB_MASK                       0x00000200
#define _PWMCON12_ITB_LENGTH                     0x00000001

#define _PWMCON12_ECAM_POSITION                  0x0000000A
#define _PWMCON12_ECAM_MASK                      0x00000C00
#define _PWMCON12_ECAM_LENGTH                    0x00000002

#define _PWMCON12_CLTSTAT_POSITION               0x0000000E
#define _PWMCON12_CLTSTAT_MASK                   0x00004000
#define _PWMCON12_CLTSTAT_LENGTH                 0x00000001

#define _PWMCON12_FLTSTAT_POSITION               0x0000000F
#define _PWMCON12_FLTSTAT_MASK                   0x00008000
#define _PWMCON12_FLTSTAT_LENGTH                 0x00000001

#define _PWMCON12_PWMHIEN_POSITION               0x00000013
#define _PWMCON12_PWMHIEN_MASK                   0x00080000
#define _PWMCON12_PWMHIEN_LENGTH                 0x00000001

#define _PWMCON12_PWMLIEN_POSITION               0x00000014
#define _PWMCON12_PWMLIEN_MASK                   0x00100000
#define _PWMCON12_PWMLIEN_LENGTH                 0x00000001

#define _PWMCON12_TRGIEN_POSITION                0x00000015
#define _PWMCON12_TRGIEN_MASK                    0x00200000
#define _PWMCON12_TRGIEN_LENGTH                  0x00000001

#define _PWMCON12_CLIEN_POSITION                 0x00000016
#define _PWMCON12_CLIEN_MASK                     0x00400000
#define _PWMCON12_CLIEN_LENGTH                   0x00000001

#define _PWMCON12_FLTIEN_POSITION                0x00000017
#define _PWMCON12_FLTIEN_MASK                    0x00800000
#define _PWMCON12_FLTIEN_LENGTH                  0x00000001

#define _PWMCON12_PWMHIF_POSITION                0x0000001B
#define _PWMCON12_PWMHIF_MASK                    0x08000000
#define _PWMCON12_PWMHIF_LENGTH                  0x00000001

#define _PWMCON12_PWMLIF_POSITION                0x0000001C
#define _PWMCON12_PWMLIF_MASK                    0x10000000
#define _PWMCON12_PWMLIF_LENGTH                  0x00000001

#define _PWMCON12_TRGIF_POSITION                 0x0000001D
#define _PWMCON12_TRGIF_MASK                     0x20000000
#define _PWMCON12_TRGIF_LENGTH                   0x00000001

#define _PWMCON12_CLIF_POSITION                  0x0000001E
#define _PWMCON12_CLIF_MASK                      0x40000000
#define _PWMCON12_CLIF_LENGTH                    0x00000001

#define _PWMCON12_FLTIF_POSITION                 0x0000001F
#define _PWMCON12_FLTIF_MASK                     0x80000000
#define _PWMCON12_FLTIF_LENGTH                   0x00000001

#define _IOCON12_OSYNC_POSITION                  0x00000000
#define _IOCON12_OSYNC_MASK                      0x00000001
#define _IOCON12_OSYNC_LENGTH                    0x00000001

#define _IOCON12_SWAP_POSITION                   0x00000001
#define _IOCON12_SWAP_MASK                       0x00000002
#define _IOCON12_SWAP_LENGTH                     0x00000001

#define _IOCON12_CLDAT_POSITION                  0x00000002
#define _IOCON12_CLDAT_MASK                      0x0000000C
#define _IOCON12_CLDAT_LENGTH                    0x00000002

#define _IOCON12_FLTDAT_POSITION                 0x00000004
#define _IOCON12_FLTDAT_MASK                     0x00000030
#define _IOCON12_FLTDAT_LENGTH                   0x00000002

#define _IOCON12_OVRDAT_POSITION                 0x00000006
#define _IOCON12_OVRDAT_MASK                     0x000000C0
#define _IOCON12_OVRDAT_LENGTH                   0x00000002

#define _IOCON12_OVRENL_POSITION                 0x00000008
#define _IOCON12_OVRENL_MASK                     0x00000100
#define _IOCON12_OVRENL_LENGTH                   0x00000001

#define _IOCON12_OVRENH_POSITION                 0x00000009
#define _IOCON12_OVRENH_MASK                     0x00000200
#define _IOCON12_OVRENH_LENGTH                   0x00000001

#define _IOCON12_PMOD_POSITION                   0x0000000A
#define _IOCON12_PMOD_MASK                       0x00000C00
#define _IOCON12_PMOD_LENGTH                     0x00000002

#define _IOCON12_POLL_POSITION                   0x0000000C
#define _IOCON12_POLL_MASK                       0x00001000
#define _IOCON12_POLL_LENGTH                     0x00000001

#define _IOCON12_POLH_POSITION                   0x0000000D
#define _IOCON12_POLH_MASK                       0x00002000
#define _IOCON12_POLH_LENGTH                     0x00000001

#define _IOCON12_PENL_POSITION                   0x0000000E
#define _IOCON12_PENL_MASK                       0x00004000
#define _IOCON12_PENL_LENGTH                     0x00000001

#define _IOCON12_PENH_POSITION                   0x0000000F
#define _IOCON12_PENH_MASK                       0x00008000
#define _IOCON12_PENH_LENGTH                     0x00000001

#define _IOCON12_FLTMOD_POSITION                 0x00000010
#define _IOCON12_FLTMOD_MASK                     0x00030000
#define _IOCON12_FLTMOD_LENGTH                   0x00000002

