Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _OC10CON_SIDL_POSITION                   0x0000000D
#define _OC10CON_SIDL_MASK                       0x00002000
#define _OC10CON_SIDL_LENGTH                     0x00000001

#define _OC10CON_ON_POSITION                     0x0000000F
#define _OC10CON_ON_MASK                         0x00008000
#define _OC10CON_ON_LENGTH                       0x00000001

#define _OC10CON_OCM0_POSITION                   0x00000000
#define _OC10CON_OCM0_MASK                       0x00000001
#define _OC10CON_OCM0_LENGTH                     0x00000001

#define _OC10CON_OCM1_POSITION                   0x00000001
#define _OC10CON_OCM1_MASK                       0x00000002
#define _OC10CON_OCM1_LENGTH                     0x00000001

#define _OC10CON_OCM2_POSITION                   0x00000002
#define _OC10CON_OCM2_MASK                       0x00000004
#define _OC10CON_OCM2_LENGTH                     0x00000001

#define _OC10CON_OCSIDL_POSITION                 0x0000000D
#define _OC10CON_OCSIDL_MASK                     0x00002000
#define _OC10CON_OCSIDL_LENGTH                   0x00000001

#define _OC10CON_w_POSITION                      0x00000000
#define _OC10CON_w_MASK                          0xFFFFFFFF
#define _OC10CON_w_LENGTH                        0x00000020

#define _OC11CON_OCM_POSITION                    0x00000000
#define _OC11CON_OCM_MASK                        0x00000007
#define _OC11CON_OCM_LENGTH                      0x00000003

#define _OC11CON_OCTSEL_POSITION                 0x00000003
#define _OC11CON_OCTSEL_MASK                     0x00000008
#define _OC11CON_OCTSEL_LENGTH                   0x00000001

#define _OC11CON_OCFLT_POSITION                  0x00000004
#define _OC11CON_OCFLT_MASK                      0x00000010
#define _OC11CON_OCFLT_LENGTH                    0x00000001

#define _OC11CON_OC32_POSITION                   0x00000005
#define _OC11CON_OC32_MASK                       0x00000020
#define _OC11CON_OC32_LENGTH                     0x00000001

#define _OC11CON_SIDL_POSITION                   0x0000000D
#define _OC11CON_SIDL_MASK                       0x00002000
#define _OC11CON_SIDL_LENGTH                     0x00000001

#define _OC11CON_ON_POSITION                     0x0000000F
#define _OC11CON_ON_MASK                         0x00008000
#define _OC11CON_ON_LENGTH                       0x00000001

#define _OC11CON_OCM0_POSITION                   0x00000000
#define _OC11CON_OCM0_MASK                       0x00000001
#define _OC11CON_OCM0_LENGTH                     0x00000001

#define _OC11CON_OCM1_POSITION                   0x00000001
#define _OC11CON_OCM1_MASK                       0x00000002
#define _OC11CON_OCM1_LENGTH                     0x00000001

#define _OC11CON_OCM2_POSITION                   0x00000002
#define _OC11CON_OCM2_MASK                       0x00000004
#define _OC11CON_OCM2_LENGTH                     0x00000001

#define _OC11CON_OCSIDL_POSITION                 0x0000000D
#define _OC11CON_OCSIDL_MASK                     0x00002000
#define _OC11CON_OCSIDL_LENGTH                   0x00000001

#define _OC11CON_w_POSITION                      0x00000000
#define _OC11CON_w_MASK                          0xFFFFFFFF
#define _OC11CON_w_LENGTH                        0x00000020

#define _OC12CON_OCM_POSITION                    0x00000000
#define _OC12CON_OCM_MASK                        0x00000007
#define _OC12CON_OCM_LENGTH                      0x00000003

#define _OC12CON_OCTSEL_POSITION                 0x00000003
#define _OC12CON_OCTSEL_MASK                     0x00000008
#define _OC12CON_OCTSEL_LENGTH                   0x00000001

#define _OC12CON_OCFLT_POSITION                  0x00000004
#define _OC12CON_OCFLT_MASK                      0x00000010
#define _OC12CON_OCFLT_LENGTH                    0x00000001

#define _OC12CON_OC32_POSITION                   0x00000005
#define _OC12CON_OC32_MASK                       0x00000020
#define _OC12CON_OC32_LENGTH                     0x00000001

#define _OC12CON_SIDL_POSITION                   0x0000000D
#define _OC12CON_SIDL_MASK                       0x00002000
#define _OC12CON_SIDL_LENGTH                     0x00000001

#define _OC12CON_ON_POSITION                     0x0000000F
#define _OC12CON_ON_MASK                         0x00008000
#define _OC12CON_ON_LENGTH                       0x00000001

#define _OC12CON_OCM0_POSITION                   0x00000000
#define _OC12CON_OCM0_MASK                       0x00000001
#define _OC12CON_OCM0_LENGTH                     0x00000001

#define _OC12CON_OCM1_POSITION                   0x00000001
#define _OC12CON_OCM1_MASK                       0x00000002
#define _OC12CON_OCM1_LENGTH                     0x00000001

#define _OC12CON_OCM2_POSITION                   0x00000002
#define _OC12CON_OCM2_MASK                       0x00000004
#define _OC12CON_OCM2_LENGTH                     0x00000001

#define _OC12CON_OCSIDL_POSITION                 0x0000000D
#define _OC12CON_OCSIDL_MASK                     0x00002000
#define _OC12CON_OCSIDL_LENGTH                   0x00000001

#define _OC12CON_w_POSITION                      0x00000000
#define _OC12CON_w_MASK                          0xFFFFFFFF
#define _OC12CON_w_LENGTH                        0x00000020

#define _OC13CON_OCM_POSITION                    0x00000000
#define _OC13CON_OCM_MASK                        0x00000007
#define _OC13CON_OCM_LENGTH                      0x00000003

#define _OC13CON_OCTSEL_POSITION                 0x00000003
#define _OC13CON_OCTSEL_MASK                     0x00000008
#define _OC13CON_OCTSEL_LENGTH                   0x00000001

#define _OC13CON_OCFLT_POSITION                  0x00000004
#define _OC13CON_OCFLT_MASK                      0x00000010
#define _OC13CON_OCFLT_LENGTH                    0x00000001

#define _OC13CON_OC32_POSITION                   0x00000005
#define _OC13CON_OC32_MASK                       0x00000020
#define _OC13CON_OC32_LENGTH                     0x00000001

#define _OC13CON_SIDL_POSITION                   0x0000000D
#define _OC13CON_SIDL_MASK                       0x00002000
#define _OC13CON_SIDL_LENGTH                     0x00000001

#define _OC13CON_ON_POSITION                     0x0000000F
#define _OC13CON_ON_MASK                         0x00008000
#define _OC13CON_ON_LENGTH                       0x00000001

#define _OC13CON_OCM0_POSITION                   0x00000000
#define _OC13CON_OCM0_MASK                       0x00000001
#define _OC13CON_OCM0_LENGTH                     0x00000001

