Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CNCONG_w_POSITION                       0x00000000
#define _CNCONG_w_MASK                           0xFFFFFFFF
#define _CNCONG_w_LENGTH                         0x00000020

#define _CNENG_CNIEG6_POSITION                   0x00000006
#define _CNENG_CNIEG6_MASK                       0x00000040
#define _CNENG_CNIEG6_LENGTH                     0x00000001

#define _CNENG_CNIEG7_POSITION                   0x00000007
#define _CNENG_CNIEG7_MASK                       0x00000080
#define _CNENG_CNIEG7_LENGTH                     0x00000001

#define _CNENG_CNIEG8_POSITION                   0x00000008
#define _CNENG_CNIEG8_MASK                       0x00000100
#define _CNENG_CNIEG8_LENGTH                     0x00000001

#define _CNENG_CNIEG9_POSITION                   0x00000009
#define _CNENG_CNIEG9_MASK                       0x00000200
#define _CNENG_CNIEG9_LENGTH                     0x00000001

#define _CNENG_w_POSITION                        0x00000000
#define _CNENG_w_MASK                            0xFFFFFFFF
#define _CNENG_w_LENGTH                          0x00000020

#define _CNSTATG_CNSTATG6_POSITION               0x00000006
#define _CNSTATG_CNSTATG6_MASK                   0x00000040
#define _CNSTATG_CNSTATG6_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG7_POSITION               0x00000007
#define _CNSTATG_CNSTATG7_MASK                   0x00000080
#define _CNSTATG_CNSTATG7_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG8_POSITION               0x00000008
#define _CNSTATG_CNSTATG8_MASK                   0x00000100
#define _CNSTATG_CNSTATG8_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG9_POSITION               0x00000009
#define _CNSTATG_CNSTATG9_MASK                   0x00000200
#define _CNSTATG_CNSTATG9_LENGTH                 0x00000001

#define _CNSTATG_w_POSITION                      0x00000000
#define _CNSTATG_w_MASK                          0xFFFFFFFF
#define _CNSTATG_w_LENGTH                        0x00000020

#define _CNNEG_CNNEG6_POSITION                   0x00000006
#define _CNNEG_CNNEG6_MASK                       0x00000040
#define _CNNEG_CNNEG6_LENGTH                     0x00000001

#define _CNNEG_CNNEG7_POSITION                   0x00000007
#define _CNNEG_CNNEG7_MASK                       0x00000080
#define _CNNEG_CNNEG7_LENGTH                     0x00000001

#define _CNNEG_CNNEG8_POSITION                   0x00000008
#define _CNNEG_CNNEG8_MASK                       0x00000100
#define _CNNEG_CNNEG8_LENGTH                     0x00000001

#define _CNNEG_CNNEG9_POSITION                   0x00000009
#define _CNNEG_CNNEG9_MASK                       0x00000200
#define _CNNEG_CNNEG9_LENGTH                     0x00000001

#define _CNFG_CNFG6_POSITION                     0x00000006
#define _CNFG_CNFG6_MASK                         0x00000040
#define _CNFG_CNFG6_LENGTH                       0x00000001

#define _CNFG_CNFG7_POSITION                     0x00000007
#define _CNFG_CNFG7_MASK                         0x00000080
#define _CNFG_CNFG7_LENGTH                       0x00000001

#define _CNFG_CNFG8_POSITION                     0x00000008
#define _CNFG_CNFG8_MASK                         0x00000100
#define _CNFG_CNFG8_LENGTH                       0x00000001

#define _CNFG_CNFG9_POSITION                     0x00000009
#define _CNFG_CNFG9_MASK                         0x00000200
#define _CNFG_CNFG9_LENGTH                       0x00000001

#define _CFD1CON_DNCNT_POSITION                  0x00000000
#define _CFD1CON_DNCNT_MASK                      0x0000001F
#define _CFD1CON_DNCNT_LENGTH                    0x00000005

#define _CFD1CON_ISOCRCEN_POSITION               0x00000005
#define _CFD1CON_ISOCRCEN_MASK                   0x00000020
#define _CFD1CON_ISOCRCEN_LENGTH                 0x00000001

#define _CFD1CON_PXEDIS_POSITION                 0x00000006
#define _CFD1CON_PXEDIS_MASK                     0x00000040
#define _CFD1CON_PXEDIS_LENGTH                   0x00000001

#define _CFD1CON_CLKSEL0_POSITION                0x00000007
#define _CFD1CON_CLKSEL0_MASK                    0x00000080
#define _CFD1CON_CLKSEL0_LENGTH                  0x00000001

#define _CFD1CON_WAKFIL_POSITION                 0x00000008
#define _CFD1CON_WAKFIL_MASK                     0x00000100
#define _CFD1CON_WAKFIL_LENGTH                   0x00000001

#define _CFD1CON_WFT_POSITION                    0x00000009
#define _CFD1CON_WFT_MASK                        0x00000600
#define _CFD1CON_WFT_LENGTH                      0x00000002

#define _CFD1CON_BUSY_POSITION                   0x0000000B
#define _CFD1CON_BUSY_MASK                       0x00000800
#define _CFD1CON_BUSY_LENGTH                     0x00000001

#define _CFD1CON_BRSDIS_POSITION                 0x0000000C
#define _CFD1CON_BRSDIS_MASK                     0x00001000
#define _CFD1CON_BRSDIS_LENGTH                   0x00000001

#define _CFD1CON_SIDL_POSITION                   0x0000000D
#define _CFD1CON_SIDL_MASK                       0x00002000
#define _CFD1CON_SIDL_LENGTH                     0x00000001

#define _CFD1CON_ON_POSITION                     0x0000000F
#define _CFD1CON_ON_MASK                         0x00008000
#define _CFD1CON_ON_LENGTH                       0x00000001

#define _CFD1CON_RTXAT_POSITION                  0x00000010
#define _CFD1CON_RTXAT_MASK                      0x00010000
#define _CFD1CON_RTXAT_LENGTH                    0x00000001

#define _CFD1CON_ESIGM_POSITION                  0x00000011
#define _CFD1CON_ESIGM_MASK                      0x00020000
#define _CFD1CON_ESIGM_LENGTH                    0x00000001

#define _CFD1CON_SERR2LOM_POSITION               0x00000012
#define _CFD1CON_SERR2LOM_MASK                   0x00040000
#define _CFD1CON_SERR2LOM_LENGTH                 0x00000001

#define _CFD1CON_STEF_POSITION                   0x00000013
#define _CFD1CON_STEF_MASK                       0x00080000
#define _CFD1CON_STEF_LENGTH                     0x00000001

#define _CFD1CON_TXQEN_POSITION                  0x00000014
#define _CFD1CON_TXQEN_MASK                      0x00100000
#define _CFD1CON_TXQEN_LENGTH                    0x00000001

