Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD2INT_WAKIE_POSITION                  0x0000001E
#define _CFD2INT_WAKIE_MASK                      0x40000000
#define _CFD2INT_WAKIE_LENGTH                    0x00000001

#define _CFD2INT_IVMIE_POSITION                  0x0000001F
#define _CFD2INT_IVMIE_MASK                      0x80000000
#define _CFD2INT_IVMIE_LENGTH                    0x00000001

#define _CFD2INT_w_POSITION                      0x00000000
#define _CFD2INT_w_MASK                          0xFFFFFFFF
#define _CFD2INT_w_LENGTH                        0x00000020

#define _CFD2RXIF_RFIF_POSITION                  0x00000001
#define _CFD2RXIF_RFIF_MASK                      0xFFFFFFFE
#define _CFD2RXIF_RFIF_LENGTH                    0x0000001F

#define _CFD2TXIF_TFIF_POSITION                  0x00000000
#define _CFD2TXIF_TFIF_MASK                      0xFFFFFFFF
#define _CFD2TXIF_TFIF_LENGTH                    0x00000020

#define _CFD2RXOVIF_RFOVIF_POSITION              0x00000001
#define _CFD2RXOVIF_RFOVIF_MASK                  0xFFFFFFFE
#define _CFD2RXOVIF_RFOVIF_LENGTH                0x0000001F

#define _CFD2TXATIF_TFATIF_POSITION              0x00000000
#define _CFD2TXATIF_TFATIF_MASK                  0xFFFFFFFF
#define _CFD2TXATIF_TFATIF_LENGTH                0x00000020

#define _CFD2TXREQ_TXREQ_POSITION                0x00000000
#define _CFD2TXREQ_TXREQ_MASK                    0xFFFFFFFF
#define _CFD2TXREQ_TXREQ_LENGTH                  0x00000020

#define _CFD2TREC_RERRCNT_POSITION               0x00000000
#define _CFD2TREC_RERRCNT_MASK                   0x000000FF
#define _CFD2TREC_RERRCNT_LENGTH                 0x00000008

#define _CFD2TREC_TERRCNT_POSITION               0x00000008
#define _CFD2TREC_TERRCNT_MASK                   0x0000FF00
#define _CFD2TREC_TERRCNT_LENGTH                 0x00000008

#define _CFD2TREC_EWARN_POSITION                 0x00000010
#define _CFD2TREC_EWARN_MASK                     0x00010000
#define _CFD2TREC_EWARN_LENGTH                   0x00000001

#define _CFD2TREC_RXWARN_POSITION                0x00000011
#define _CFD2TREC_RXWARN_MASK                    0x00020000
#define _CFD2TREC_RXWARN_LENGTH                  0x00000001

#define _CFD2TREC_TXWARN_POSITION                0x00000012
#define _CFD2TREC_TXWARN_MASK                    0x00040000
#define _CFD2TREC_TXWARN_LENGTH                  0x00000001

#define _CFD2TREC_RXBP_POSITION                  0x00000013
#define _CFD2TREC_RXBP_MASK                      0x00080000
#define _CFD2TREC_RXBP_LENGTH                    0x00000001

#define _CFD2TREC_TXBP_POSITION                  0x00000014
#define _CFD2TREC_TXBP_MASK                      0x00100000
#define _CFD2TREC_TXBP_LENGTH                    0x00000001

#define _CFD2TREC_TXBO_POSITION                  0x00000015
#define _CFD2TREC_TXBO_MASK                      0x00200000
#define _CFD2TREC_TXBO_LENGTH                    0x00000001

#define _CFD2TREC_w_POSITION                     0x00000000
#define _CFD2TREC_w_MASK                         0xFFFFFFFF
#define _CFD2TREC_w_LENGTH                       0x00000020

#define _CFD2BDIAG0_NRERRCNT_POSITION            0x00000000
#define _CFD2BDIAG0_NRERRCNT_MASK                0x000000FF
#define _CFD2BDIAG0_NRERRCNT_LENGTH              0x00000008

#define _CFD2BDIAG0_NTERRCNT_POSITION            0x00000008
#define _CFD2BDIAG0_NTERRCNT_MASK                0x0000FF00
#define _CFD2BDIAG0_NTERRCNT_LENGTH              0x00000008

#define _CFD2BDIAG0_DRERRCNT_POSITION            0x00000010
#define _CFD2BDIAG0_DRERRCNT_MASK                0x00FF0000
#define _CFD2BDIAG0_DRERRCNT_LENGTH              0x00000008

#define _CFD2BDIAG0_DTERRCNT_POSITION            0x00000018
#define _CFD2BDIAG0_DTERRCNT_MASK                0xFF000000
#define _CFD2BDIAG0_DTERRCNT_LENGTH              0x00000008

#define _CFD2BDIAG1_EFMSGCNT_POSITION            0x00000000
#define _CFD2BDIAG1_EFMSGCNT_MASK                0x0000FFFF
#define _CFD2BDIAG1_EFMSGCNT_LENGTH              0x00000010

#define _CFD2BDIAG1_NBIT0ERR_POSITION            0x00000010
#define _CFD2BDIAG1_NBIT0ERR_MASK                0x00010000
#define _CFD2BDIAG1_NBIT0ERR_LENGTH              0x00000001

#define _CFD2BDIAG1_NBIT1ERR_POSITION            0x00000011
#define _CFD2BDIAG1_NBIT1ERR_MASK                0x00020000
#define _CFD2BDIAG1_NBIT1ERR_LENGTH              0x00000001

#define _CFD2BDIAG1_NACKERR_POSITION             0x00000012
#define _CFD2BDIAG1_NACKERR_MASK                 0x00040000
#define _CFD2BDIAG1_NACKERR_LENGTH               0x00000001

#define _CFD2BDIAG1_NFORMERR_POSITION            0x00000013
#define _CFD2BDIAG1_NFORMERR_MASK                0x00080000
#define _CFD2BDIAG1_NFORMERR_LENGTH              0x00000001

#define _CFD2BDIAG1_NSTUFERR_POSITION            0x00000014
#define _CFD2BDIAG1_NSTUFERR_MASK                0x00100000
#define _CFD2BDIAG1_NSTUFERR_LENGTH              0x00000001

#define _CFD2BDIAG1_NCRCERR_POSITION             0x00000015
#define _CFD2BDIAG1_NCRCERR_MASK                 0x00200000
#define _CFD2BDIAG1_NCRCERR_LENGTH               0x00000001

#define _CFD2BDIAG1_DBIT0ERR_POSITION            0x00000018
#define _CFD2BDIAG1_DBIT0ERR_MASK                0x01000000
#define _CFD2BDIAG1_DBIT0ERR_LENGTH              0x00000001

#define _CFD2BDIAG1_DBIT1ERR_POSITION            0x00000019
#define _CFD2BDIAG1_DBIT1ERR_MASK                0x02000000
#define _CFD2BDIAG1_DBIT1ERR_LENGTH              0x00000001

#define _CFD2BDIAG1_DFORMERR_POSITION            0x0000001B
#define _CFD2BDIAG1_DFORMERR_MASK                0x08000000
#define _CFD2BDIAG1_DFORMERR_LENGTH              0x00000001

#define _CFD2BDIAG1_DSTUFERR_POSITION            0x0000001C
#define _CFD2BDIAG1_DSTUFERR_MASK                0x10000000
#define _CFD2BDIAG1_DSTUFERR_LENGTH              0x00000001

#define _CFD2BDIAG1_DCRCERR_POSITION             0x0000001D
#define _CFD2BDIAG1_DCRCERR_MASK                 0x20000000
#define _CFD2BDIAG1_DCRCERR_LENGTH               0x00000001

#define _CFD2BDIAG1_ESI_POSITION                 0x0000001E
#define _CFD2BDIAG1_ESI_MASK                     0x40000000
#define _CFD2BDIAG1_ESI_LENGTH                   0x00000001

#define _CFD2BDIAG1_DLCMM_POSITION               0x0000001F
#define _CFD2BDIAG1_DLCMM_MASK                   0x80000000
#define _CFD2BDIAG1_DLCMM_LENGTH                 0x00000001

#define _CFD2TEFCON_TEFNEIE_POSITION             0x00000000
#define _CFD2TEFCON_TEFNEIE_MASK                 0x00000001
#define _CFD2TEFCON_TEFNEIE_LENGTH               0x00000001

