Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD2MASK9_MIDE_POSITION                 0x0000001E
#define _CFD2MASK9_MIDE_MASK                     0x40000000
#define _CFD2MASK9_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ10_SID_POSITION               0x00000000
#define _CFD2FLTOBJ10_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ10_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ10_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ10_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ10_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ10_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ10_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ10_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ10_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ10_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ10_EXIDE_LENGTH               0x00000001

#define _CFD2MASK10_MSID_POSITION                0x00000000
#define _CFD2MASK10_MSID_MASK                    0x000007FF
#define _CFD2MASK10_MSID_LENGTH                  0x0000000B

#define _CFD2MASK10_MEID_POSITION                0x0000000B
#define _CFD2MASK10_MEID_MASK                    0x1FFFF800
#define _CFD2MASK10_MEID_LENGTH                  0x00000012

#define _CFD2MASK10_MSID11_POSITION              0x0000001D
#define _CFD2MASK10_MSID11_MASK                  0x20000000
#define _CFD2MASK10_MSID11_LENGTH                0x00000001

#define _CFD2MASK10_MIDE_POSITION                0x0000001E
#define _CFD2MASK10_MIDE_MASK                    0x40000000
#define _CFD2MASK10_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ11_SID_POSITION               0x00000000
#define _CFD2FLTOBJ11_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ11_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ11_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ11_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ11_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ11_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ11_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ11_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ11_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ11_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ11_EXIDE_LENGTH               0x00000001

#define _CFD2MASK11_MSID_POSITION                0x00000000
#define _CFD2MASK11_MSID_MASK                    0x000007FF
#define _CFD2MASK11_MSID_LENGTH                  0x0000000B

#define _CFD2MASK11_MEID_POSITION                0x0000000B
#define _CFD2MASK11_MEID_MASK                    0x1FFFF800
#define _CFD2MASK11_MEID_LENGTH                  0x00000012

#define _CFD2MASK11_MSID11_POSITION              0x0000001D
#define _CFD2MASK11_MSID11_MASK                  0x20000000
#define _CFD2MASK11_MSID11_LENGTH                0x00000001

#define _CFD2MASK11_MIDE_POSITION                0x0000001E
#define _CFD2MASK11_MIDE_MASK                    0x40000000
#define _CFD2MASK11_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ12_SID_POSITION               0x00000000
#define _CFD2FLTOBJ12_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ12_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ12_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ12_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ12_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ12_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ12_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ12_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ12_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ12_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ12_EXIDE_LENGTH               0x00000001

#define _CFD2MASK12_MSID_POSITION                0x00000000
#define _CFD2MASK12_MSID_MASK                    0x000007FF
#define _CFD2MASK12_MSID_LENGTH                  0x0000000B

#define _CFD2MASK12_MEID_POSITION                0x0000000B
#define _CFD2MASK12_MEID_MASK                    0x1FFFF800
#define _CFD2MASK12_MEID_LENGTH                  0x00000012

#define _CFD2MASK12_MSID11_POSITION              0x0000001D
#define _CFD2MASK12_MSID11_MASK                  0x20000000
#define _CFD2MASK12_MSID11_LENGTH                0x00000001

#define _CFD2MASK12_MIDE_POSITION                0x0000001E
#define _CFD2MASK12_MIDE_MASK                    0x40000000
#define _CFD2MASK12_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ13_SID_POSITION               0x00000000
#define _CFD2FLTOBJ13_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ13_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ13_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ13_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ13_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ13_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ13_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ13_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ13_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ13_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ13_EXIDE_LENGTH               0x00000001

#define _CFD2MASK13_MSID_POSITION                0x00000000
#define _CFD2MASK13_MSID_MASK                    0x000007FF
#define _CFD2MASK13_MSID_LENGTH                  0x0000000B

#define _CFD2MASK13_MEID_POSITION                0x0000000B
#define _CFD2MASK13_MEID_MASK                    0x1FFFF800
#define _CFD2MASK13_MEID_LENGTH                  0x00000012

#define _CFD2MASK13_MSID11_POSITION              0x0000001D
#define _CFD2MASK13_MSID11_MASK                  0x20000000
#define _CFD2MASK13_MSID11_LENGTH                0x00000001

#define _CFD2MASK13_MIDE_POSITION                0x0000001E
#define _CFD2MASK13_MIDE_MASK                    0x40000000
#define _CFD2MASK13_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ14_SID_POSITION               0x00000000
#define _CFD2FLTOBJ14_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ14_SID_LENGTH                 0x0000000B

