Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD2FLTOBJ19_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ19_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ19_EXIDE_LENGTH               0x00000001

#define _CFD2MASK19_MSID_POSITION                0x00000000
#define _CFD2MASK19_MSID_MASK                    0x000007FF
#define _CFD2MASK19_MSID_LENGTH                  0x0000000B

#define _CFD2MASK19_MEID_POSITION                0x0000000B
#define _CFD2MASK19_MEID_MASK                    0x1FFFF800
#define _CFD2MASK19_MEID_LENGTH                  0x00000012

#define _CFD2MASK19_MSID11_POSITION              0x0000001D
#define _CFD2MASK19_MSID11_MASK                  0x20000000
#define _CFD2MASK19_MSID11_LENGTH                0x00000001

#define _CFD2MASK19_MIDE_POSITION                0x0000001E
#define _CFD2MASK19_MIDE_MASK                    0x40000000
#define _CFD2MASK19_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ20_SID_POSITION               0x00000000
#define _CFD2FLTOBJ20_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ20_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ20_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ20_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ20_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ20_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ20_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ20_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ20_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ20_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ20_EXIDE_LENGTH               0x00000001

#define _CFD2MASK20_MSID_POSITION                0x00000000
#define _CFD2MASK20_MSID_MASK                    0x000007FF
#define _CFD2MASK20_MSID_LENGTH                  0x0000000B

#define _CFD2MASK20_MEID_POSITION                0x0000000B
#define _CFD2MASK20_MEID_MASK                    0x1FFFF800
#define _CFD2MASK20_MEID_LENGTH                  0x00000012

#define _CFD2MASK20_MSID11_POSITION              0x0000001D
#define _CFD2MASK20_MSID11_MASK                  0x20000000
#define _CFD2MASK20_MSID11_LENGTH                0x00000001

#define _CFD2MASK20_MIDE_POSITION                0x0000001E
#define _CFD2MASK20_MIDE_MASK                    0x40000000
#define _CFD2MASK20_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ21_SID_POSITION               0x00000000
#define _CFD2FLTOBJ21_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ21_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ21_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ21_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ21_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ21_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ21_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ21_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ21_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ21_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ21_EXIDE_LENGTH               0x00000001

#define _CFD2MASK21_MSID_POSITION                0x00000000
#define _CFD2MASK21_MSID_MASK                    0x000007FF
#define _CFD2MASK21_MSID_LENGTH                  0x0000000B

#define _CFD2MASK21_MEID_POSITION                0x0000000B
#define _CFD2MASK21_MEID_MASK                    0x1FFFF800
#define _CFD2MASK21_MEID_LENGTH                  0x00000012

#define _CFD2MASK21_MSID11_POSITION              0x0000001D
#define _CFD2MASK21_MSID11_MASK                  0x20000000
#define _CFD2MASK21_MSID11_LENGTH                0x00000001

#define _CFD2MASK21_MIDE_POSITION                0x0000001E
#define _CFD2MASK21_MIDE_MASK                    0x40000000
#define _CFD2MASK21_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ22_SID_POSITION               0x00000000
#define _CFD2FLTOBJ22_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ22_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ22_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ22_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ22_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ22_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ22_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ22_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ22_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ22_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ22_EXIDE_LENGTH               0x00000001

#define _CFD2MASK22_MSID_POSITION                0x00000000
#define _CFD2MASK22_MSID_MASK                    0x000007FF
#define _CFD2MASK22_MSID_LENGTH                  0x0000000B

#define _CFD2MASK22_MEID_POSITION                0x0000000B
#define _CFD2MASK22_MEID_MASK                    0x1FFFF800
#define _CFD2MASK22_MEID_LENGTH                  0x00000012

#define _CFD2MASK22_MSID11_POSITION              0x0000001D
#define _CFD2MASK22_MSID11_MASK                  0x20000000
#define _CFD2MASK22_MSID11_LENGTH                0x00000001

#define _CFD2MASK22_MIDE_POSITION                0x0000001E
#define _CFD2MASK22_MIDE_MASK                    0x40000000
#define _CFD2MASK22_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ23_SID_POSITION               0x00000000
#define _CFD2FLTOBJ23_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ23_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ23_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ23_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ23_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ23_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ23_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ23_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ23_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ23_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ23_EXIDE_LENGTH               0x00000001

#define _CFD2MASK23_MSID_POSITION                0x00000000
#define _CFD2MASK23_MSID_MASK                    0x000007FF
#define _CFD2MASK23_MSID_LENGTH                  0x0000000B

#define _CFD2MASK23_MEID_POSITION                0x0000000B
#define _CFD2MASK23_MEID_MASK                    0x1FFFF800
#define _CFD2MASK23_MEID_LENGTH                  0x00000012

#define _CFD2MASK23_MSID11_POSITION              0x0000001D
#define _CFD2MASK23_MSID11_MASK                  0x20000000
#define _CFD2MASK23_MSID11_LENGTH                0x00000001

#define _CFD2MASK23_MIDE_POSITION                0x0000001E
#define _CFD2MASK23_MIDE_MASK                    0x40000000
#define _CFD2MASK23_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ24_SID_POSITION               0x00000000
#define _CFD2FLTOBJ24_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ24_SID_LENGTH                 0x0000000B

