Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD3INT_TXATIF_POSITION                 0x0000000A
#define _CFD3INT_TXATIF_MASK                     0x00000400
#define _CFD3INT_TXATIF_LENGTH                   0x00000001

#define _CFD3INT_RXOVIF_POSITION                 0x0000000B
#define _CFD3INT_RXOVIF_MASK                     0x00000800
#define _CFD3INT_RXOVIF_LENGTH                   0x00000001

#define _CFD3INT_SERRIF_POSITION                 0x0000000C
#define _CFD3INT_SERRIF_MASK                     0x00001000
#define _CFD3INT_SERRIF_LENGTH                   0x00000001

#define _CFD3INT_CERRIF_POSITION                 0x0000000D
#define _CFD3INT_CERRIF_MASK                     0x00002000
#define _CFD3INT_CERRIF_LENGTH                   0x00000001

#define _CFD3INT_WAKIF_POSITION                  0x0000000E
#define _CFD3INT_WAKIF_MASK                      0x00004000
#define _CFD3INT_WAKIF_LENGTH                    0x00000001

#define _CFD3INT_IVMIF_POSITION                  0x0000000F
#define _CFD3INT_IVMIF_MASK                      0x00008000
#define _CFD3INT_IVMIF_LENGTH                    0x00000001

#define _CFD3INT_TXIE_POSITION                   0x00000010
#define _CFD3INT_TXIE_MASK                       0x00010000
#define _CFD3INT_TXIE_LENGTH                     0x00000001

#define _CFD3INT_RXIE_POSITION                   0x00000011
#define _CFD3INT_RXIE_MASK                       0x00020000
#define _CFD3INT_RXIE_LENGTH                     0x00000001

#define _CFD3INT_TBCIE_POSITION                  0x00000012
#define _CFD3INT_TBCIE_MASK                      0x00040000
#define _CFD3INT_TBCIE_LENGTH                    0x00000001

#define _CFD3INT_MODIE_POSITION                  0x00000013
#define _CFD3INT_MODIE_MASK                      0x00080000
#define _CFD3INT_MODIE_LENGTH                    0x00000001

#define _CFD3INT_TEFIE_POSITION                  0x00000014
#define _CFD3INT_TEFIE_MASK                      0x00100000
#define _CFD3INT_TEFIE_LENGTH                    0x00000001

#define _CFD3INT_ECCIE_POSITION                  0x00000018
#define _CFD3INT_ECCIE_MASK                      0x01000000
#define _CFD3INT_ECCIE_LENGTH                    0x00000001

#define _CFD3INT_SPICRCIE_POSITION               0x00000019
#define _CFD3INT_SPICRCIE_MASK                   0x02000000
#define _CFD3INT_SPICRCIE_LENGTH                 0x00000001

#define _CFD3INT_TXATIE_POSITION                 0x0000001A
#define _CFD3INT_TXATIE_MASK                     0x04000000
#define _CFD3INT_TXATIE_LENGTH                   0x00000001

#define _CFD3INT_RXOVIE_POSITION                 0x0000001B
#define _CFD3INT_RXOVIE_MASK                     0x08000000
#define _CFD3INT_RXOVIE_LENGTH                   0x00000001

#define _CFD3INT_SERRIE_POSITION                 0x0000001C
#define _CFD3INT_SERRIE_MASK                     0x10000000
#define _CFD3INT_SERRIE_LENGTH                   0x00000001

#define _CFD3INT_CERRIE_POSITION                 0x0000001D
#define _CFD3INT_CERRIE_MASK                     0x20000000
#define _CFD3INT_CERRIE_LENGTH                   0x00000001

#define _CFD3INT_WAKIE_POSITION                  0x0000001E
#define _CFD3INT_WAKIE_MASK                      0x40000000
#define _CFD3INT_WAKIE_LENGTH                    0x00000001

#define _CFD3INT_IVMIE_POSITION                  0x0000001F
#define _CFD3INT_IVMIE_MASK                      0x80000000
#define _CFD3INT_IVMIE_LENGTH                    0x00000001

#define _CFD3INT_w_POSITION                      0x00000000
#define _CFD3INT_w_MASK                          0xFFFFFFFF
#define _CFD3INT_w_LENGTH                        0x00000020

#define _CFD3RXIF_RFIF_POSITION                  0x00000001
#define _CFD3RXIF_RFIF_MASK                      0xFFFFFFFE
#define _CFD3RXIF_RFIF_LENGTH                    0x0000001F

#define _CFD3TXIF_TFIF_POSITION                  0x00000000
#define _CFD3TXIF_TFIF_MASK                      0xFFFFFFFF
#define _CFD3TXIF_TFIF_LENGTH                    0x00000020

#define _CFD3RXOVIF_RFOVIF_POSITION              0x00000001
#define _CFD3RXOVIF_RFOVIF_MASK                  0xFFFFFFFE
#define _CFD3RXOVIF_RFOVIF_LENGTH                0x0000001F

#define _CFD3TXATIF_TFATIF_POSITION              0x00000000
#define _CFD3TXATIF_TFATIF_MASK                  0xFFFFFFFF
#define _CFD3TXATIF_TFATIF_LENGTH                0x00000020

#define _CFD3TXREQ_TXREQ_POSITION                0x00000000
#define _CFD3TXREQ_TXREQ_MASK                    0xFFFFFFFF
#define _CFD3TXREQ_TXREQ_LENGTH                  0x00000020

#define _CFD3TREC_RERRCNT_POSITION               0x00000000
#define _CFD3TREC_RERRCNT_MASK                   0x000000FF
#define _CFD3TREC_RERRCNT_LENGTH                 0x00000008

#define _CFD3TREC_TERRCNT_POSITION               0x00000008
#define _CFD3TREC_TERRCNT_MASK                   0x0000FF00
#define _CFD3TREC_TERRCNT_LENGTH                 0x00000008

#define _CFD3TREC_EWARN_POSITION                 0x00000010
#define _CFD3TREC_EWARN_MASK                     0x00010000
#define _CFD3TREC_EWARN_LENGTH                   0x00000001

#define _CFD3TREC_RXWARN_POSITION                0x00000011
#define _CFD3TREC_RXWARN_MASK                    0x00020000
#define _CFD3TREC_RXWARN_LENGTH                  0x00000001

#define _CFD3TREC_TXWARN_POSITION                0x00000012
#define _CFD3TREC_TXWARN_MASK                    0x00040000
#define _CFD3TREC_TXWARN_LENGTH                  0x00000001

#define _CFD3TREC_RXBP_POSITION                  0x00000013
#define _CFD3TREC_RXBP_MASK                      0x00080000
#define _CFD3TREC_RXBP_LENGTH                    0x00000001

#define _CFD3TREC_TXBP_POSITION                  0x00000014
#define _CFD3TREC_TXBP_MASK                      0x00100000
#define _CFD3TREC_TXBP_LENGTH                    0x00000001

#define _CFD3TREC_TXBO_POSITION                  0x00000015
#define _CFD3TREC_TXBO_MASK                      0x00200000
#define _CFD3TREC_TXBO_LENGTH                    0x00000001

#define _CFD3TREC_w_POSITION                     0x00000000
#define _CFD3TREC_w_MASK                         0xFFFFFFFF
#define _CFD3TREC_w_LENGTH                       0x00000020

#define _CFD3BDIAG0_NRERRCNT_POSITION            0x00000000
#define _CFD3BDIAG0_NRERRCNT_MASK                0x000000FF
#define _CFD3BDIAG0_NRERRCNT_LENGTH              0x00000008

#define _CFD3BDIAG0_NTERRCNT_POSITION            0x00000008
#define _CFD3BDIAG0_NTERRCNT_MASK                0x0000FF00
#define _CFD3BDIAG0_NTERRCNT_LENGTH              0x00000008

#define _CFD3BDIAG0_DRERRCNT_POSITION            0x00000010
#define _CFD3BDIAG0_DRERRCNT_MASK                0x00FF0000
#define _CFD3BDIAG0_DRERRCNT_LENGTH              0x00000008

#define _CFD3BDIAG0_DTERRCNT_POSITION            0x00000018
#define _CFD3BDIAG0_DTERRCNT_MASK                0xFF000000
#define _CFD3BDIAG0_DTERRCNT_LENGTH              0x00000008

