Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD3FIFOCON12_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON12_RTREN_MASK                0x00000040
#define _CFD3FIFOCON12_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON12_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON12_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON12_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON12_UINC_POSITION             0x00000008
#define _CFD3FIFOCON12_UINC_MASK                 0x00000100
#define _CFD3FIFOCON12_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON12_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON12_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON12_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON12_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON12_FRESET_MASK               0x00000400
#define _CFD3FIFOCON12_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON12_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON12_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON12_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON12_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON12_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON12_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON12_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON12_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON12_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON12_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON12_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON12_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA12_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA12_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA12_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA12_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA12_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA12_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA12_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA12_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA12_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA12_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA12_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA12_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA12_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA12_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA12_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA12_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA12_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA12_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA12_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA12_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA12_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA12_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA12_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA12_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA12_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA12_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA12_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA12_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA12_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA12_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON13_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON13_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON13_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON13_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON13_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON13_TFHRFHIE_LENGTH           0x00000001

#define _CFD3FIFOCON13_TFERFFIE_POSITION         0x00000002
#define _CFD3FIFOCON13_TFERFFIE_MASK             0x00000004
#define _CFD3FIFOCON13_TFERFFIE_LENGTH           0x00000001

#define _CFD3FIFOCON13_RXOVIE_POSITION           0x00000003
#define _CFD3FIFOCON13_RXOVIE_MASK               0x00000008
#define _CFD3FIFOCON13_RXOVIE_LENGTH             0x00000001

#define _CFD3FIFOCON13_TXATIE_POSITION           0x00000004
#define _CFD3FIFOCON13_TXATIE_MASK               0x00000010
#define _CFD3FIFOCON13_TXATIE_LENGTH             0x00000001

#define _CFD3FIFOCON13_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON13_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON13_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON13_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON13_RTREN_MASK                0x00000040
#define _CFD3FIFOCON13_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON13_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON13_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON13_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON13_UINC_POSITION             0x00000008
#define _CFD3FIFOCON13_UINC_MASK                 0x00000100
#define _CFD3FIFOCON13_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON13_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON13_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON13_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON13_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON13_FRESET_MASK               0x00000400
#define _CFD3FIFOCON13_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON13_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON13_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON13_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON13_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON13_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON13_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON13_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON13_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON13_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON13_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON13_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON13_PLSIZE_LENGTH             0x00000003

