Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD4TSCON_TBCEN_POSITION                0x00000010
#define _CFD4TSCON_TBCEN_MASK                    0x00010000
#define _CFD4TSCON_TBCEN_LENGTH                  0x00000001

#define _CFD4TSCON_TSEOF_POSITION                0x00000011
#define _CFD4TSCON_TSEOF_MASK                    0x00020000
#define _CFD4TSCON_TSEOF_LENGTH                  0x00000001

#define _CFD4TSCON_TSRES_POSITION                0x00000012
#define _CFD4TSCON_TSRES_MASK                    0x00040000
#define _CFD4TSCON_TSRES_LENGTH                  0x00000001

#define _CFD4VEC_ICODE_POSITION                  0x00000000
#define _CFD4VEC_ICODE_MASK                      0x0000007F
#define _CFD4VEC_ICODE_LENGTH                    0x00000007

#define _CFD4VEC_FILHIT_POSITION                 0x00000008
#define _CFD4VEC_FILHIT_MASK                     0x00001F00
#define _CFD4VEC_FILHIT_LENGTH                   0x00000005

#define _CFD4VEC_TXCODE_POSITION                 0x00000010
#define _CFD4VEC_TXCODE_MASK                     0x007F0000
#define _CFD4VEC_TXCODE_LENGTH                   0x00000007

#define _CFD4VEC_RXCODE_POSITION                 0x00000018
#define _CFD4VEC_RXCODE_MASK                     0x7F000000
#define _CFD4VEC_RXCODE_LENGTH                   0x00000007

#define _CFD4VEC_w_POSITION                      0x00000000
#define _CFD4VEC_w_MASK                          0xFFFFFFFF
#define _CFD4VEC_w_LENGTH                        0x00000020

#define _CFD4INT_TXIF_POSITION                   0x00000000
#define _CFD4INT_TXIF_MASK                       0x00000001
#define _CFD4INT_TXIF_LENGTH                     0x00000001

#define _CFD4INT_RXIF_POSITION                   0x00000001
#define _CFD4INT_RXIF_MASK                       0x00000002
#define _CFD4INT_RXIF_LENGTH                     0x00000001

#define _CFD4INT_TBCIF_POSITION                  0x00000002
#define _CFD4INT_TBCIF_MASK                      0x00000004
#define _CFD4INT_TBCIF_LENGTH                    0x00000001

#define _CFD4INT_MODIF_POSITION                  0x00000003
#define _CFD4INT_MODIF_MASK                      0x00000008
#define _CFD4INT_MODIF_LENGTH                    0x00000001

#define _CFD4INT_TEFIF_POSITION                  0x00000004
#define _CFD4INT_TEFIF_MASK                      0x00000010
#define _CFD4INT_TEFIF_LENGTH                    0x00000001

#define _CFD4INT_ECCIF_POSITION                  0x00000008
#define _CFD4INT_ECCIF_MASK                      0x00000100
#define _CFD4INT_ECCIF_LENGTH                    0x00000001

#define _CFD4INT_SPICRCIF_POSITION               0x00000009
#define _CFD4INT_SPICRCIF_MASK                   0x00000200
#define _CFD4INT_SPICRCIF_LENGTH                 0x00000001

#define _CFD4INT_TXATIF_POSITION                 0x0000000A
#define _CFD4INT_TXATIF_MASK                     0x00000400
#define _CFD4INT_TXATIF_LENGTH                   0x00000001

#define _CFD4INT_RXOVIF_POSITION                 0x0000000B
#define _CFD4INT_RXOVIF_MASK                     0x00000800
#define _CFD4INT_RXOVIF_LENGTH                   0x00000001

#define _CFD4INT_SERRIF_POSITION                 0x0000000C
#define _CFD4INT_SERRIF_MASK                     0x00001000
#define _CFD4INT_SERRIF_LENGTH                   0x00000001

#define _CFD4INT_CERRIF_POSITION                 0x0000000D
#define _CFD4INT_CERRIF_MASK                     0x00002000
#define _CFD4INT_CERRIF_LENGTH                   0x00000001

#define _CFD4INT_WAKIF_POSITION                  0x0000000E
#define _CFD4INT_WAKIF_MASK                      0x00004000
#define _CFD4INT_WAKIF_LENGTH                    0x00000001

#define _CFD4INT_IVMIF_POSITION                  0x0000000F
#define _CFD4INT_IVMIF_MASK                      0x00008000
#define _CFD4INT_IVMIF_LENGTH                    0x00000001

#define _CFD4INT_TXIE_POSITION                   0x00000010
#define _CFD4INT_TXIE_MASK                       0x00010000
#define _CFD4INT_TXIE_LENGTH                     0x00000001

#define _CFD4INT_RXIE_POSITION                   0x00000011
#define _CFD4INT_RXIE_MASK                       0x00020000
#define _CFD4INT_RXIE_LENGTH                     0x00000001

#define _CFD4INT_TBCIE_POSITION                  0x00000012
#define _CFD4INT_TBCIE_MASK                      0x00040000
#define _CFD4INT_TBCIE_LENGTH                    0x00000001

#define _CFD4INT_MODIE_POSITION                  0x00000013
#define _CFD4INT_MODIE_MASK                      0x00080000
#define _CFD4INT_MODIE_LENGTH                    0x00000001

#define _CFD4INT_TEFIE_POSITION                  0x00000014
#define _CFD4INT_TEFIE_MASK                      0x00100000
#define _CFD4INT_TEFIE_LENGTH                    0x00000001

#define _CFD4INT_ECCIE_POSITION                  0x00000018
#define _CFD4INT_ECCIE_MASK                      0x01000000
#define _CFD4INT_ECCIE_LENGTH                    0x00000001

#define _CFD4INT_SPICRCIE_POSITION               0x00000019
#define _CFD4INT_SPICRCIE_MASK                   0x02000000
#define _CFD4INT_SPICRCIE_LENGTH                 0x00000001

#define _CFD4INT_TXATIE_POSITION                 0x0000001A
#define _CFD4INT_TXATIE_MASK                     0x04000000
#define _CFD4INT_TXATIE_LENGTH                   0x00000001

#define _CFD4INT_RXOVIE_POSITION                 0x0000001B
#define _CFD4INT_RXOVIE_MASK                     0x08000000
#define _CFD4INT_RXOVIE_LENGTH                   0x00000001

#define _CFD4INT_SERRIE_POSITION                 0x0000001C
#define _CFD4INT_SERRIE_MASK                     0x10000000
#define _CFD4INT_SERRIE_LENGTH                   0x00000001

#define _CFD4INT_CERRIE_POSITION                 0x0000001D
#define _CFD4INT_CERRIE_MASK                     0x20000000
#define _CFD4INT_CERRIE_LENGTH                   0x00000001

#define _CFD4INT_WAKIE_POSITION                  0x0000001E
#define _CFD4INT_WAKIE_MASK                      0x40000000
#define _CFD4INT_WAKIE_LENGTH                    0x00000001

#define _CFD4INT_IVMIE_POSITION                  0x0000001F
#define _CFD4INT_IVMIE_MASK                      0x80000000
#define _CFD4INT_IVMIE_LENGTH                    0x00000001

#define _CFD4INT_w_POSITION                      0x00000000
#define _CFD4INT_w_MASK                          0xFFFFFFFF
#define _CFD4INT_w_LENGTH                        0x00000020

#define _CFD4RXIF_RFIF_POSITION                  0x00000001
#define _CFD4RXIF_RFIF_MASK                      0xFFFFFFFE
#define _CFD4RXIF_RFIF_LENGTH                    0x0000001F

#define _CFD4TXIF_TFIF_POSITION                  0x00000000
#define _CFD4TXIF_TFIF_MASK                      0xFFFFFFFF
#define _CFD4TXIF_TFIF_LENGTH                    0x00000020

#define _CFD4RXOVIF_RFOVIF_POSITION              0x00000001
#define _CFD4RXOVIF_RFOVIF_MASK                  0xFFFFFFFE
#define _CFD4RXOVIF_RFOVIF_LENGTH                0x0000001F

#define _CFD4TXATIF_TFATIF_POSITION              0x00000000
#define _CFD4TXATIF_TFATIF_MASK                  0xFFFFFFFF
#define _CFD4TXATIF_TFATIF_LENGTH                0x00000020

#define _CFD4TXREQ_TXREQ_POSITION                0x00000000
#define _CFD4TXREQ_TXREQ_MASK                    0xFFFFFFFF
#define _CFD4TXREQ_TXREQ_LENGTH                  0x00000020

#define _CFD4TREC_RERRCNT_POSITION               0x00000000
#define _CFD4TREC_RERRCNT_MASK                   0x000000FF
#define _CFD4TREC_RERRCNT_LENGTH                 0x00000008

#define _CFD4TREC_TERRCNT_POSITION               0x00000008
#define _CFD4TREC_TERRCNT_MASK                   0x0000FF00
#define _CFD4TREC_TERRCNT_LENGTH                 0x00000008

#define _CFD4TREC_EWARN_POSITION                 0x00000010
#define _CFD4TREC_EWARN_MASK                     0x00010000
#define _CFD4TREC_EWARN_LENGTH                   0x00000001

#define _CFD4TREC_RXWARN_POSITION                0x00000011
#define _CFD4TREC_RXWARN_MASK                    0x00020000
#define _CFD4TREC_RXWARN_LENGTH                  0x00000001

#define _CFD4TREC_TXWARN_POSITION                0x00000012
#define _CFD4TREC_TXWARN_MASK                    0x00040000
#define _CFD4TREC_TXWARN_LENGTH                  0x00000001

#define _CFD4TREC_RXBP_POSITION                  0x00000013
#define _CFD4TREC_RXBP_MASK                      0x00080000
#define _CFD4TREC_RXBP_LENGTH                    0x00000001

