Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _CFD4FIFOCON7_FRESET_POSITION            0x0000000A
#define _CFD4FIFOCON7_FRESET_MASK                0x00000400
#define _CFD4FIFOCON7_FRESET_LENGTH              0x00000001

#define _CFD4FIFOCON7_TXPRI_POSITION             0x00000010
#define _CFD4FIFOCON7_TXPRI_MASK                 0x001F0000
#define _CFD4FIFOCON7_TXPRI_LENGTH               0x00000005

#define _CFD4FIFOCON7_TXAT_POSITION              0x00000015
#define _CFD4FIFOCON7_TXAT_MASK                  0x00600000
#define _CFD4FIFOCON7_TXAT_LENGTH                0x00000002

#define _CFD4FIFOCON7_FSIZE_POSITION             0x00000018
#define _CFD4FIFOCON7_FSIZE_MASK                 0x1F000000
#define _CFD4FIFOCON7_FSIZE_LENGTH               0x00000005

#define _CFD4FIFOCON7_PLSIZE_POSITION            0x0000001D
#define _CFD4FIFOCON7_PLSIZE_MASK                0xE0000000
#define _CFD4FIFOCON7_PLSIZE_LENGTH              0x00000003

#define _CFD4FIFOSTA7_TFNRFNIF_POSITION          0x00000000
#define _CFD4FIFOSTA7_TFNRFNIF_MASK              0x00000001
#define _CFD4FIFOSTA7_TFNRFNIF_LENGTH            0x00000001

#define _CFD4FIFOSTA7_TFHRFHIF_POSITION          0x00000001
#define _CFD4FIFOSTA7_TFHRFHIF_MASK              0x00000002
#define _CFD4FIFOSTA7_TFHRFHIF_LENGTH            0x00000001

#define _CFD4FIFOSTA7_TFERFFIF_POSITION          0x00000002
#define _CFD4FIFOSTA7_TFERFFIF_MASK              0x00000004
#define _CFD4FIFOSTA7_TFERFFIF_LENGTH            0x00000001

#define _CFD4FIFOSTA7_RXOVIF_POSITION            0x00000003
#define _CFD4FIFOSTA7_RXOVIF_MASK                0x00000008
#define _CFD4FIFOSTA7_RXOVIF_LENGTH              0x00000001

#define _CFD4FIFOSTA7_TXATIF_POSITION            0x00000004
#define _CFD4FIFOSTA7_TXATIF_MASK                0x00000010
#define _CFD4FIFOSTA7_TXATIF_LENGTH              0x00000001

#define _CFD4FIFOSTA7_TXERR_POSITION             0x00000005
#define _CFD4FIFOSTA7_TXERR_MASK                 0x00000020
#define _CFD4FIFOSTA7_TXERR_LENGTH               0x00000001

#define _CFD4FIFOSTA7_TXLARB_POSITION            0x00000006
#define _CFD4FIFOSTA7_TXLARB_MASK                0x00000040
#define _CFD4FIFOSTA7_TXLARB_LENGTH              0x00000001

#define _CFD4FIFOSTA7_TXABT_POSITION             0x00000007
#define _CFD4FIFOSTA7_TXABT_MASK                 0x00000080
#define _CFD4FIFOSTA7_TXABT_LENGTH               0x00000001

#define _CFD4FIFOSTA7_FIFOCI_POSITION            0x00000008
#define _CFD4FIFOSTA7_FIFOCI_MASK                0x00001F00
#define _CFD4FIFOSTA7_FIFOCI_LENGTH              0x00000005

#define _CFD4FIFOUA7_FIFOUA_POSITION             0x00000000
#define _CFD4FIFOUA7_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD4FIFOUA7_FIFOUA_LENGTH               0x00000020

#define _CFD4FIFOCON8_TFNRFNIE_POSITION          0x00000000
#define _CFD4FIFOCON8_TFNRFNIE_MASK              0x00000001
#define _CFD4FIFOCON8_TFNRFNIE_LENGTH            0x00000001

#define _CFD4FIFOCON8_TFHRFHIE_POSITION          0x00000001
#define _CFD4FIFOCON8_TFHRFHIE_MASK              0x00000002
#define _CFD4FIFOCON8_TFHRFHIE_LENGTH            0x00000001

#define _CFD4FIFOCON8_TFERFFIE_POSITION          0x00000002
#define _CFD4FIFOCON8_TFERFFIE_MASK              0x00000004
#define _CFD4FIFOCON8_TFERFFIE_LENGTH            0x00000001

#define _CFD4FIFOCON8_RXOVIE_POSITION            0x00000003
#define _CFD4FIFOCON8_RXOVIE_MASK                0x00000008
#define _CFD4FIFOCON8_RXOVIE_LENGTH              0x00000001

#define _CFD4FIFOCON8_TXATIE_POSITION            0x00000004
#define _CFD4FIFOCON8_TXATIE_MASK                0x00000010
#define _CFD4FIFOCON8_TXATIE_LENGTH              0x00000001

#define _CFD4FIFOCON8_RXTSEN_POSITION            0x00000005
#define _CFD4FIFOCON8_RXTSEN_MASK                0x00000020
#define _CFD4FIFOCON8_RXTSEN_LENGTH              0x00000001

#define _CFD4FIFOCON8_RTREN_POSITION             0x00000006
#define _CFD4FIFOCON8_RTREN_MASK                 0x00000040
#define _CFD4FIFOCON8_RTREN_LENGTH               0x00000001

#define _CFD4FIFOCON8_TXEN_POSITION              0x00000007
#define _CFD4FIFOCON8_TXEN_MASK                  0x00000080
#define _CFD4FIFOCON8_TXEN_LENGTH                0x00000001

#define _CFD4FIFOCON8_UINC_POSITION              0x00000008
#define _CFD4FIFOCON8_UINC_MASK                  0x00000100
#define _CFD4FIFOCON8_UINC_LENGTH                0x00000001

#define _CFD4FIFOCON8_TXREQ_POSITION             0x00000009
#define _CFD4FIFOCON8_TXREQ_MASK                 0x00000200
#define _CFD4FIFOCON8_TXREQ_LENGTH               0x00000001

#define _CFD4FIFOCON8_FRESET_POSITION            0x0000000A
#define _CFD4FIFOCON8_FRESET_MASK                0x00000400
#define _CFD4FIFOCON8_FRESET_LENGTH              0x00000001

#define _CFD4FIFOCON8_TXPRI_POSITION             0x00000010
#define _CFD4FIFOCON8_TXPRI_MASK                 0x001F0000
#define _CFD4FIFOCON8_TXPRI_LENGTH               0x00000005

#define _CFD4FIFOCON8_TXAT_POSITION              0x00000015
#define _CFD4FIFOCON8_TXAT_MASK                  0x00600000
#define _CFD4FIFOCON8_TXAT_LENGTH                0x00000002

#define _CFD4FIFOCON8_FSIZE_POSITION             0x00000018
#define _CFD4FIFOCON8_FSIZE_MASK                 0x1F000000
#define _CFD4FIFOCON8_FSIZE_LENGTH               0x00000005

#define _CFD4FIFOCON8_PLSIZE_POSITION            0x0000001D
#define _CFD4FIFOCON8_PLSIZE_MASK                0xE0000000
#define _CFD4FIFOCON8_PLSIZE_LENGTH              0x00000003

#define _CFD4FIFOSTA8_TFNRFNIF_POSITION          0x00000000
#define _CFD4FIFOSTA8_TFNRFNIF_MASK              0x00000001
#define _CFD4FIFOSTA8_TFNRFNIF_LENGTH            0x00000001

#define _CFD4FIFOSTA8_TFHRFHIF_POSITION          0x00000001
#define _CFD4FIFOSTA8_TFHRFHIF_MASK              0x00000002
#define _CFD4FIFOSTA8_TFHRFHIF_LENGTH            0x00000001

#define _CFD4FIFOSTA8_TFERFFIF_POSITION          0x00000002
#define _CFD4FIFOSTA8_TFERFFIF_MASK              0x00000004
#define _CFD4FIFOSTA8_TFERFFIF_LENGTH            0x00000001

#define _CFD4FIFOSTA8_RXOVIF_POSITION            0x00000003
#define _CFD4FIFOSTA8_RXOVIF_MASK                0x00000008
#define _CFD4FIFOSTA8_RXOVIF_LENGTH              0x00000001

