Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcm064.h
#define _ADEVCFG0_POSCBOOST_POSITION             0x00000015
#define _ADEVCFG0_POSCBOOST_MASK                 0x00200000
#define _ADEVCFG0_POSCBOOST_LENGTH               0x00000001

#define _ADEVCFG0_POSCFGAIN_POSITION             0x00000016
#define _ADEVCFG0_POSCFGAIN_MASK                 0x00C00000
#define _ADEVCFG0_POSCFGAIN_LENGTH               0x00000002

#define _ADEVCFG0_POSCAGCDLY_POSITION            0x00000018
#define _ADEVCFG0_POSCAGCDLY_MASK                0x03000000
#define _ADEVCFG0_POSCAGCDLY_LENGTH              0x00000002

#define _ADEVCFG0_POSCAGCRNG_POSITION            0x0000001A
#define _ADEVCFG0_POSCAGCRNG_MASK                0x04000000
#define _ADEVCFG0_POSCAGCRNG_LENGTH              0x00000001

#define _ADEVCFG0_POSCAGC_POSITION               0x0000001B
#define _ADEVCFG0_POSCAGC_MASK                   0x08000000
#define _ADEVCFG0_POSCAGC_LENGTH                 0x00000001

#define _ADEVCFG0_EJTAGBEN_POSITION              0x0000001E
#define _ADEVCFG0_EJTAGBEN_MASK                  0x40000000
#define _ADEVCFG0_EJTAGBEN_LENGTH                0x00000001

#define _ADEVCFG0_FDEBUG_POSITION                0x00000000
#define _ADEVCFG0_FDEBUG_MASK                    0x00000003
#define _ADEVCFG0_FDEBUG_LENGTH                  0x00000002

#define _ADEVCFG0_w_POSITION                     0x00000000
#define _ADEVCFG0_w_MASK                         0xFFFFFFFF
#define _ADEVCFG0_w_LENGTH                       0x00000020

#define _ADEVCP_CP_POSITION                      0x0000001C
#define _ADEVCP_CP_MASK                          0x10000000
#define _ADEVCP_CP_LENGTH                        0x00000001

#define _ADEVCP_w_POSITION                       0x00000000
#define _ADEVCP_w_MASK                           0xFFFFFFFF
#define _ADEVCP_w_LENGTH                         0x00000020

#define _ASEQ_TSEQ_POSITION                      0x00000000
#define _ASEQ_TSEQ_MASK                          0x0000FFFF
#define _ASEQ_TSEQ_LENGTH                        0x00000010

#define _ASEQ_CSEQ_POSITION                      0x00000010
#define _ASEQ_CSEQ_MASK                          0xFFFF0000
#define _ASEQ_CSEQ_LENGTH                        0x00000010

#define _ASEQ_w_POSITION                         0x00000000
#define _ASEQ_w_MASK                             0xFFFFFFFF
#define _ASEQ_w_LENGTH                           0x00000020

#define _AUBADEVCFG3_USERID_POSITION             0x00000000
#define _AUBADEVCFG3_USERID_MASK                 0x0000FFFF
#define _AUBADEVCFG3_USERID_LENGTH               0x00000010

#define _AUBADEVCFG3_PWMLOCK_POSITION            0x00000014
#define _AUBADEVCFG3_PWMLOCK_MASK                0x00100000
#define _AUBADEVCFG3_PWMLOCK_LENGTH              0x00000001

#define _AUBADEVCFG3_FUSBIDIO2_POSITION          0x00000016
#define _AUBADEVCFG3_FUSBIDIO2_MASK              0x00400000
#define _AUBADEVCFG3_FUSBIDIO2_LENGTH            0x00000001

#define _AUBADEVCFG3_FVBUSIO2_POSITION           0x00000017
#define _AUBADEVCFG3_FVBUSIO2_MASK               0x00800000
#define _AUBADEVCFG3_FVBUSIO2_LENGTH             0x00000001

#define _AUBADEVCFG3_PGL1WAY_POSITION            0x0000001B
#define _AUBADEVCFG3_PGL1WAY_MASK                0x08000000
#define _AUBADEVCFG3_PGL1WAY_LENGTH              0x00000001

#define _AUBADEVCFG3_PMDL1WAY_POSITION           0x0000001C
#define _AUBADEVCFG3_PMDL1WAY_MASK               0x10000000
#define _AUBADEVCFG3_PMDL1WAY_LENGTH             0x00000001

#define _AUBADEVCFG3_IOL1WAY_POSITION            0x0000001D
#define _AUBADEVCFG3_IOL1WAY_MASK                0x20000000
#define _AUBADEVCFG3_IOL1WAY_LENGTH              0x00000001

#define _AUBADEVCFG3_FUSBIDIO1_POSITION          0x0000001E
#define _AUBADEVCFG3_FUSBIDIO1_MASK              0x40000000
#define _AUBADEVCFG3_FUSBIDIO1_LENGTH            0x00000001

#define _AUBADEVCFG3_FVBUSIO1_POSITION           0x0000001F
#define _AUBADEVCFG3_FVBUSIO1_MASK               0x80000000
#define _AUBADEVCFG3_FVBUSIO1_LENGTH             0x00000001

#define _AUBADEVCFG3_w_POSITION                  0x00000000
#define _AUBADEVCFG3_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG3_w_LENGTH                    0x00000020

#define _AUBADEVCFG2_FPLLIDIV_POSITION           0x00000000
#define _AUBADEVCFG2_FPLLIDIV_MASK               0x00000007
#define _AUBADEVCFG2_FPLLIDIV_LENGTH             0x00000003

#define _AUBADEVCFG2_FPLLRNG_POSITION            0x00000004
#define _AUBADEVCFG2_FPLLRNG_MASK                0x00000070
#define _AUBADEVCFG2_FPLLRNG_LENGTH              0x00000003

#define _AUBADEVCFG2_FPLLICLK_POSITION           0x00000007
#define _AUBADEVCFG2_FPLLICLK_MASK               0x00000080
#define _AUBADEVCFG2_FPLLICLK_LENGTH             0x00000001

#define _AUBADEVCFG2_FPLLMULT_POSITION           0x00000008
#define _AUBADEVCFG2_FPLLMULT_MASK               0x00007F00
#define _AUBADEVCFG2_FPLLMULT_LENGTH             0x00000007

#define _AUBADEVCFG2_FPLLODIV_POSITION           0x00000010
#define _AUBADEVCFG2_FPLLODIV_MASK               0x00070000
#define _AUBADEVCFG2_FPLLODIV_LENGTH             0x00000003

#define _AUBADEVCFG2_BORSEL_POSITION             0x0000001D
#define _AUBADEVCFG2_BORSEL_MASK                 0x20000000
#define _AUBADEVCFG2_BORSEL_LENGTH               0x00000001

#define _AUBADEVCFG2_UPLLEN_POSITION             0x0000001F
#define _AUBADEVCFG2_UPLLEN_MASK                 0x80000000
#define _AUBADEVCFG2_UPLLEN_LENGTH               0x00000001

#define _AUBADEVCFG2_w_POSITION                  0x00000000
#define _AUBADEVCFG2_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG2_w_LENGTH                    0x00000020

#define _AUBADEVCFG1_FNOSC_POSITION              0x00000000
#define _AUBADEVCFG1_FNOSC_MASK                  0x00000007
#define _AUBADEVCFG1_FNOSC_LENGTH                0x00000003

#define _AUBADEVCFG1_DMTINTV_POSITION            0x00000003
#define _AUBADEVCFG1_DMTINTV_MASK                0x00000038
#define _AUBADEVCFG1_DMTINTV_LENGTH              0x00000003

#define _AUBADEVCFG1_FSOSCEN_POSITION            0x00000006
#define _AUBADEVCFG1_FSOSCEN_MASK                0x00000040
#define _AUBADEVCFG1_FSOSCEN_LENGTH              0x00000001

